{
  "personal_years": [
    {
      "number": 9,
      "meaning": "Kết thúc chu kỳ, nhân đạo, cống hiến.",
      "opportunities": "Giúp đỡ cộng đồng, hoàn thiện bản thân, buông bỏ quá khứ.",
      "challenges": "Cảm giác mất mát, khó buông tay.",
      "advice": "Chấp nhận kết thúc, cống hiến cho điều lớn lao hơn, chuẩn bị cho chu kỳ mới.",
      "direction": "Hoàn thành các dự án dang dở, tham gia hoạt động từ thiện hoặc cộng đồng, viết nhật ký để nhìn lại và buông bỏ những gì không còn phù hợp."
    },
    {
      "number": 1,
      "meaning": "Bắt đầu chu kỳ mới, độc lập, lãnh đạo.",
      "opportunities": "Khởi đầu dự án mới, phát triển cá nhân, khẳng định bản thân.",
      "challenges": "Đối mặt với sự nghi ngờ bản thân, áp lực phải dẫn đầu.",
      "advice": "Tập trung vào mục tiêu cá nhân, dám bước ra khỏi vùng an toàn, tin vào khả năng lãnh đạo của bạn.",
      "direction": "Lập kế hoạch khởi nghiệp hoặc dự án cá nhân, tham gia khóa học kỹ năng mới (như lãnh đạo, marketing), thử sức ở một lĩnh vực chưa từng làm."
    },
    {
      "number": 2,
      "meaning": "Hợp tác, nhạy bén, cân bằng.",
      "opportunities": "Xây dựng mối quan hệ, làm việc nhóm, phát triển trực giác.",
      "challenges": "Cảm xúc dễ dao động, khó đưa ra quyết định.",
      "advice": "Lắng nghe trực giác, học cách kiên nhẫn, ưu tiên hòa hợp trong các mối quan hệ.",
      "direction": "Tham gia nhóm làm việc hoặc dự án cộng tác, tìm đối tác kinh doanh, học kỹ năng giao tiếp hoặc đàm phán để xây dựng mạng lưới quan hệ."
    },
    {
      "number": 3,
      "meaning": "Sáng tạo, biểu đạt, niềm vui.",
      "opportunities": "Thể hiện bản thân qua nghệ thuật, giao tiếp, tận hưởng cuộc sống.",
      "challenges": "Phân tán năng lượng, thiếu tập trung.",
      "advice": "Tập trung vào các dự án sáng tạo, kiểm soát cảm xúc, lan tỏa năng lượng tích cực.",
      "direction": "Tham gia lớp học nghệ thuật (vẽ, viết, nhảy), tạo nội dung trên mạng xã hội, tổ chức sự kiện nhỏ để chia sẻ niềm vui."
    },
    {
      "number": 4,
      "meaning": "Xây dựng nền tảng, kỷ luật, ổn định.",
      "opportunities": "Tạo dựng cấu trúc lâu dài, phát triển sự nghiệp, tổ chức cuộc sống.",
      "challenges": "Cảm giác hạn chế, cứng nhắc trong tư duy.",
      "advice": "Lập kế hoạch chi tiết, kiên trì với mục tiêu, tránh trì hoãn.",
      "direction": "Lập ngân sách tài chính, xây dựng thói quen làm việc hiệu quả, đầu tư vào học tập hoặc tài sản lâu dài."
    },
    {
      "number": 5,
      "meaning": "Tự do, thay đổi, khám phá.",
      "opportunities": "Trải nghiệm mới, du lịch, học hỏi đa dạng.",
      "challenges": "Bốc đồng, thiếu ổn định, khó cam kết.",
      "advice": "Đón nhận thay đổi, nhưng giữ kỷ luật với các mục tiêu dài hạn.",
      "direction": "Đi du lịch hoặc trải nghiệm văn hóa mới, học một ngôn ngữ hoặc kỹ năng đa năng, thử kinh doanh tự do."
    },
    {
      "number": 6,
      "meaning": "Trách nhiệm, gia đình, hài hòa.",
      "opportunities": "Chăm sóc gia đình, xây dựng cộng đồng, phát triển tình cảm.",
      "challenges": "Hy sinh quá mức, khó cân bằng trách nhiệm.",
      "advice": "Ưu tiên chăm sóc bản thân, đặt ranh giới rõ ràng, tạo sự hài hòa.",
      "direction": "Tổ chức hoạt động gia đình, tham gia dự án cộng đồng địa phương, học kỹ năng chăm sóc sức khỏe tinh thần."
    },
    {
      "number": 7,
      "meaning": "Nội tâm, tri thức, tâm linh.",
      "opportunities": "Khám phá bản thân, học tập, phát triển tâm linh.",
      "challenges": "Cô lập, thiếu kết nối với thực tế.",
      "advice": "Dành thời gian suy ngẫm, nhưng duy trì kết nối với thế giới bên ngoài.",
      "direction": "Tham gia khóa học triết học hoặc tâm linh, viết lách để khám phá bản thân, thiền định hoặc yoga."
    },
    {
      "number": 8,
      "meaning": "Thành công, quyền lực, tài chính.",
      "opportunities": "Phát triển sự nghiệp, quản lý tài chính, đạt được mục tiêu lớn.",
      "challenges": "Tham vọng quá mức, mất cân bằng cuộc sống.",
      "advice": "Tập trung vào mục tiêu tài chính, nhưng đừng bỏ qua giá trị tinh thần.",
      "direction": "Đầu tư vào kinh doanh hoặc chứng khoán, tham gia khóa học quản lý tài chính, xây dựng thương hiệu cá nhân."
    },
    {
      "number": 11,
      "meaning": "Trực giác, cảm hứng, tâm linh bậc thầy.",
      "opportunities": "Dẫn dắt bằng trực giác, truyền cảm hứng, kết nối tâm linh.",
      "challenges": "Áp lực từ kỳ vọng cao, mất cân bằng cảm xúc.",
      "advice": "Tin vào trực giác, tìm sự cân bằng giữa tâm linh và thực tế.",
      "direction": "Dẫn dắt một dự án sáng tạo, tham gia cộng đồng tâm linh, viết sách hoặc chia sẻ trải nghiệm trực giác."
    },
    {
      "number": 22,
      "meaning": "Xây dựng lớn, thực tiễn, thành công bậc thầy.",
      "opportunities": "Thực hiện dự án lớn, tạo giá trị lâu dài, lãnh đạo cộng đồng.",
      "challenges": "Áp lực từ trách nhiệm lớn, chi tiết phức tạp.",
      "advice": "Lập kế hoạch chi tiết, tận dụng tầm nhìn lớn, kiên nhẫn với quá trình.",
      "direction": "Khởi động một doanh nghiệp xã hội, xây dựng dự án cơ sở hạ tầng, tham gia lãnh đạo tổ chức lớn."
    }
  ]
}