{
  "number": 4,
  "description": "Số đường đời 4 đại diện cho sự thực tế, kỷ luật và đáng tin cậy. Những người mang số 4 thường chăm chỉ, có tổ chức và thích xây dựng nền tảng vững chắc cho cuộc sống. Họ là những người đáng tin cậy, luôn giữ lời hứa, nhưng đôi khi có thể cứng nhắc hoặc thiếu linh hoạt. Số 4 cần học cách thư giãn và chấp nhận sự thay đổi để cân bằng cuộc sống.",
  "compatibility": [
    {
      "partnerNumber": 1,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 1 (Nhà lãnh đạo) là sự kết hợp giữa sự thực tế và tham vọng. Số 4 mang lại sự ổn định và kỷ luật, trong khi số 1 cung cấp tầm nhìn và sự quyết đoán. Sự tương phản này tạo ra một tình yêu cân bằng, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 4 cung cấp nền tảng vững chắc, trong khi số 1 truyền cảm hứng với mục tiêu lớn. Họ bổ sung cho nhau, với số 4 giúp số 1 tổ chức tốt hơn và số 1 khuyến khích số 4 đổi mới. Khả năng xây dựng một mối quan hệ an toàn là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 1 quá kiểm soát, trong khi số 1 có thể thấy số 4 quá cứng nhắc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (ổn định vs. đổi mới) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa kỷ luật và lãnh đạo có thể tạo ra một tình yêu bền vững. Việc cùng nhau lập kế hoạch hoặc tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 ưu tiên ổn định, số 1 ưu tiên đổi mới. Số 4 cần linh hoạt hơn, còn số 1 cần tôn trọng sự thận trọng của số 4. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như lập kế hoạch tài chính hoặc du lịch có tổ chức. Số 4 nên cởi mở hơn với ý tưởng mới, còn số 1 cần kiên nhẫn hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 1 (Nhà lãnh đạo) là sự kết hợp giữa sự thực tế và định hướng, tạo nên một gia đình ổn định nhưng cần sự cân bằng. Số 4 mang lại sự đáng tin cậy và tổ chức, trong khi số 1 cung cấp tầm nhìn và sự quyết đoán. Sự tương phản này có thể bền vững, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 mang lại sự ổn định và cấu trúc, trong khi số 1 đảm bảo gia đình có mục tiêu rõ ràng. Họ bổ sung cho nhau, với số 4 cung cấp nền tảng và số 1 khuyến khích đổi mới. Khả năng xây dựng một gia đình an toàn là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 1 quá kiểm soát, trong khi số 1 có thể thấy số 4 quá cứng nhắc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. tham vọng) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa kỷ luật và lãnh đạo có thể tạo ra một cuộc sống gia đình thành công. Việc cùng nhau xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận trách nhiệm: số 4 tập trung vào ổn định, số 1 tập trung vào mục tiêu. Số 4 cần linh hoạt hơn, còn số 1 cần kiên nhẫn hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như quản lý tài chính hoặc xây dựng dự án chung. Số 4 nên cởi mở hơn với sự đổi mới, còn số 1 cần tôn trọng sự thận trọng của số 4. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 1 (Nhà lãnh đạo) có thể tạo ra kết quả ấn tượng nhờ sự kết hợp giữa kỷ luật và chiến lược. Số 4 mang lại sự thực tế và khả năng thực hiện, trong khi số 1 cung cấp tầm nhìn và sự quyết đoán. Sự tương tác này tạo nên một đội nhóm mạnh mẽ, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 đảm bảo mọi thứ được thực hiện đúng kế hoạch, trong khi số 1 dẫn dắt dự án với tầm nhìn lớn. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 1 mang lại sự đổi mới. Khả năng phối hợp tạo ra những dự án vững chắc.",
        "weaknesses": "Số 4 có thể thấy số 1 quá vội vàng, trong khi số 1 có thể cảm thấy số 4 quá chậm chạp. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (thận trọng vs. quyết đoán) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án kinh doanh hoặc tổ chức. Sự kết hợp giữa thực tế và lãnh đạo có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 thận trọng, số 1 quyết đoán. Số 4 cần cởi mở hơn với sự đổi mới, còn số 1 cần kiên nhẫn hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 4 tập trung vào thực hiện và số 1 tập trung vào chiến lược. Số 4 nên cởi mở hơn với ý tưởng mới, còn số 1 cần tôn trọng sự thận trọng của số 4. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 2 (Nhà ngoại giao) là sự kết hợp giữa sự thực tế và nhạy cảm. Số 4 mang lại sự ổn định và kỷ luật, trong khi số 2 cung cấp sự thấu hiểu và hỗ trợ. Sự tương tác này tạo ra một tình yêu sâu sắc và bền vững, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 4 cung cấp nền tảng vững chắc, trong khi số 2 mang lại sự quan tâm và khả năng hòa giải. Họ bổ sung cho nhau, với số 4 giúp số 2 cảm thấy an toàn và số 2 làm dịu sự cứng nhắc của số 4. Khả năng thấu hiểu tạo nên một mối quan hệ mạnh mẽ.",
        "weaknesses": "Số 4 có thể cảm thấy số 2 quá phụ thuộc, trong khi số 2 có thể thấy số 4 quá cứng nhắc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (ổn định vs. cảm xúc) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách cân bằng kỷ luật và cảm xúc. Sự kết hợp giữa thực tế và hỗ trợ có thể tạo ra một tình yêu phong phú. Việc cùng nhau tham gia các hoạt động thực tế hoặc chăm sóc lẫn nhau sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 ưu tiên ổn định, số 2 ưu tiên cảm xúc. Số 4 cần linh hoạt hơn, còn số 2 cần tự tin hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như làm việc nhà chung hoặc lập kế hoạch tài chính. Số 4 nên cởi mở hơn với cảm xúc, còn số 2 cần bày tỏ nhu cầu rõ ràng. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 2 (Nhà ngoại giao) là sự kết hợp giữa sự thực tế và chăm sóc, tạo nên một gia đình ấm áp và ổn định. Số 4 mang lại sự đáng tin cậy và tổ chức, trong khi số 2 cung cấp sự chu đáo và thấu hiểu. Sự tương tác này rất hài hòa, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 mang lại sự ổn định và cấu trúc, trong khi số 2 cung cấp sự quan tâm và khả năng hòa giải. Họ bổ sung cho nhau, với số 4 tạo nền tảng an toàn và số 2 làm dịu sự cứng nhắc của số 4. Khả năng phối hợp tạo nên một gia đình hạnh phúc.",
        "weaknesses": "Số 4 có thể cảm thấy số 2 quá phụ thuộc, trong khi số 2 có thể thấy số 4 thiếu tình cảm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. cảm xúc) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ mẫu mực nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa thực tế và chăm sóc có thể tạo ra một cuộc sống gia đình ý nghĩa. Việc cùng nhau xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 tập trung vào trách nhiệm, số 2 tập trung vào cảm xúc. Số 4 cần thể hiện tình cảm nhiều hơn, còn số 2 cần tự tin hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như làm việc nhà chung hoặc tham gia từ thiện. Số 4 nên thể hiện tình cảm nhiều hơn, còn số 2 cần bày tỏ nhu cầu rõ ràng. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 2 (Nhà ngoại giao) có thể tạo ra kết quả xuất sắc nhờ sự kết hợp giữa thực tế và ngoại giao. Số 4 mang lại sự kỷ luật và khả năng thực hiện, trong khi số 2 cung cấp sự tinh tế và kỹ năng xây dựng mối quan hệ. Sự tương tác này tạo nên một đội nhóm mạnh mẽ, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 đảm bảo mọi thứ được thực hiện đúng kế hoạch, trong khi số 2 xây dựng quan hệ và giải quyết xung đột. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 2 mang lại sự linh hoạt. Khả năng phối hợp tạo ra những dự án vững chắc.",
        "weaknesses": "Số 4 có thể thấy số 2 quá chậm chạp, trong khi số 2 có thể cảm thấy số 4 quá cứng nhắc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (kỷ luật vs. linh hoạt) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án tổ chức hoặc kinh doanh. Sự kết hợp giữa thực tế và ngoại giao có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật, số 2 linh hoạt. Số 4 cần cởi mở hơn với ý kiến của số 2, còn số 2 cần quyết đoán hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 4 tập trung vào thực hiện và số 2 tập trung vào quan hệ đối ngoại. Số 4 nên cởi mở hơn với ý kiến, còn số 2 cần quyết đoán hơn. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 60,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 3 (Nhà sáng tạo) có thể ổn định nhưng thiếu sự lãng mạn do sự khác biệt trong cách tiếp cận. Số 4 mang lại sự thực tế và ổn định, trong khi số 3 cung cấp sự lạc quan và sáng tạo. Sự tương phản này có thể hỗ trợ lẫn nhau, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 4 cung cấp nền tảng vững chắc, trong khi số 3 mang lại niềm vui và sự sáng tạo. Họ có thể bổ sung cho nhau, với số 4 giúp số 3 tổ chức hơn và số 3 làm dịu sự cứng nhắc của số 4. Khả năng xây dựng một mối quan hệ an toàn là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 3 quá bốc đồng hoặc thiếu trách nhiệm, trong khi số 3 có thể thấy số 4 quá cứng nhắc hoặc thiếu thú vị. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (ổn định vs. niềm vui) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa thực tế và sáng tạo có thể tạo ra một tình yêu bền vững. Việc cùng nhau tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 ưu tiên ổn định, số 3 ưu tiên niềm vui. Số 4 cần linh hoạt hơn, còn số 3 cần nghiêm túc hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động thực tế như lập kế hoạch tài chính hoặc làm việc nhà chung. Số 4 nên cởi mở hơn với sự sáng tạo, còn số 3 cần bày tỏ nhu cầu rõ ràng. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 3 (Nhà sáng tạo) có thể gặp thử thách do sự khác biệt trong ưu tiên. Số 4 mang lại sự thực tế và tổ chức, trong khi số 3 cung cấp niềm vui và sự sáng tạo. Sự tương phản này có thể ổn định, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 mang lại sự ổn định và cấu trúc, trong khi số 3 mang lại không khí vui vẻ và sáng tạo. Họ có thể bổ sung cho nhau, với số 4 giúp số 3 tổ chức hơn và số 3 làm dịu sự nghiêm túc của số 4. Khả năng xây dựng một gia đình an toàn là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 3 thiếu trách nhiệm, trong khi số 3 có thể thấy số 4 quá cứng nhắc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. niềm vui) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa thực tế và sáng tạo có thể tạo ra một cuộc sống gia đình ổn định. Việc cùng nhau tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 tập trung vào trách nhiệm, số 3 tập trung vào niềm vui. Số 4 cần linh hoạt hơn, còn số 3 cần chia sẻ trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình thực tế như quản lý tài chính hoặc xây dựng dự án chung. Số 4 nên cởi mở hơn với sự sáng tạo, còn số 3 cần nỗ lực chia sẻ trách nhiệm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 3 (Nhà sáng tạo) có thể hiệu quả nếu tận dụng thế mạnh của nhau. Số 4 mang lại sự thực tế và kỷ luật, trong khi số 3 cung cấp ý tưởng mới và năng lượng lạc quan. Sự tương phản này tạo nên một đội nhóm cân bằng, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 đảm bảo mọi thứ được thực hiện đúng kế hoạch, trong khi số 3 sáng tạo ý tưởng và thu hút sự chú ý. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 3 mang lại năng lượng. Khả năng phối hợp tạo ra những dự án vững chắc.",
        "weaknesses": "Số 4 có thể thấy số 3 thiếu kỷ luật, trong khi số 3 có thể cảm thấy số 4 quá cứng nhắc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (kỷ luật vs. tự do) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án dài hạn. Sự kết hợp giữa thực tế và sáng tạo có thể dẫn đến thành công trong kinh doanh hoặc tổ chức. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật, số 3 bốc đồng. Số 4 cần cởi mở hơn với sự đổi mới, còn số 3 cần tuân thủ kế hoạch. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 4 tập trung vào thực hiện và số 3 tập trung vào sáng tạo. Số 4 nên cởi mở hơn với ý tưởng mới, còn số 3 cần tuân thủ kế hoạch. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 90,
      "details": {
        "overview": "9/10\nMối quan hệ giữa hai số 4 (Nhà xây dựng) là sự kết hợp lý tưởng của sự thực tế và kỷ luật. Cả hai đều chăm chỉ, đáng tin cậy và thích xây dựng nền tảng vững chắc, tạo nên một tình yêu ổn định và an toàn. Sự tương đồng này mang lại sự thoải mái, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Cả hai đều có khả năng xây dựng một mối quan hệ bền vững, với sự tôn trọng lẫn nhau về kỷ luật và trách nhiệm. Họ hỗ trợ nhau trong việc lập kế hoạch và thực hiện mục tiêu chung. Sự tương đồng trong cách tiếp cận giúp họ dễ dàng đồng điệu.",
        "weaknesses": "Cả hai có thể quá cứng nhắc hoặc thiếu linh hoạt, dẫn đến sự nhàm chán hoặc thiếu lãng mạn. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự thiếu sáng tạo của cả hai có thể khiến mối quan hệ thiếu màu sắc.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu mẫu mực nếu cả hai học cách thêm sự linh hoạt. Sự kết hợp của hai nhà xây dựng tạo ra một mối quan hệ bền vững. Việc cùng nhau tham gia các hoạt động sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức lớn nhất là sự thiếu linh hoạt và xu hướng tập trung vào trách nhiệm hơn cảm xúc. Cả hai cần học cách thư giãn và thêm sự lãng mạn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động sáng tạo như du lịch hoặc làm việc chung trong các dự án mới. Họ cần thêm sự lãng mạn và linh hoạt vào mối quan hệ. Duy trì giao tiếp cởi mở và khuyến khích sự đổi mới sẽ giúp mối quan hệ bền vững."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nHôn nhân giữa hai số 4 (Nhà xây dựng) là sự kết hợp của sự thực tế và kỷ luật, tạo nên một gia đình ổn định và an toàn. Cả hai đều chăm chỉ, có tổ chức và thích xây dựng nền tảng vững chắc, giúp họ phối hợp tốt trong các trách nhiệm gia đình. Sự tương đồng này rất bền vững, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Cả hai đều giỏi xây dựng một gia đình an toàn, với sự tôn trọng lẫn nhau về kỷ luật và trách nhiệm. Họ hỗ trợ nhau trong việc quản lý tài chính và thực hiện mục tiêu chung. Sự tương đồng trong cách tiếp cận giúp họ phối hợp tốt.",
        "weaknesses": "Cả hai có thể thiếu linh hoạt hoặc quá tập trung vào trách nhiệm, dẫn đến sự nhàm chán. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự thiếu sáng tạo của cả hai có thể khiến gia đình thiếu niềm vui.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ mẫu mực nếu cả hai học cách thêm sự linh hoạt. Sự kết hợp của hai nhà xây dựng tạo ra một cuộc sống gia đình bền vững. Việc cùng nhau tham gia các hoạt động sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự thiếu linh hoạt và xu hướng tập trung vào trách nhiệm hơn niềm vui. Cả hai cần học cách thư giãn và thêm sự sáng tạo. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như du lịch hoặc làm việc chung trong các dự án sáng tạo. Họ cần thêm niềm vui và linh hoạt vào cuộc sống gia đình. Duy trì giao tiếp cởi mở và khuyến khích sự đổi mới sẽ giúp gia đình bền vững."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nSự hợp tác giữa hai số 4 (Nhà xây dựng) có thể tạo ra kết quả ấn tượng nhờ sự kết hợp của kỷ luật và thực tế. Cả hai đều chăm chỉ, có tổ chức và giỏi thực hiện, tạo nên một đội nhóm mạnh mẽ và đáng tin cậy. Tuy nhiên, thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Cả hai đều có khả năng thực hiện kế hoạch một cách hiệu quả, với sự tôn trọng lẫn nhau về kỷ luật và trách nhiệm. Họ phối hợp tốt trong việc quản lý dự án và đạt mục tiêu. Sự tương đồng trong cách tiếp cận tạo ra một môi trường làm việc ổn định.",
        "weaknesses": "Cả hai có thể thiếu sáng tạo hoặc quá cứng nhắc, dẫn đến việc bỏ lỡ cơ hội đổi mới. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự thiếu linh hoạt của cả hai có thể khiến dự án thiếu đột phá.",
        "potential": "Sự hợp tác này có tiềm năng tạo ra kết quả xuất sắc trong các dự án tổ chức hoặc kinh doanh. Sự kết hợp của hai nhà xây dựng có thể dẫn đến những dự án bền vững. Việc tìm kiếm sự hỗ trợ từ bên ngoài sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự thiếu sáng tạo và xu hướng tập trung vào thực tế hơn đổi mới. Cả hai cần học cách cởi mở với ý tưởng mới. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên tìm kiếm sự hỗ trợ từ một người sáng tạo để bổ sung ý tưởng mới. Tham gia các buổi họp định kỳ để duy trì đồng thuận. Cả hai cần học cách cởi mở với đổi mới và duy trì giao tiếp cởi mở để đảm bảo thành công."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 5 (Nhà phiêu lưu) có thể gặp thử thách do sự khác biệt trong cách tiếp cận. Số 4 mang lại sự thực tế và ổn định, trong khi số 5 cung cấp sự linh hoạt và tinh thần phiêu lưu. Sự tương phản này có thể hấp dẫn ban đầu, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 4 cung cấp nền tảng vững chắc, trong khi số 5 mang lại năng lượng và sự mới mẻ. Họ có thể bổ sung cho nhau, với số 4 giúp số 5 ổn định hơn và số 5 khuyến khích số 4 thư giãn. Khả năng tạo ra một mối quan hệ năng động là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 5 quá bốc đồng hoặc thiếu cam kết, trong khi số 5 có thể thấy số 4 quá cứng nhắc hoặc nhàm chán. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (ổn định vs. tự do) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa thực tế và phiêu lưu có thể tạo ra một tình yêu phong phú. Việc cùng nhau tham gia các hoạt động mới mẻ sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 ưu tiên ổn định, số 5 ưu tiên tự do. Số 4 cần linh hoạt hơn, còn số 5 cần cam kết hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động phiêu lưu như du lịch hoặc thử thách mới. Số 4 nên cởi mở hơn với sự thay đổi, còn số 5 cần học cách cam kết. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 50,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 5 (Nhà phiêu lưu) có thể gặp nhiều thử thách do sự khác biệt trong ưu tiên. Số 4 mang lại sự thực tế và tổ chức, trong khi số 5 cung cấp sự linh hoạt và tinh thần khám phá. Sự tương phản này có thể thú vị, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 mang lại sự ổn định và cấu trúc, trong khi số 5 mang lại năng lượng và sự mới mẻ. Họ có thể bổ sung cho nhau, với số 4 giúp số 5 ổn định hơn và số 5 khuyến khích số 4 thư giãn. Khả năng tạo ra một gia đình năng động là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 5 thiếu trách nhiệm, trong khi số 5 có thể thấy số 4 quá cứng nhắc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. tự do) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa thực tế và phiêu lưu có thể tạo ra một cuộc sống gia đình phong phú. Việc cùng nhau tham gia các hoạt động mới sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách sống: số 4 hướng tới ổn định, số 5 hướng tới tự do. Số 4 cần linh hoạt hơn, còn số 5 cần cam kết hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như du lịch hoặc thử thách mới. Số 4 nên cởi mở hơn với sự thay đổi, còn số 5 cần nỗ lực cam kết. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 5 (Nhà phiêu lưu) có thể hiệu quả trong các dự án cần sự cân bằng giữa thực tế và đổi mới. Số 4 mang lại sự kỷ luật và khả năng thực hiện, trong khi số 5 cung cấp sự linh hoạt và tinh thần khám phá. Sự tương phản này tạo nên một đội nhóm năng động, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 đảm bảo mọi thứ được thực hiện đúng kế hoạch, trong khi số 5 mang lại ý tưởng mới và khả năng thích ứng. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 5 mang lại sự đổi mới. Khả năng phối hợp tạo ra những dự án thú vị.",
        "weaknesses": "Số 4 có thể thấy số 5 thiếu kỷ luật, trong khi số 5 có thể cảm thấy số 4 quá cứng nhắc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (kỷ luật vs. tự do) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án thay đổi nhanh. Sự kết hợp giữa thực tế và phiêu lưu có thể dẫn đến thành công. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật, số 5 bốc đồng. Số 4 cần cởi mở hơn với sự đổi mới, còn số 5 cần tuân thủ kế hoạch. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 4 tập trung vào thực hiện và số 5 tập trung vào đổi mới. Số 4 nên cởi mở hơn với ý tưởng mới, còn số 5 cần tuân thủ kế hoạch. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 6 (Nhà chăm sóc) là sự kết hợp giữa sự thực tế và yêu thương. Số 4 mang lại sự ổn định và kỷ luật, trong khi số 6 cung cấp sự chu đáo và khả năng chăm sóc. Sự tương tác này tạo ra một tình yêu sâu sắc, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 4 cung cấp nền tảng vững chắc, trong khi số 6 mang lại sự quan tâm và ấm áp. Họ bổ sung cho nhau, với số 4 giúp số 6 ổn định hơn và số 6 làm dịu sự cứng nhắc của số 4. Khả năng thấu hiểu và hỗ trợ lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 4 có thể cảm thấy số 6 quá kiểm soát, trong khi số 6 có thể thấy số 4 thiếu tình cảm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (ổn định vs. chăm sóc) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách cân bằng kỷ luật và cảm xúc. Sự kết hợp giữa thực tế và chăm sóc có thể tạo ra một tình yêu phong phú. Việc cùng nhau tham gia các hoạt động ý nghĩa sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 ưu tiên ổn định, số 6 ưu tiên chăm sóc. Số 4 cần thể hiện tình cảm nhiều hơn, còn số 6 cần tôn trọng sự độc lập của số 4. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như từ thiện hoặc làm việc nhà chung. Số 4 nên thể hiện tình cảm nhiều hơn, còn số 6 cần tôn trọng sự độc lập của số 4. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 6 (Nhà chăm sóc) là sự kết hợp giữa sự thực tế và trách nhiệm, tạo nên một gia đình ấm áp và ổn định. Số 4 mang lại sự đáng tin cậy và tổ chức, trong khi số 6 cung cấp sự chu đáo và khả năng xây dựng mái ấm. Sự tương tác này rất hài hòa, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 mang lại sự ổn định và cấu trúc, trong khi số 6 cung cấp sự quan tâm và ấm áp. Họ bổ sung cho nhau, với số 4 tạo nền tảng an toàn và số 6 làm dịu sự cứng nhắc của số 4. Khả năng phối hợp tạo nên một gia đình hạnh phúc.",
        "weaknesses": "Số 4 có thể cảm thấy số 6 quá kiểm soát, trong khi số 6 có thể thấy số 4 thiếu tình cảm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. chăm sóc) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ mẫu mực nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa thực tế và chăm sóc có thể tạo ra một cuộc sống gia đình ý nghĩa. Việc cùng nhau tham gia các hoạt động ý nghĩa sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 tập trung vào trách nhiệm, số 6 tập trung vào chăm sóc. Số 4 cần thể hiện tình cảm nhiều hơn, còn số 6 cần tôn trọng sự độc lập của số 4. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như từ thiện hoặc làm việc nhà chung. Số 4 nên thể hiện tình cảm nhiều hơn, còn số 6 cần tôn trọng sự độc lập của số 4. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 6 (Nhà chăm sóc) có thể hiệu quả trong các dự án cần sự thực tế và trách nhiệm. Số 4 mang lại sự kỷ luật và khả năng thực hiện, trong khi số 6 cung cấp sự chu đáo và khả năng quản lý. Sự tương tác này tạo nên một đội nhóm hài hòa, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 đảm bảo mọi thứ được thực hiện đúng kế hoạch, trong khi số 6 mang lại sự tinh tế và khả năng xây dựng mối quan hệ. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 6 mang lại sự chăm sóc. Khả năng phối hợp tạo ra những dự án có ý nghĩa.",
        "weaknesses": "Số 4 có thể thấy số 6 quá kiểm soát, trong khi số 6 có thể cảm thấy số 4 thiếu linh hoạt. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (kỷ luật vs. chăm sóc) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án cộng đồng hoặc tổ chức. Sự kết hợp giữa thực tế và chăm sóc có thể dẫn đến thành công. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật, số 6 chăm sóc. Số 4 cần cởi mở hơn với ý kiến của số 6, còn số 6 cần quyết đoán hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 4 tập trung vào thực hiện và số 6 tập trung vào quan hệ đối ngoại. Số 4 nên cởi mở hơn với ý kiến, còn số 6 cần quyết đoán hơn. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 7 (Nhà hiền triết) có thể ổn định nhưng thiếu sự lãng mạn do sự khác biệt trong cách tiếp cận. Số 4 mang lại sự thực tế và ổn định, trong khi số 7 nội tâm, sâu sắc và ưu tiên sự khám phá tinh thần. Sự tương phản này có thể hấp dẫn, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 4 cung cấp nền tảng vững chắc, trong khi số 7 mang lại sự sâu sắc và tư duy triết học. Họ có thể học hỏi lẫn nhau, với số 4 giúp số 7 ổn định hơn và số 7 khuyến khích số 4 suy ngẫm sâu hơn. Khả năng tạo ra một mối quan hệ độc đáo là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 7 quá xa cách, trong khi số 7 có thể thấy số 4 quá cứng nhắc hoặc thiếu chiều sâu. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (ổn định vs. tinh thần) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa thực tế và hiền triết có thể tạo ra một tình yêu sâu sắc. Việc cùng nhau tham gia các hoạt động tinh thần sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 ưu tiên ổn định, số 7 ưu tiên suy ngẫm. Số 4 cần linh hoạt hơn, còn số 7 cần cởi mở hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động tinh thần như thiền hoặc đọc sách cùng nhau. Số 4 nên cởi mở hơn với sự suy ngẫm, còn số 7 cần học cách cởi mở hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 7 (Nhà hiền triết) có thể gặp thử thách do sự khác biệt trong ưu tiên. Số 4 mang lại sự thực tế và tổ chức, trong khi số 7 nội tâm và tập trung vào sự khám phá tinh thần. Sự tương phản này có thể tạo ra một gia đình độc đáo, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 mang lại sự ổn định và cấu trúc, trong khi số 7 mang lại sự sâu sắc và tư duy triết học. Họ có thể bổ sung cho nhau, với số 4 giúp số 7 ổn định hơn và số 7 khuyến khích số 4 suy ngẫm sâu hơn. Khả năng tạo ra một gia đình độc đáo là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 7 quá xa cách, trong khi số 7 có thể thấy số 4 thiếu chiều sâu. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. tinh thần) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa thực tế và hiền triết có thể tạo ra một cuộc sống gia đình phong phú. Việc cùng nhau tham gia các hoạt động tinh thần sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách sống: số 4 hướng tới ổn định, số 7 hướng tới suy ngẫm. Số 4 cần linh hoạt hơn, còn số 7 cần cởi mở hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động tinh thần như thiền hoặc đọc sách cùng nhau. Số 4 nên cởi mở hơn với sự suy ngẫm, còn số 7 cần nỗ lực cởi mở hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 7 (Nhà hiền triết) có thể hiệu quả trong các dự án cần sự thực tế và chiều sâu. Số 4 mang lại sự kỷ luật và khả năng thực hiện, trong khi số 7 cung cấp sự phân tích và tư duy triết học. Sự tương phản này có thể tạo ra một đội nhóm độc đáo, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 đảm bảo mọi thứ được thực hiện đúng kế hoạch, trong khi số 7 mang lại sự sâu sắc và khả năng phân tích. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 7 mang lại chiều sâu. Khả năng phối hợp tạo ra những dự án có ý nghĩa.",
        "weaknesses": "Số 4 có thể thấy số 7 quá xa cách, trong khi số 7 có thể cảm thấy số 4 thiếu chiều sâu. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (kỷ luật vs. suy ngẫm) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án đòi hỏi tư duy sâu sắc. Sự kết hợp giữa thực tế và triết học có thể dẫn đến những dự án độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật, số 7 suy ngẫm. Số 4 cần cởi mở hơn với ý kiến của số 7, còn số 7 cần hành động nhanh hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 4 tập trung vào thực hiện và số 7 tập trung vào phân tích. Số 4 nên cởi mở hơn với ý kiến, còn số 7 cần hành động nhanh hơn. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp để đảm bảo đồng thuận."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 8 (Nhà quyền lực) là sự kết hợp giữa sự thực tế và tham vọng. Số 4 mang lại sự ổn định và kỷ luật, trong khi số 8 cung cấp sự quyết đoán và khát vọng thành công. Sự tương đồng về tính thực tế tạo ra một tình yêu mạnh mẽ, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 4 cung cấp nền tảng vững chắc, trong khi số 8 mang lại động lực và tầm nhìn lớn. Họ bổ sung cho nhau, với số 4 giúp số 8 tổ chức tốt hơn và số 8 khuyến khích số 4 đạt mục tiêu lớn hơn. Khả năng xây dựng một mối quan hệ thành công là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 8 quá kiểm soát, trong khi số 8 có thể thấy số 4 quá chậm chạp. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (ổn định vs. thành công) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách cân bằng kỷ luật và tham vọng. Sự kết hợp giữa thực tế và quyền lực có thể tạo ra một tình yêu bền vững. Việc cùng nhau lập kế hoạch tài chính hoặc tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 ưu tiên ổn định, số 8 ưu tiên thành công. Số 4 cần linh hoạt hơn, còn số 8 cần kiên nhẫn hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như lập kế hoạch tài chính hoặc xây dựng dự án chung. Số 4 nên cởi mở hơn với tham vọng, còn số 8 cần tôn trọng sự thận trọng của số 4. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 8 (Nhà quyền lực) là sự kết hợp giữa sự thực tế và tham vọng, tạo nên một gia đình ổn định và thành công. Số 4 mang lại sự đáng tin cậy và tổ chức, trong khi số 8 cung cấp sự quyết đoán và tầm nhìn lớn. Sự tương đồng về tính thực tế rất bền vững, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 mang lại sự ổn định và cấu trúc, trong khi số 8 đảm bảo gia đình có mục tiêu lớn. Họ bổ sung cho nhau, với số 4 tạo nền tảng an toàn và số 8 khuyến khích số 4 đạt mục tiêu lớn hơn. Khả năng phối hợp tạo nên một gia đình thành công.",
        "weaknesses": "Số 4 có thể cảm thấy số 8 quá kiểm soát, trong khi số 8 có thể thấy số 4 thiếu tham vọng. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. thành công) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ mẫu mực nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa thực tế và quyền lực có thể tạo ra một cuộc sống gia đình thành công. Việc cùng nhau xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 tập trung vào trách nhiệm, số 8 tập trung vào thành công. Số 4 cần linh hoạt hơn, còn số 8 cần kiên nhẫn hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như quản lý tài chính hoặc xây dựng dự án chung. Số 4 nên cởi mở hơn với tham vọng, còn số 8 cần tôn trọng sự thận trọng của số 4. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 8 (Nhà quyền lực) có thể tạo ra kết quả ấn tượng nhờ sự kết hợp giữa kỷ luật và tham vọng. Số 4 mang lại sự thực tế và khả năng thực hiện, trong khi số 8 cung cấp sự quyết đoán và tầm nhìn lớn. Sự tương đồng này tạo nên một đội nhóm mạnh mẽ, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 đảm bảo mọi thứ được thực hiện đúng kế hoạch, trong khi số 8 dẫn dắt dự án với tầm nhìn chiến lược. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 8 mang lại động lực. Khả năng phối hợp tạo ra những dự án thành công.",
        "weaknesses": "Số 4 có thể thấy số 8 quá kiểm soát, trong khi số 8 có thể cảm thấy số 4 quá chậm chạp. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (kỷ luật vs. quyết đoán) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án kinh doanh hoặc tổ chức. Sự kết hợp giữa thực tế và quyền lực có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 thận trọng, số 8 quyết đoán. Số 4 cần cởi mở hơn với tham vọng, còn số 8 cần kiên nhẫn hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 4 tập trung vào thực hiện và số 8 tập trung vào chiến lược. Số 4 nên cởi mở hơn với tham vọng, còn số 8 cần tôn trọng sự thận trọng của số 4. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 60,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 9 (Nhà nhân đạo) có thể gặp thử thách do sự khác biệt trong cách tiếp cận. Số 4 mang lại sự thực tế và ổn định, trong khi số 9 cung cấp lòng trắc ẩn và khát vọng thay đổi thế giới. Sự tương phản này có thể hấp dẫn, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 4 cung cấp nền tảng vững chắc, trong khi số 9 mang lại sự đam mê và lý tưởng cao cả. Họ có thể bổ sung cho nhau, với số 4 giúp số 9 thực tế hơn và số 9 truyền cảm hứng cho số 4. Khả năng tạo ra một mối quan hệ ý nghĩa là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 9 quá lý tưởng hoặc xa cách, trong khi số 9 có thể thấy số 4 quá cứng nhắc hoặc thiếu đam mê. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (ổn định vs. lý tưởng) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa thực tế và nhân đạo có thể tạo ra một tình yêu phong phú. Việc cùng nhau tham gia các hoạt động từ thiện sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 ưu tiên ổn định, số 9 ưu tiên lý tưởng. Số 4 cần linh hoạt hơn, còn số 9 cần thực tế hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động từ thiện hoặc làm việc chung vì cộng đồng. Số 4 nên cởi mở hơn với lý tưởng, còn số 9 cần học cách thực tế hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 9 (Nhà nhân đạo) có thể gặp nhiều thử thách do sự khác biệt trong ưu tiên. Số 4 mang lại sự thực tế và tổ chức, trong khi số 9 cung cấp lòng trắc ẩn và khát vọng cống hiến. Sự tương phản này có thể thú vị, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 mang lại sự ổn định và cấu trúc, trong khi số 9 mang lại sự đam mê và lý tưởng cao cả. Họ có thể bổ sung cho nhau, với số 4 giúp số 9 thực tế hơn và số 9 truyền cảm hứng cho số 4. Khả năng tạo ra một gia đình ý nghĩa là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 9 quá xa cách hoặc thiếu thực tế, trong khi số 9 có thể thấy số 4 thiếu đam mê. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. lý tưởng) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa thực tế và nhân đạo có thể tạo ra một cuộc sống gia đình phong phú. Việc cùng nhau tham gia các hoạt động từ thiện sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách sống: số 4 hướng tới ổn định, số 9 hướng tới lý tưởng. Số 4 cần linh hoạt hơn, còn số 9 cần chú ý hơn đến gia đình. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như từ thiện hoặc làm việc chung vì cộng đồng. Số 4 nên cởi mở hơn với lý tưởng, còn số 9 cần nỗ lực thực tế hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 9 (Nhà nhân đạo) có thể hiệu quả trong các dự án cộng đồng nếu tận dụng thế mạnh của nhau. Số 4 mang lại sự thực tế và khả năng thực hiện, trong khi số 9 cung cấp lòng trắc ẩn và tầm nhìn lớn. Sự tương phản này có thể tạo ra một đội nhóm ý nghĩa, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 đảm bảo mọi thứ được thực hiện đúng kế hoạch, trong khi số 9 mang lại ý tưởng cao cả và sự đam mê. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 9 mang lại cảm hứng. Khả năng phối hợp tạo ra những dự án có tác động lớn.",
        "weaknesses": "Số 4 có thể thấy số 9 thiếu thực tế, trong khi số 9 có thể cảm thấy số 4 thiếu đam mê. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (kỷ luật vs. lý tưởng) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án từ thiện hoặc cộng đồng. Sự kết hợp giữa thực tế và nhân đạo có thể dẫn đến thành công. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật, số 9 lý tưởng. Số 4 cần cởi mở hơn với ý tưởng của số 9, còn số 9 cần thực tế hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 4 tập trung vào thực hiện và số 9 tập trung vào ý tưởng lớn. Số 4 nên cởi mở hơn với lý tưởng, còn số 9 cần tuân thủ kế hoạch. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp để đảm bảo đồng thuận."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 11 (Nhà truyền cảm hứng) có thể gặp thử thách do sự khác biệt trong cách tiếp cận. Số 4 mang lại sự thực tế và ổn định, trong khi số 11 cung cấp sự sáng tạo, trực giác và năng lượng tâm linh. Sự tương phản này có thể hấp dẫn ban đầu, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 4 cung cấp nền tảng vững chắc, trong khi số 11 mang lại sự sáng tạo và cảm hứng. Họ có thể bổ sung cho nhau, với số 4 giúp số 11 thực tế hơn và số 11 khuyến khích số 4 suy ngẫm sâu hơn. Khả năng tạo ra một mối quan hệ độc đáo là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 11 quá xa cách hoặc không thực tế, trong khi số 11 có thể thấy số 4 quá cứng nhắc hoặc thiếu chiều sâu. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (ổn định vs. tâm linh) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa thực tế và truyền cảm hứng có thể tạo ra một tình yêu phong phú. Việc cùng nhau tham gia các hoạt động tâm linh sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 ưu tiên ổn định, số 11 ưu tiên tâm linh. Số 4 cần linh hoạt hơn, còn số 11 cần thực tế hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như thiền, yoga hoặc sáng tạo nghệ thuật. Số 4 nên cởi mở hơn với sự tâm linh, còn số 11 cần học cách thực tế hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 50,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 11 (Nhà truyền cảm hứng) có thể gặp nhiều thử thách do sự khác biệt trong ưu tiên. Số 4 mang lại sự thực tế và tổ chức, trong khi số 11 cung cấp sự sáng tạo và năng lượng tâm linh. Sự tương phản này có thể thú vị, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 mang lại sự ổn định và cấu trúc, trong khi số 11 mang lại sự sáng tạo và cảm hứng. Họ có thể bổ sung cho nhau, với số 4 giúp số 11 thực tế hơn và số 11 khuyến khích số 4 suy ngẫm sâu hơn. Khả năng tạo ra một gia đình độc đáo là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 11 quá xa cách hoặc không thực tế, trong khi số 11 có thể thấy số 4 thiếu chiều sâu. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. tâm linh) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa thực tế và truyền cảm hứng có thể tạo ra một cuộc sống gia đình phong phú. Việc cùng nhau tham gia các hoạt động tâm linh sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách sống: số 4 hướng tới ổn định, số 11 hướng tới tâm linh. Số 4 cần linh hoạt hơn, còn số 11 cần chú ý hơn đến gia đình. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như thiền hoặc sáng tạo nghệ thuật. Số 4 nên cởi mở hơn với sự tâm linh, còn số 11 cần nỗ lực thực tế hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 11 (Nhà truyền cảm hứng) có thể hiệu quả trong các dự án cần sự cân bằng giữa thực tế và sáng tạo. Số 4 mang lại sự kỷ luật và khả năng thực hiện, trong khi số 11 cung cấp sự sáng tạo và trực giác. Sự tương phản này có thể tạo ra một đội nhóm độc đáo, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 đảm bảo mọi thứ được thực hiện đúng kế hoạch, trong khi số 11 mang lại ý tưởng tâm linh và cảm hứng. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 11 mang lại chiều sâu. Khả năng phối hợp tạo ra những dự án độc đáo.",
        "weaknesses": "Số 4 có thể thấy số 11 thiếu thực tế, trong khi số 11 có thể cảm thấy số 4 thiếu chiều sâu. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (kỷ luật vs. trực giác) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án sáng tạo hoặc tâm linh. Sự kết hợp giữa thực tế và truyền cảm hứng có thể dẫn đến những dự án có tác động lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật, số 11 trực giác. Số 4 cần cởi mở hơn với ý tưởng của số 11, còn số 11 cần thực tế hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 4 tập trung vào thực hiện và số 11 tập trung vào ý tưởng tâm linh. Số 4 nên cởi mở hơn với ý tưởng, còn số 11 cần tuân thủ kế hoạch. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp để đảm bảo đồng thuận."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 22 (Nhà kiến tạo bậc thầy) là sự kết hợp giữa sự thực tế và tầm nhìn lớn. Số 4 mang lại sự ổn định và kỷ luật, trong khi số 22 cung cấp khả năng thực hiện các dự án lớn và tư duy chiến lược. Sự tương đồng về tính thực tế tạo ra một tình yêu mạnh mẽ, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 4 cung cấp nền tảng vững chắc, trong khi số 22 mang lại động lực và tầm nhìn dài hạn. Họ bổ sung cho nhau, với số 4 giúp số 22 tổ chức tốt hơn và số 22 khuyến khích số 4 đạt mục tiêu lớn hơn. Khả năng xây dựng một mối quan hệ thành công là điểm mạnh.",
        "weaknesses": "Số 4 có thể cảm thấy số 22 quá kiểm soát hoặc xa cách, trong khi số 22 có thể thấy số 4 thiếu tham vọng. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (ổn định vs. mục tiêu lớn) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách cân bằng kỷ luật và tham vọng. Sự kết hợp giữa thực tế và kiến tạo có thể tạo ra một tình yêu bền vững. Việc cùng nhau lập kế hoạch hoặc tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 ưu tiên ổn định, số 22 ưu tiên mục tiêu lớn. Số 4 cần linh hoạt hơn, còn số 22 cần kiên nhẫn hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như lập kế hoạch tài chính hoặc xây dựng dự án chung. Số 4 nên cởi mở hơn với tham vọng, còn số 22 cần tôn trọng sự thận trọng của số 4. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 22 (Nhà kiến tạo bậc thầy) là sự kết hợp giữa sự thực tế và tham vọng, tạo nên một gia đình ổn định nhưng cần sự cân bằng. Số 4 mang lại sự đáng tin cậy và tổ chức, trong khi số 22 cung cấp tầm nhìn lớn và khả năng thực hiện. Sự tương đồng về tính thực tế có thể bền vững, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 mang lại sự ổn định và cấu trúc, trong khi số 22 đảm bảo gia đình có mục tiêu lớn. Họ bổ sung cho nhau, với số 4 tạo nền tảng an toàn và số 22 khuyến khích số 4 đạt mục tiêu lớn hơn. Khả năng phối hợp tạo nên một gia đình thành công.",
        "weaknesses": "Số 4 có thể cảm thấy số 22 quá kiểm soát, trong khi số 22 có thể thấy số 4 thiếu tham vọng. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. mục tiêu lớn) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa thực tế và kiến tạo có thể tạo ra một cuộc sống gia đình thành công. Việc cùng nhau xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 4 tập trung vào trách nhiệm, số 22 tập trung vào mục tiêu lớn. Số 4 cần linh hoạt hơn, còn số 22 cần kiên nhẫn hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như quản lý tài chính hoặc xây dựng dự án chung. Số 4 nên cởi mở hơn với tham vọng, còn số 22 cần tôn trọng sự thận trọng của số 4. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 22 (Nhà kiến tạo bậc thầy) có thể tạo ra kết quả ấn tượng nhờ sự kết hợp giữa kỷ luật và tầm nhìn lớn. Số 4 mang lại sự thực tế và khả năng thực hiện, trong khi số 22 cung cấp tư duy chiến lược và khả năng kiến tạo. Sự tương đồng này tạo nên một đội nhóm mạnh mẽ, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 4 đảm bảo mọi thứ được thực hiện đúng kế hoạch, trong khi số 22 dẫn dắt dự án với tầm nhìn chiến lược. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 22 mang lại động lực. Khả năng phối hợp tạo ra những dự án thành công.",
        "weaknesses": "Số 4 có thể thấy số 22 quá kiểm soát, trong khi số 22 có thể cảm thấy số 4 quá chậm chạp. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (kỷ luật vs. chiến lược) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án xây dựng hoặc tổ chức. Sự kết hợp giữa thực tế và kiến tạo có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 thận trọng, số 22 quyết đoán. Số 4 cần cởi mở hơn với tham vọng, còn số 22 cần kiên nhẫn hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 4 tập trung vào thực hiện và số 22 tập trung vào chiến lược. Số 4 nên cởi mở hơn với tham vọng, còn số 22 cần tôn trọng sự thận trọng của số 4. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ."
      }
    }
  ]
}