{
  "number": 22,
  "description": "Số đường đời 22 là số chính số, đại diện cho sự thực tế, tầm nhìn lớn và khả năng kiến tạo. Những người mang số 22 thường có khả năng tổ chức vượt trội, định hướng mục tiêu rõ ràng và khát vọng xây dựng những giá trị lâu dài. Họ là những người thực hiện lý tưởng, nhưng có thể trở nên quá cầu toàn hoặc áp lực nếu không cân bằng được trách nhiệm.",
  "compatibility": [
    {
      "partnerNumber": 1,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nMối quan hệ giữa số 22 (Nhà kiến tạo) và số 1 (Nhà lãnh đạo) là sự kết hợp giữa khả năng thực hiện và tham vọng cá nhân. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 1 cung cấp sự tự tin, độc lập và năng lượng lãnh đạo. Sự tương phản này có thể tạo ra một tình yêu năng động nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 22 mang lại sự ổn định và khả năng thực hiện, trong khi số 1 bổ sung bằng sự sáng tạo và quyết đoán. Họ có thể học hỏi lẫn nhau, với số 22 giúp số 1 tập trung vào mục tiêu dài hạn và số 1 khuyến khích số 22 đổi mới. Sự kết hợp này có thể tạo ra một mối quan hệ phong phú nếu cả hai nỗ lực.",
        "weaknesses": "Số 22 có thể cảm thấy số 1 quá ích kỷ hoặc thiếu kiên nhẫn, trong khi số 1 có thể thấy số 22 quá cầu toàn hoặc cứng nhắc. Sự khác biệt trong ưu tiên (thực tế vs. mục tiêu cá nhân) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa thực tế và lãnh đạo có thể tạo ra một tình yêu ý nghĩa. Việc cùng tham gia các hoạt động sáng tạo hoặc xây dựng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc và mục tiêu dài hạn, số 1 cần độc lập và thành công tức thời. Số 22 cần linh hoạt hơn, còn số 1 cần kiên nhẫn hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động xây dựng như lập kế hoạch hoặc sáng tạo như làm nghệ thuật để tăng sự gắn kết. Số 22 cần cởi mở hơn với ý tưởng mới, còn số 1 nên tôn trọng kế hoạch của số 22. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tham gia hội thảo sáng tạo hoặc đi triển lãm có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 22 (Nhà kiến tạo) và số 1 (Nhà lãnh đạo) mang đến sự kết hợp giữa khả năng thực hiện và tham vọng, nhưng đối mặt với thử thách do khác biệt trong phong cách sống. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 1 cung cấp sự độc lập, sáng tạo và năng lượng lãnh đạo. Sự tương phản này có thể tạo ra một gia đình độc đáo nhưng cần nỗ lực để duy trì hòa hợp.",
        "strengths": "Số 22 tạo ra một môi trường gia đình ổn định và có tổ chức, trong khi số 1 mang lại sự tự tin và năng lượng tích cực. Họ có thể bổ sung cho nhau, với số 22 giúp số 1 tập trung vào mục tiêu dài hạn và số 1 hỗ trợ số 22 đổi mới. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 22 có thể cảm thấy số 1 quá độc lập hoặc thiếu cam kết, trong khi số 1 có thể thấy số 22 quá cầu toàn hoặc cứng nhắc. Sự khác biệt trong ưu tiên (thực tế vs. mục tiêu cá nhân) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa thực tế và lãnh đạo có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động xây dựng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 1 cần độc lập. Số 22 cần chia sẻ trách nhiệm, còn số 1 cần cam kết hơn với gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình xây dựng như làm đồ thủ công hoặc lập kế hoạch tài chính để tăng sự gắn kết. Số 22 cần cởi mở hơn với ý tưởng mới, còn số 1 nên cam kết hơn với gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia dự án xã hội hoặc tổ chức sự kiện gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 22 (Nhà kiến tạo) và số 1 (Nhà lãnh đạo) có thể hiệu quả trong các dự án cần sự cân bằng giữa thực tế và sáng tạo. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 1 cung cấp sự độc lập, ý tưởng mới mẻ và năng lượng lãnh đạo. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 22 mang lại sự tổ chức và khả năng thực hiện, trong khi số 1 đảm bảo sự sáng tạo và khả năng dẫn dắt. Họ bổ sung cho nhau, với số 22 cung cấp cấu trúc và số 1 mang lại ý tưởng mới. Khả năng học hỏi lẫn nhau giúp số 22 đổi mới hơn và số 1 tập trung hơn.",
        "weaknesses": "Số 22 có thể cảm thấy số 1 quá bốc đồng hoặc thiếu kỷ luật, trong khi số 1 có thể thấy số 22 quá cứng nhắc hoặc chậm chạp. Sự khác biệt trong phong cách làm việc (thực tế vs. mục tiêu cá nhân) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như kinh doanh, xây dựng hoặc quản lý dự án. Sự kết hợp giữa thực tế và sáng tạo có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 22 thực tế và nhiệm vụ định hướng, số 1 độc lập và mục tiêu định hướng. Số 22 cần tôn trọng ý tưởng của số 1, còn số 1 cần tôn trọng kế hoạch của số 22. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 22 tập trung vào thực hiện và số 1 xử lý sáng tạo. Số 22 cần khuyến khích ý tưởng của số 1, còn số 1 nên tôn trọng tiến độ của số 22. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo kinh doanh hoặc dự án cộng đồng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 22 (Nhà kiến tạo) và số 2 (Nhà ngoại giao) là sự kết hợp hài hòa giữa khả năng thực hiện và sự nhạy cảm. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 2 cung cấp sự thấu hiểu, hỗ trợ và khả năng hòa giải. Sự tương đồng trong sự chăm sóc và định hướng mục tiêu giúp họ xây dựng một tình yêu sâu sắc và bền vững.",
        "strengths": "Số 22 mang lại sự ổn định và khả năng thực hiện, trong khi số 2 bổ sung bằng sự dịu dàng và an toàn cảm xúc. Họ hỗ trợ nhau, với số 22 giúp số 2 tự tin hơn trong mục tiêu và số 2 khuyến khích số 22 cởi mở hơn về cảm xúc. Sự kết hợp này tạo ra một mối quan hệ ấm áp và ý nghĩa.",
        "weaknesses": "Số 22 có thể cảm thấy số 2 quá phụ thuộc hoặc thiếu tham vọng, trong khi số 2 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong mức độ thực tế có thể gây căng thẳng nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu lâu dài nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa thực tế và chăm sóc có thể tạo ra một mối quan hệ thành công. Việc cùng tham gia các hoạt động xây dựng hoặc chăm sóc sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 2 cần cảm xúc cá nhân. Số 22 cần chú ý đến nhu cầu của số 2, còn số 2 cần tự tin hơn trong việc bày tỏ. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động chăm sóc như nấu ăn chung hoặc xây dựng như làm đồ thủ công để tăng sự gắn kết. Số 22 cần cởi mở hơn với cảm xúc cá nhân, còn số 2 nên tôn trọng kế hoạch của số 22. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi dạo công viên hoặc tổ chức bữa tối có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nHôn nhân giữa số 22 (Nhà kiến tạo) và số 2 (Nhà ngoại giao) mang đến sự kết hợp tuyệt vời giữa khả năng thực hiện và sự chăm sóc, tạo nên một gia đình ấm áp và ổn định. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 2 cung cấp sự thấu hiểu, hỗ trợ và khả năng hòa giải. Sự tương đồng trong sự chăm sóc giúp họ xây dựng một mái ấm bền vững.",
        "strengths": "Số 22 tạo ra một môi trường gia đình ổn định và có tổ chức, trong khi số 2 mang lại sự ấm áp và an toàn cảm xúc. Họ bổ sung cho nhau, với số 22 giúp số 2 hướng tới mục tiêu lớn hơn và số 2 hỗ trợ số 22 cởi mở hơn. Khả năng hỗ trợ lẫn nhau trong các giá trị chung là điểm mạnh lớn.",
        "weaknesses": "Số 22 có thể cảm thấy số 2 quá phụ thuộc hoặc thiếu tham vọng, trong khi số 2 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong mức độ thực tế có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ lý tưởng nếu cả hai học cách cân bằng. Sự kết hợp giữa thực tế và chăm sóc có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động chăm sóc sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 2 cần cảm xúc. Số 22 cần chú ý đến nhu cầu gia đình, còn số 2 cần tự tin hơn trong việc bày tỏ. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình chăm sóc như làm vườn hoặc xây dựng như làm đồ thủ công để tăng sự gắn kết. Số 22 cần cởi mở hơn với cảm xúc, còn số 2 nên tham gia các mục tiêu lớn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia dự án xã hội hoặc tổ chức chuyến đi gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 22 (Nhà kiến tạo) và số 2 (Nhà ngoại giao) là sự kết hợp mạnh mẽ trong các dự án cần sự cân bằng giữa thực tế và ngoại giao. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 2 cung cấp kỹ năng ngoại giao, sự hỗ trợ và khả năng xây dựng mối quan hệ. Sự tương đồng trong sự chăm sóc tạo nên một đội nhóm xuất sắc.",
        "strengths": "Số 22 mang lại sự tổ chức và khả năng thực hiện, trong khi số 2 đảm bảo hòa khí và xây dựng mối quan hệ. Họ bổ sung cho nhau, với số 22 cung cấp cấu trúc và số 2 mang lại sự hỗ trợ. Khả năng học hỏi lẫn nhau giúp số 22 cởi mở hơn và số 2 tự tin hơn.",
        "weaknesses": "Số 22 có thể cảm thấy số 2 quá nhạy cảm hoặc thiếu tham vọng, trong khi số 2 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong phong cách làm việc (thực tế vs. người định hướng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như quản lý dự án, dịch vụ cộng đồng hoặc kinh doanh. Sự kết hợp giữa thực tế và ngoại giao có thể dẫn đến những kết quả ý nghĩa. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 22 thực tế và nhiệm vụ định hướng, số 2 cẩn thận và người định hướng. Số 22 cần tôn trọng ý kiến của số 2, còn số 2 cần tự tin đóng góp ý tưởng. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 22 tập trung vào thực hiện và số 2 xử lý quan hệ đối ngoại. Số 22 cần khuyến khích ý kiến của số 2, còn số 2 nên tự tin đóng góp ý tưởng. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo đội nhóm hoặc dự án cộng đồng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nMối quan hệ giữa số 22 (Nhà kiến tạo) và số 3 (Nhà sáng tạo) là sự kết hợp giữa khả năng thực hiện và năng lượng sáng tạo. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 3 cung cấp sự lạc quan, biểu đạt và niềm vui. Sự tương phản này có thể tạo ra một tình yêu năng động nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 22 mang lại sự ổn định và khả năng thực hiện, trong khi số 3 bổ sung bằng sự vui tươi và sáng tạo. Họ có thể học hỏi lẫn nhau, với số 22 giúp số 3 tập trung hơn và số 3 khuyến khích số 22 thư giãn hơn. Sự kết hợp này có thể tạo ra một mối quan hệ phong phú nếu cả hai nỗ lực.",
        "weaknesses": "Số 22 có thể cảm thấy số 3 quá phân tán hoặc thiếu trách nhiệm, trong khi số 3 có thể thấy số 22 quá cầu toàn hoặc nghiêm túc. Sự khác biệt trong mức độ tập trung có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa thực tế và sáng tạo có thể tạo ra một tình yêu ý nghĩa. Việc cùng tham gia các hoạt động sáng tạo hoặc xây dựng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 3 cần biểu đạt. Số 22 cần linh hoạt hơn, còn số 3 cần cam kết hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động sáng tạo như làm nghệ thuật hoặc xây dựng như làm đồ thủ công để tăng sự gắn kết. Số 22 cần cởi mở hơn với niềm vui, còn số 3 nên tôn trọng kế hoạch của số 22. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi công viên giải trí hoặc làm gốm có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 22 (Nhà kiến tạo) và số 3 (Nhà sáng tạo) mang đến sự kết hợp giữa khả năng thực hiện và năng lượng sáng tạo, nhưng đối mặt với thử thách do khác biệt trong phong cách sống. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 3 cung cấp sự lạc quan, sáng tạo và niềm vui. Sự tương phản này có thể tạo ra một gia đình độc đáo nhưng cần nỗ lực để duy trì hòa hợp.",
        "strengths": "Số 22 tạo ra một môi trường gia đình ổn định và có tổ chức, trong khi số 3 mang lại sự vui tươi và sáng tạo. Họ có thể bổ sung cho nhau, với số 22 giúp số 3 tập trung hơn và số 3 hỗ trợ số 22 thư giãn hơn. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 22 có thể cảm thấy số 3 quá phân tán hoặc thiếu cam kết, trong khi số 3 có thể thấy số 22 quá cầu toàn hoặc nghiêm túc. Sự khác biệt trong mức độ trách nhiệm có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa thực tế và sáng tạo có thể tạo ra một gia đình hạnh phúc và năng động. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 3 cần biểu đạt. Số 22 cần chia sẻ trách nhiệm, còn số 3 cần cam kết hơn với gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình sáng tạo như làm nghệ thuật hoặc tham gia từ thiện để tăng sự gắn kết. Số 22 cần cởi mở hơn với niềm vui, còn số 3 nên tham gia các mục tiêu gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học sáng tạo hoặc tổ chức chuyến đi gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 22 (Nhà kiến tạo) và số 3 (Nhà sáng tạo) có thể hiệu quả trong các dự án cần sự cân bằng giữa thực tế và sáng tạo. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 3 cung cấp sự lạc quan, biểu đạt và ý tưởng sáng tạo. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 22 mang lại sự tổ chức và khả năng thực hiện, trong khi số 3 đảm bảo sự thu hút và ý tưởng mới mẻ. Họ bổ sung cho nhau, với số 22 cung cấp cấu trúc và số 3 mang lại biểu đạt. Khả năng học hỏi lẫn nhau giúp số 22 đổi mới hơn và số 3 tập trung hơn.",
        "weaknesses": "Số 22 có thể cảm thấy số 3 quá phân tán hoặc thiếu kỷ luật, trong khi số 3 có thể thấy số 22 quá cầu toàn hoặc nghiêm túc. Sự khác biệt trong phong cách làm việc (thực tế vs. sáng tạo) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như truyền thông, thiết kế hoặc tổ chức sự kiện. Sự kết hợp giữa thực tế và sáng tạo có thể dẫn đến những kết quả độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 22 thực tế và nhiệm vụ định hướng, số 3 tự do và sáng tạo định hướng. Số 22 cần tôn trọng ý tưởng của số 3, còn số 3 cần tôn trọng tiến độ của số 22. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 22 tập trung vào thực hiện và số 3 xử lý sáng tạo. Số 22 cần khuyến khích ý tưởng của số 3, còn số 3 nên tôn trọng tiến độ của số 22. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo sáng tạo hoặc brainstorming có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 22 (Nhà kiến tạo) và số 4 (Nhà xây dựng) là sự kết hợp hài hòa giữa khả năng thực hiện và sự thực tế. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 4 cung cấp sự đáng tin cậy, kỷ luật và khả năng xây dựng. Sự tương đồng trong định hướng mục tiêu giúp họ xây dựng một tình yêu sâu sắc và bền vững.",
        "strengths": "Số 22 mang lại sự tổ chức và tầm nhìn lớn, trong khi số 4 bổ sung bằng sự ổn định và khả năng thực hiện. Họ hỗ trợ nhau, với số 22 giúp số 4 hướng tới mục tiêu lớn hơn và số 4 khuyến khích số 22 tập trung hơn. Sự kết hợp này tạo ra một mối quan hệ ổn định và ý nghĩa.",
        "weaknesses": "Số 22 có thể cảm thấy số 4 quá cứng nhắc hoặc thiếu sáng tạo, trong khi số 4 có thể thấy số 22 quá cầu toàn hoặc áp lực. Sự tương đồng trong tính cách thực tế có thể dẫn đến thiếu cảm xúc nếu không được giải quyết.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu lâu dài nếu cả hai học cách bổ sung cảm xúc. Sự kết hợp giữa thực tế và kỷ luật có thể tạo ra một mối quan hệ thành công. Việc cùng tham gia các hoạt động xây dựng hoặc lập kế hoạch sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là xu hướng quá thực tế, có thể thiếu niềm vui hoặc cảm xúc. Số 22 cần cởi mở hơn với cảm xúc, còn số 4 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động xây dựng như làm đồ thủ công hoặc lập kế hoạch để tăng sự gắn kết. Số 22 cần cởi mở hơn với cảm xúc, còn số 4 nên tôn trọng tầm nhìn của số 22. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tham gia dự án cộng đồng hoặc tổ chức bữa tối có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nHôn nhân giữa số 22 (Nhà kiến tạo) và số 4 (Nhà xây dựng) mang đến sự kết hợp tuyệt vời giữa khả năng thực hiện và sự thực tế, tạo nên một gia đình ổn định và ý nghĩa. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 4 cung cấp sự đáng tin cậy, kỷ luật và khả năng xây dựng. Sự tương đồng trong định hướng mục tiêu giúp họ xây dựng một mái ấm bền vững.",
        "strengths": "Số 22 tạo ra một môi trường gia đình ổn định và có tổ chức, trong khi số 4 mang lại sự đáng tin cậy và khả năng thực hiện. Họ bổ sung cho nhau, với số 22 giúp số 4 hướng tới mục tiêu lớn hơn và số 4 hỗ trợ số 22 tập trung hơn. Khả năng hỗ trợ lẫn nhau trong các giá trị chung là điểm mạnh lớn.",
        "weaknesses": "Số 22 có thể cảm thấy số 4 quá cứng nhắc hoặc thiếu sáng tạo, trong khi số 4 có thể thấy số 22 quá cầu toàn hoặc áp lực. Sự tương đồng trong tính cách thực tế có thể dẫn đến thiếu cảm xúc nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ lý tưởng nếu cả hai học cách bổ sung cảm xúc. Sự kết hợp giữa thực tế và kỷ luật có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động xây dựng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là xu hướng quá thực tế, có thể thiếu niềm vui hoặc cảm xúc. Số 22 cần chú ý đến nhu cầu gia đình, còn số 4 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình xây dựng như làm đồ thủ công hoặc tham gia từ thiện để tăng sự gắn kết. Số 22 cần cởi mở hơn với cảm xúc, còn số 4 nên tham gia các mục tiêu lớn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia dự án cộng đồng hoặc tổ chức sự kiện gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 22 (Nhà kiến tạo) và số 4 (Nhà xây dựng) là sự kết hợp mạnh mẽ trong các dự án cần sự thực tế và kỷ luật. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 4 cung cấp sự đáng tin cậy, kỷ luật và khả năng thực hiện. Sự tương đồng trong định hướng mục tiêu tạo nên một đội nhóm xuất sắc.",
        "strengths": "Số 22 mang lại sự tổ chức và tầm nhìn lớn, trong khi số 4 đảm bảo tiến độ và chất lượng bằng sự kỷ luật. Họ bổ sung cho nhau, với số 22 cung cấp cấu trúc và số 4 mang lại thực hiện. Khả năng học hỏi lẫn nhau giúp số 22 đổi mới hơn và số 4 tập trung hơn.",
        "weaknesses": "Số 22 có thể cảm thấy số 4 quá cứng nhắc hoặc thiếu sáng tạo, trong khi số 4 có thể thấy số 22 quá cầu toàn hoặc áp lực. Sự tương đồng trong tính cách thực tế có thể dẫn đến thiếu sáng tạo nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như xây dựng, kinh doanh hoặc quản lý dự án. Sự kết hợp giữa thực tế và kỷ luật có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là xu hướng quá thực tế, có thể thiếu sáng tạo. Số 22 cần tôn trọng ý kiến của số 4, còn số 4 cần cởi mở với ý tưởng lớn. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 22 tập trung vào tầm nhìn và số 4 xử lý thực hiện. Số 22 cần khuyến khích ý kiến của số 4, còn số 4 nên tôn trọng tiến độ của số 22. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo kinh doanh hoặc dự án cộng đồng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 22 (Nhà kiến tạo) và số 5 (Nhà phiêu lưu) là sự kết hợp giữa khả năng thực hiện và sự tự do. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 5 cung cấp sự linh hoạt, năng lượng và tinh thần khám phá. Sự tương phản này có thể tạo ra một tình yêu năng động nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 22 mang lại sự ổn định và khả năng thực hiện, trong khi số 5 bổ sung bằng sự táo bạo và khả năng thích nghi. Họ có thể học hỏi lẫn nhau, với số 22 giúp số 5 tập trung hơn và số 5 khuyến khích số 22 khám phá hơn. Sự kết hợp này có thể tạo ra một mối quan hệ phong phú nếu cả hai nỗ lực.",
        "weaknesses": "Số 22 có thể cảm thấy số 5 quá bốc đồng hoặc thiếu trách nhiệm, trong khi số 5 có thể thấy số 22 quá cầu toàn hoặc cứng nhắc. Sự khác biệt trong ưu tiên (thực tế vs. tự do) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa thực tế và tự do có thể tạo ra một tình yêu độc đáo. Việc cùng tham gia các hoạt động phiêu lưu hoặc xây dựng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 5 cần tự do. Số 22 cần linh hoạt hơn, còn số 5 cần cam kết hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động phiêu lưu như du lịch hoặc xây dựng như làm đồ thủ công để tăng sự gắn kết. Số 22 cần cởi mở hơn với trải nghiệm mới, còn số 5 nên tôn trọng kế hoạch của số 22. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như khám phá thành phố hoặc tham gia sự kiện xã hội có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nHôn nhân giữa số 22 (Nhà kiến tạo) và số 5 (Nhà phiêu lưu) mang đến sự kết hợp giữa khả năng thực hiện và sự tự do, nhưng đối mặt với thử thách lớn do khác biệt trong phong cách sống. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 5 cung cấp sự linh hoạt, năng lượng và tinh thần khám phá. Sự tương phản này có thể tạo ra một gia đình năng động nhưng cần nỗ lực lớn để duy trì hòa hợp.",
        "strengths": "Số 22 tạo ra một môi trường gia đình ổn định và có tổ chức, trong khi số 5 mang lại sự táo bạo và năng lượng tích cực. Họ có thể bổ sung cho nhau, với số 22 giúp số 5 tập trung hơn và số 5 hỗ trợ số 22 khám phá hơn. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 22 có thể cảm thấy số 5 quá bốc đồng hoặc thiếu cam kết, trong khi số 5 có thể thấy số 22 quá cầu toàn hoặc cứng nhắc. Sự khác biệt trong ưu tiên (thực tế vs. tự do) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa thực tế và tự do có thể tạo ra một gia đình hạnh phúc và năng động. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động phiêu lưu sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 5 cần tự do. Số 22 cần chia sẻ trách nhiệm, còn số 5 cần cam kết hơn với gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình phiêu lưu như đi du lịch hoặc tham gia từ thiện để tăng sự gắn kết. Số 22 cần cởi mở hơn với trải nghiệm mới, còn số 5 nên cam kết hơn với gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia dự án xã hội hoặc tổ chức chuyến đi gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 22 (Nhà kiến tạo) và số 5 (Nhà phiêu lưu) có thể hiệu quả trong các dự án cần sự cân bằng giữa thực tế và sáng tạo. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 5 cung cấp sự linh hoạt, ý tưởng mới mẻ và năng lượng. Sự tương phản này tạo nên một đội nhóm năng động, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 22 mang lại sự tổ chức và khả năng thực hiện, trong khi số 5 đảm bảo sự sáng tạo và khả năng thích nghi. Họ bổ sung cho nhau, với số 22 cung cấp cấu trúc và số 5 mang lại ý tưởng mới. Khả năng học hỏi lẫn nhau giúp số 22 đổi mới hơn và số 5 tập trung hơn.",
        "weaknesses": "Số 22 có thể cảm thấy số 5 quá bốc đồng hoặc thiếu kỷ luật, trong khi số 5 có thể thấy số 22 quá cầu toàn hoặc cứng nhắc. Sự khác biệt trong phong cách làm việc (thực tế vs. tự do) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như truyền thông, tổ chức sự kiện hoặc kinh doanh. Sự kết hợp giữa thực tế và sáng tạo có thể dẫn đến những kết quả độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 22 thực tế và nhiệm vụ định hướng, số 5 tự do và ý tưởng định hướng. Số 22 cần tôn trọng ý tưởng của số 5, còn số 5 cần tôn trọng tiến độ của số 22. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 22 tập trung vào thực hiện và số 5 xử lý sáng tạo. Số 22 cần khuyến khích ý tưởng của số 5, còn số 5 nên tôn trọng tiến độ của số 22. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo sáng tạo hoặc dự án cộng đồng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 22 (Nhà kiến tạo) và số 6 (Nhà chăm sóc) là sự kết hợp hài hòa giữa khả năng thực hiện và tình yêu thương. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 6 cung cấp sự chu đáo, trách nhiệm và tình cảm sâu sắc. Sự tương đồng trong định hướng mục tiêu giúp họ xây dựng một tình yêu sâu sắc và bền vững.",
        "strengths": "Số 22 mang lại sự ổn định và khả năng thực hiện, trong khi số 6 bổ sung bằng sự thấu hiểu và an toàn cảm xúc. Họ hỗ trợ nhau, với số 22 giúp số 6 hướng tới mục tiêu lớn hơn và số 6 khuyến khích số 22 cởi mở hơn về cảm xúc. Sự kết hợp này tạo ra một mối quan hệ ấm áp và ý nghĩa.",
        "weaknesses": "Số 22 có thể cảm thấy số 6 quá kiểm soát hoặc thiếu tham vọng, trong khi số 6 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong mức độ thực tế có thể gây căng thẳng nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu lâu dài nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa thực tế và chăm sóc có thể tạo ra một mối quan hệ thành công. Việc cùng tham gia các hoạt động xây dựng hoặc chăm sóc sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 6 cần cảm xúc. Số 22 cần chú ý đến nhu cầu của số 6, còn số 6 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động chăm sóc như nấu ăn chung hoặc xây dựng như làm đồ thủ công để tăng sự gắn kết. Số 22 cần cởi mở hơn với cảm xúc cá nhân, còn số 6 nên tôn trọng kế hoạch của số 22. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tổ chức bữa tối hoặc đi công viên có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nHôn nhân giữa số 22 (Nhà kiến tạo) và số 6 (Nhà chăm sóc) mang đến sự kết hợp tuyệt vời giữa khả năng thực hiện và tình yêu thương, tạo nên một gia đình ấm áp và ổn định. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 6 cung cấp sự chu đáo, tình yêu thương và hòa giải. Sự tương đồng trong định hướng mục tiêu giúp họ xây dựng một mái ấm bền vững.",
        "strengths": "Số 22 tạo ra một môi trường gia đình ổn định và có tổ chức, trong khi số 6 mang lại sự ấm áp và an toàn cảm xúc. Họ bổ sung cho nhau, với số 22 giúp số 6 hướng tới mục tiêu lớn hơn và số 6 hỗ trợ số 22 cởi mở hơn. Khả năng hỗ trợ lẫn nhau trong các giá trị chung là điểm mạnh lớn.",
        "weaknesses": "Số 22 có thể cảm thấy số 6 quá kiểm soát hoặc thiếu tham vọng, trong khi số 6 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong mức độ thực tế có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ lý tưởng nếu cả hai học cách cân bằng. Sự kết hợp giữa thực tế và chăm sóc có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động chăm sóc sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 6 cần cảm xúc. Số 22 cần chú ý đến nhu cầu gia đình, còn số 6 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình chăm sóc như làm vườn hoặc xây dựng như làm đồ thủ công để tăng sự gắn kết. Số 22 cần cởi mở hơn với cảm xúc, còn số 6 nên tham gia các mục tiêu lớn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia dự án xã hội hoặc tổ chức chuyến đi gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 22 (Nhà kiến tạo) và số 6 (Nhà chăm sóc) là sự kết hợp mạnh mẽ trong các dự án cần sự cân bằng giữa thực tế và chăm sóc. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 6 cung cấp sự chu đáo, trách nhiệm và khả năng xây dựng mối quan hệ. Sự tương đồng trong định hướng mục tiêu tạo nên một đội nhóm xuất sắc.",
        "strengths": "Số 22 mang lại sự tổ chức và khả năng thực hiện, trong khi số 6 đảm bảo hòa khí và xây dựng mối quan hệ. Họ bổ sung cho nhau, với số 22 cung cấp cấu trúc và số 6 mang lại sự hỗ trợ. Khả năng học hỏi lẫn nhau giúp số 22 cởi mở hơn và số 6 tự tin hơn.",
        "weaknesses": "Số 22 có thể cảm thấy số 6 quá nhạy cảm hoặc thiếu tham vọng, trong khi số 6 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong phong cách làm việc (thực tế vs. người định hướng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như dịch vụ cộng đồng, kinh doanh hoặc giáo dục. Sự kết hợp giữa thực tế và chăm sóc có thể dẫn đến những kết quả ý nghĩa. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 22 thực tế và nhiệm vụ định hướng, số 6 cẩn thận và người định hướng. Số 22 cần tôn trọng ý kiến của số 6, còn số 6 cần tự tin đóng góp ý tưởng. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 22 tập trung vào thực hiện và số 6 xử lý quan hệ đối ngoại. Số 22 cần khuyến khích ý kiến của số 6, còn số 6 nên tự tin đóng góp ý tưởng. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo đội nhóm hoặc dự án cộng đồng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 22 (Nhà kiến tạo) và số 7 (Nhà hiền triết) là sự kết hợp giữa khả năng thực hiện và sự sâu sắc. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 7 cung cấp sự nội tâm, tri thức và tư duy logic. Sự tương phản này có thể tạo ra một tình yêu hấp dẫn nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 22 mang lại sự ổn định và khả năng thực hiện, trong khi số 7 bổ sung bằng sự sâu sắc và tư duy phân tích. Họ có thể học hỏi lẫn nhau, với số 22 giúp số 7 thực tế hơn và số 7 khuyến khích số 22 suy ngẫm sâu hơn. Sự kết hợp này có thể tạo ra một mối quan hệ kích thích nếu cả hai cởi mở.",
        "weaknesses": "Số 22 có thể cảm thấy số 7 quá xa cách hoặc thiếu thực tế, trong khi số 7 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong ưu tiên (thực tế vs. nội tâm) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa thực tế và tư duy có thể tạo ra một tình yêu độc đáo. Việc cùng tham gia các hoạt động tri thức hoặc xây dựng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 7 cần riêng tư. Số 22 cần kiên nhẫn hơn, còn số 7 cần cởi mở hơn với cảm xúc. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động tri thức như thảo luận sách hoặc xây dựng như làm đồ thủ công để tăng sự gắn kết. Số 22 cần cởi mở hơn với suy ngẫm, còn số 7 nên tôn trọng kế hoạch của số 22. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi du lịch hoặc tổ chức bữa tối có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nHôn nhân giữa số 22 (Nhà kiến tạo) và số 7 (Nhà hiền triết) mang đến sự kết hợp giữa khả năng thực hiện và sự sâu sắc, nhưng đối mặt với thử thách lớn do khác biệt trong phong cách sống. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 7 cung cấp sự nội tâm, tri thức và tư duy logic. Sự tương phản này có thể tạo ra một gia đình độc đáo nhưng cần nỗ lực lớn để duy trì hòa hợp.",
        "strengths": "Số 22 tạo ra một môi trường gia đình ổn định và có tổ chức, trong khi số 7 mang lại sự sâu sắc và tư duy phân tích. Họ có thể bổ sung cho nhau, với số 22 giúp số 7 thực tế hơn và số 7 hỗ trợ số 22 suy ngẫm sâu hơn. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 22 có thể cảm thấy số 7 quá xa cách hoặc thiếu cam kết, trong khi số 7 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong ưu tiên (thực tế vs. nội tâm) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa thực tế và tư duy có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động tri thức sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 7 cần riêng tư. Số 22 cần chia sẻ cảm xúc, còn số 7 cần cởi mở hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình tri thức như đọc sách hoặc tham gia từ thiện để tăng sự gắn kết. Số 22 cần cởi mở hơn với suy ngẫm, còn số 7 nên tham gia các mục tiêu gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học tâm lý hoặc tổ chức sự kiện gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 22 (Nhà kiến tạo) và số 7 (Nhà hiền triết) có thể hiệu quả trong các dự án cần sự cân bằng giữa thực tế và phân tích. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 7 cung cấp sự sâu sắc, tri thức và tư duy logic. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 22 mang lại sự tổ chức và khả năng thực hiện, trong khi số 7 đảm bảo chiều sâu tư duy và phân tích. Họ bổ sung cho nhau, với số 22 cung cấp cấu trúc và số 7 mang lại nghiên cứu. Khả năng học hỏi lẫn nhau giúp số 22 đổi mới hơn và số 7 thực tế hơn.",
        "weaknesses": "Số 22 có thể cảm thấy số 7 quá chậm chạp hoặc thiếu thực tế, trong khi số 7 có thể thấy số 22 quá cầu toàn hoặc cứng nhắc. Sự khác biệt trong phong cách làm việc (thực tế vs. phân tích) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghiên cứu, tư vấn hoặc kinh doanh. Sự kết hợp giữa thực tế và phân tích có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 22 thực tế và nhiệm vụ định hướng, số 7 độc lập và phân tích định hướng. Số 22 cần tôn trọng tiến độ của số 7, còn số 7 cần cởi mở với ý tưởng lớn. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 22 tập trung vào thực hiện và số 7 xử lý phân tích. Số 22 cần khuyến khích ý tưởng của số 7, còn số 7 nên tôn trọng tiến độ của số 22. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo nghiên cứu hoặc dự án cộng đồng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 22 (Nhà kiến tạo) và số 8 (Nhà quyền lực) là sự kết hợp mạnh mẽ giữa khả năng thực hiện và tham vọng. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 8 cung cấp sự quyết đoán, quyền lực và định hướng thành công. Sự tương đồng trong định hướng mục tiêu giúp họ xây dựng một tình yêu sâu sắc và bền vững.",
        "strengths": "Số 22 mang lại sự tổ chức và khả năng thực hiện, trong khi số 8 bổ sung bằng sự ổn định và khả năng lãnh đạo. Họ hỗ trợ nhau, với số 22 giúp số 8 tập trung vào mục tiêu dài hạn và số 8 khuyến khích số 22 quyết đoán hơn. Sự kết hợp này tạo ra một mối quan hệ ổn định và ý nghĩa.",
        "weaknesses": "Số 22 có thể cảm thấy số 8 quá kiểm soát hoặc thiếu cảm xúc, trong khi số 8 có thể thấy số 22 quá cầu toàn hoặc chậm chạp. Sự tương đồng trong tính cách tham vọng có thể dẫn đến cạnh tranh nếu không được giải quyết.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu lâu dài nếu cả hai học cách bổ sung cảm xúc. Sự kết hợp giữa thực tế và quyền lực có thể tạo ra một mối quan hệ thành công. Việc cùng tham gia các hoạt động xây dựng hoặc lập kế hoạch sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là xu hướng quá tham vọng, có thể thiếu cảm xúc. Số 22 cần cởi mở hơn với cảm xúc, còn số 8 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động xây dựng như lập kế hoạch hoặc quản lý tài chính để tăng sự gắn kết. Số 22 cần cởi mở hơn với cảm xúc, còn số 8 nên tôn trọng kế hoạch của số 22. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tham gia sự kiện xã hội hoặc tổ chức bữa tối có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nHôn nhân giữa số 22 (Nhà kiến tạo) và số 8 (Nhà quyền lực) mang đến sự kết hợp tuyệt vời giữa khả năng thực hiện và tham vọng, tạo nên một gia đình ổn định và thành công. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 8 cung cấp sự quyết đoán, quyền lực và ổn định tài chính. Sự tương đồng trong định hướng mục tiêu giúp họ xây dựng một mái ấm bền vững.",
        "strengths": "Số 22 tạo ra một môi trường gia đình ổn định và có tổ chức, trong khi số 8 mang lại sự ổn định và khả năng lãnh đạo. Họ bổ sung cho nhau, với số 22 giúp số 8 tập trung vào mục tiêu dài hạn và số 8 hỗ trợ số 22 quyết đoán hơn. Khả năng hỗ trợ lẫn nhau trong các giá trị chung là điểm mạnh lớn.",
        "weaknesses": "Số 22 có thể cảm thấy số 8 quá kiểm soát hoặc thiếu cảm xúc, trong khi số 8 có thể thấy số 22 quá cầu toàn hoặc chậm chạp. Sự tương đồng trong tính cách tham vọng có thể dẫn đến cạnh tranh nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ lý tưởng nếu cả hai học cách bổ sung cảm xúc. Sự kết hợp giữa thực tế và quyền lực có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động xây dựng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là xu hướng quá tham vọng, có thể thiếu niềm vui hoặc cảm xúc. Số 22 cần chú ý đến nhu cầu gia đình, còn số 8 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình xây dựng như quản lý tài chính hoặc tham gia từ thiện để tăng sự gắn kết. Số 22 cần cởi mở hơn với cảm xúc, còn số 8 nên tham gia các mục tiêu lớn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia dự án xã hội hoặc tổ chức sự kiện gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 22 (Nhà kiến tạo) và số 8 (Nhà quyền lực) là sự kết hợp mạnh mẽ trong các dự án cần sự thực tế và chiến lược. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 8 cung cấp sự quyết đoán, tầm nhìn chiến lược và khả năng thực hiện. Sự tương đồng trong định hướng mục tiêu tạo nên một đội nhóm xuất sắc.",
        "strengths": "Số 22 mang lại sự tổ chức và khả năng thực hiện, trong khi số 8 đảm bảo sự tổ chức và khả năng lãnh đạo. Họ bổ sung cho nhau, với số 22 cung cấp cấu trúc và số 8 mang lại chiến lược. Khả năng học hỏi lẫn nhau giúp số 22 quyết đoán hơn và số 8 tập trung hơn.",
        "weaknesses": "Số 22 có thể cảm thấy số 8 quá kiểm soát hoặc thiếu cảm xúc, trong khi số 8 có thể thấy số 22 quá cầu toàn hoặc chậm chạp. Sự tương đồng trong tính cách tham vọng có thể dẫn đến cạnh tranh nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như kinh doanh, quản lý dự án hoặc kinh doanh xã hội. Sự kết hợp giữa thực tế và chiến lược có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là xu hướng quá tham vọng, có thể thiếu sáng tạo. Số 22 cần tôn trọng chiến lược của số 8, còn số 8 cần cởi mở với ý tưởng của số 22. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 22 tập trung vào thực hiện và số 8 xử lý chiến lược. Số 22 cần khuyến khích chiến lược của số 8, còn số 8 nên tôn trọng kế hoạch của số 22. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo kinh doanh hoặc dự án cộng đồng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nMối quan hệ giữa số 22 (Nhà kiến tạo) và số 9 (Nhà nhân đạo) là sự kết hợp giữa khả năng thực hiện và lòng nhân ái. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 9 cung cấp sự cống hiến, cảm xúc sâu sắc và tầm nhìn lớn. Sự tương phản này có thể tạo ra một tình yêu phong phú nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 22 mang lại sự ổn định và khả năng thực hiện, trong khi số 9 bổ sung bằng sự cống hiến và lòng nhân ái. Họ có thể học hỏi lẫn nhau, với số 22 giúp số 9 thực tế hơn và số 9 khuyến khích số 22 hướng tới mục tiêu ý nghĩa. Sự kết hợp này có thể tạo ra một mối quan hệ phong phú nếu cả hai nỗ lực.",
        "weaknesses": "Số 22 có thể cảm thấy số 9 quá lý tưởng hoặc thiếu tập trung, trong khi số 9 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong ưu tiên (thực tế vs. lý tưởng) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa thực tế và nhân ái có thể tạo ra một tình yêu sâu sắc. Việc cùng tham gia các hoạt động cộng đồng hoặc xây dựng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 9 cần lý tưởng. Số 22 cần cởi mở hơn với cảm xúc, còn số 9 cần thực tế hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động cộng đồng như tình nguyện hoặc xây dựng như làm đồ thủ công để tăng sự gắn kết. Số 22 cần cởi mở hơn với lý tưởng của số 9, còn số 9 nên tôn trọng kế hoạch của số 22. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tham gia hội thảo tâm lý hoặc tổ chức bữa tối có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 22 (Nhà kiến tạo) và số 9 (Nhà nhân đạo) mang đến sự kết hợp giữa khả năng thực hiện và lòng nhân ái, nhưng đối mặt với thử thách do khác biệt trong phong cách sống. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 9 cung cấp sự cống hiến, cảm xúc sâu sắc và tầm nhìn lớn. Sự tương phản này có thể tạo ra một gia đình độc đáo nhưng cần nỗ lực để duy trì hòa hợp.",
        "strengths": "Số 22 tạo ra một môi trường gia đình ổn định và có tổ chức, trong khi số 9 mang lại sự cống hiến và lòng nhân ái. Họ có thể bổ sung cho nhau, với số 22 giúp số 9 thực tế hơn và số 9 hỗ trợ số 22 hướng tới mục tiêu ý nghĩa. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 22 có thể cảm thấy số 9 quá lý tưởng hoặc thiếu cam kết, trong khi số 9 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong ưu tiên (thực tế vs. lý tưởng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa thực tế và nhân ái có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động cộng đồng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 9 cần lý tưởng. Số 22 cần chia sẻ cảm xúc, còn số 9 cần thực tế hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình cộng đồng như tình nguyện hoặc tham gia từ thiện để tăng sự gắn kết. Số 22 cần cởi mở hơn với lý tưởng, còn số 9 nên tham gia các mục tiêu gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học tâm lý hoặc tổ chức sự kiện gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 22 (Nhà kiến tạo) và số 9 (Nhà nhân đạo) có thể hiệu quả trong các dự án cần sự cân bằng giữa thực tế và lý tưởng. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 9 cung cấp sự cống hiến, cảm xúc sâu sắc và tầm nhìn lớn. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 22 mang lại sự tổ chức và khả năng thực hiện, trong khi số 9 đảm bảo sự cống hiến và lòng nhân ái. Họ bổ sung cho nhau, với số 22 cung cấp cấu trúc và số 9 mang lại ý nghĩa. Khả năng học hỏi lẫn nhau giúp số 22 sâu sắc hơn và số 9 thực tế hơn.",
        "weaknesses": "Số 22 có thể cảm thấy số 9 quá lý tưởng hoặc thiếu kỷ luật, trong khi số 9 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong phong cách làm việc (thực tế vs. lý tưởng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như từ thiện, truyền thông hoặc kinh doanh xã hội. Sự kết hợp giữa thực tế và nhân ái có thể dẫn đến những kết quả độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 22 thực tế và nhiệm vụ định hướng, số 9 lý tưởng và ý nghĩa định hướng. Số 22 cần tôn trọng ý tưởng của số 9, còn số 9 cần thực tế hơn. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 22 tập trung vào thực hiện và số 9 xử lý ý nghĩa. Số 22 cần khuyến khích ý tưởng của số 9, còn số 9 nên tôn trọng kế hoạch của số 22. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo tâm lý hoặc dự án cộng đồng có thể tăng sự gắn kết."
      }
    },
   {
      "partnerNumber": 11,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nMối quan hệ giữa số 22 (Nhà kiến tạo) và số 11 (Nhà truyền cảm hứng) là sự kết hợp giữa khả năng thực hiện và trực giác tinh thần. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 11 cung cấp sự nhạy bén, lý tưởng và khả năng truyền cảm hứng. Sự tương phản này có thể tạo ra một tình yêu cân bằng nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 22 mang lại sự ổn định và khả năng thực hiện, trong khi số 11 bổ sung bằng chiều sâu tinh thần và ý nghĩa. Họ có thể học hỏi lẫn nhau, với số 22 giúp số 11 thực tế hơn và số 11 khuyến khích số 22 hướng tới mục tiêu ý nghĩa. Sự kết hợp này có thể tạo ra một mối quan hệ phong phú nếu cả hai nỗ lực.",
        "weaknesses": "Số 22 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu thực tế, trong khi số 11 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong ưu tiên (thực tế vs. trực giác) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa thực tế và trực giác có thể tạo ra một tình yêu sâu sắc. Việc cùng tham gia các hoạt động tinh thần hoặc xây dựng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 11 cần trực giác. Số 22 cần cởi mở hơn với cảm xúc, còn số 11 cần thực tế hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động xây dựng như làm đồ thủ công hoặc tinh thần như thiền để tăng sự gắn kết. Số 22 cần cởi mở hơn với lý tưởng của số 11, còn số 11 nên tôn trọng kế hoạch của số 22. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tham gia dự án cộng đồng hoặc tổ chức bữa tối có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 22 (Nhà kiến tạo) và số 11 (Nhà truyền cảm hứng) mang đến sự kết hợp giữa khả năng thực hiện và trực giác tinh thần, nhưng đối mặt với thử thách do khác biệt trong phong cách sống. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 11 cung cấp sự nhạy bén, lý tưởng và khả năng truyền cảm hứng. Sự tương phản này có thể tạo ra một gia đình độc đáo nhưng cần nỗ lực để duy trì hòa hợp.",
        "strengths": "Số 22 tạo ra một môi trường gia đình ổn định và có tổ chức, trong khi số 11 mang lại chiều sâu tinh thần và ý nghĩa. Họ có thể bổ sung cho nhau, với số 22 giúp số 11 thực tế hơn và số 11 hỗ trợ số 22 hướng tới mục tiêu ý nghĩa. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 22 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu cam kết, trong khi số 11 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong ưu tiên (thực tế vs. trực giác) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa thực tế và trực giác có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động tinh thần sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 22 ưu tiên cấu trúc, số 11 cần trực giác. Số 22 cần chia sẻ cảm xúc, còn số 11 cần thực tế hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình tinh thần như thiền hoặc xây dựng như làm đồ thủ công để tăng sự gắn kết. Số 22 cần cởi mở hơn với lý tưởng, còn số 11 nên tham gia các mục tiêu gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia dự án cộng đồng hoặc tổ chức sự kiện gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 22 (Nhà kiến tạo) và số 11 (Nhà truyền cảm hứng) có thể hiệu quả trong các dự án cần sự cân bằng giữa thực tế và trực giác. Số 22 mang đến sự thực tế, tầm nhìn lớn và khả năng tổ chức, trong khi số 11 cung cấp sự nhạy bén, lý tưởng và khả năng truyền cảm hứng. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 22 mang lại sự tổ chức và khả năng thực hiện, trong khi số 11 đảm bảo chiều sâu tinh thần và ý nghĩa. Họ bổ sung cho nhau, với số 22 cung cấp cấu trúc và số 11 mang lại truyền cảm hứng. Khả năng học hỏi lẫn nhau giúp số 22 sâu sắc hơn và số 11 thực tế hơn.",
        "weaknesses": "Số 22 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu kỷ luật, trong khi số 11 có thể thấy số 22 quá cầu toàn hoặc thiếu cảm xúc. Sự khác biệt trong phong cách làm việc (thực tế vs. trực giác) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như từ thiện, truyền thông hoặc kinh doanh xã hội. Sự kết hợp giữa thực tế và trực giác có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 22 thực tế và nhiệm vụ định hướng, số 11 trực giác và lý tưởng định hướng. Số 22 cần tôn trọng ý tưởng của số 11, còn số 11 cần thực tế hơn. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 22 tập trung vào thực hiện và số 11 xử lý tầm nhìn. Số 22 cần khuyến khích ý tưởng của số 11, còn số 11 nên tôn trọng kế hoạch của số 22. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo sáng tạo hoặc dự án cộng đồng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa hai số 22 (Nhà kiến tạo) là sự kết hợp mạnh mẽ của sự thực tế và khả năng thực hiện. Cả hai đều mang tầm nhìn lớn, khả năng tổ chức vượt trội và khát vọng xây dựng giá trị lâu dài, tạo nên một tình yêu ổn định và định hướng mục tiêu. Sự tương đồng này giúp họ dễ dàng đồng điệu, nhưng có thể dẫn đến xung đột nếu cả hai quá cầu toàn.",
        "strengths": "Cả hai đều mang lại sự ổn định, khả năng thực hiện và tầm nhìn lớn, tạo ra một mối quan hệ ý nghĩa và định hướng mục tiêu. Họ giỏi hỗ trợ nhau trong các mục tiêu chung và tôn trọng sự thực tế của nhau. Sự tương đồng trong phong cách sống giúp họ tận hưởng thời gian bên nhau.",
        "weaknesses": "Cả hai có thể quá cầu toàn hoặc dễ bị áp lực, dẫn đến xung đột nếu không linh hoạt. Sự tương đồng trong tính cách thực tế có thể khiến mối quan hệ thiếu cảm xúc nếu không được cân bằng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu lâu dài nếu cả hai học cách linh hoạt hơn. Sự kết hợp giữa hai nhà kiến tạo có thể tạo ra một mối quan hệ thành công. Việc cùng tham gia các hoạt động xây dựng hoặc lập kế hoạch sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là xu hướng quá cầu toàn và thiếu cảm xúc. Cả hai cần học cách quản lý áp lực và cởi mở hơn với cảm xúc. Việc quá tập trung vào mục tiêu có thể khiến một bên cảm thấy bị bỏ rơi nếu không giao tiếp rõ ràng.",
        "suggestions": "Cả hai nên tham gia các hoạt động xây dựng như lập kế hoạch hoặc sáng tạo như làm đồ thủ công để tăng sự gắn kết. Cần bày tỏ cảm xúc và tổ chức các buổi trò chuyện định kỳ để chia sẻ mong muốn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tham gia dự án cộng đồng hoặc tổ chức bữa tối có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nHôn nhân giữa hai số 22 (Nhà kiến tạo) mang đến một gia đình ổn định và định hướng mục tiêu, nhưng cần nỗ lực để tránh quá cầu toàn. Cả hai đều mang tầm nhìn lớn, khả năng tổ chức vượt trội và khát vọng xây dựng giá trị lâu dài, tạo nên một mái ấm ý nghĩa. Sự tương đồng này giúp họ dễ dàng đồng điệu, nhưng cần sự cân bằng để duy trì hòa hợp.",
        "strengths": "Cả hai đều mang lại sự ổn định, khả năng thực hiện và tầm nhìn lớn, tạo ra một môi trường gia đình ý nghĩa và hỗ trợ. Họ giỏi hỗ trợ nhau trong các mục tiêu chung và tôn trọng sự thực tế của nhau. Sự tương đồng trong phong cách sống giúp họ xây dựng một gia đình gắn kết.",
        "weaknesses": "Cả hai có thể quá cầu toàn hoặc dễ bị áp lực, dẫn đến xung đột nếu không linh hoạt. Sự tương đồng trong tính cách thực tế có thể khiến việc quản lý gia đình trở nên căng thẳng nếu không có sự phân chia trách nhiệm rõ ràng.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ lý tưởng nếu cả hai học cách linh hoạt hơn. Sự kết hợp giữa hai nhà kiến tạo có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động xây dựng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là xu hướng quá cầu toàn và thiếu cảm xúc. Cả hai cần học cách quản lý áp lực và chia sẻ trách nhiệm gia đình. Việc quá tập trung vào mục tiêu có thể gây căng thẳng nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình xây dựng như lập kế hoạch tài chính hoặc làm đồ thủ công để tăng sự gắn kết. Cần phân chia trách nhiệm rõ ràng và tổ chức các buổi trò chuyện định kỳ để chia sẻ mong muốn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia dự án cộng đồng hoặc tổ chức sự kiện gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa hai số 22 (Nhà kiến tạo) là sự kết hợp mạnh mẽ của sự thực tế và khả năng thực hiện, lý tưởng cho các dự án xây dựng hoặc kinh doanh. Cả hai đều mang tầm nhìn lớn, khả năng tổ chức vượt trội và khát vọng xây dựng giá trị lâu dài, tạo nên một đội nhóm xuất sắc với mục tiêu rõ ràng. Sự tương đồng này giúp họ đồng điệu, nhưng cần sự linh hoạt để thành công.",
        "strengths": "Cả hai mang lại sự tổ chức, khả năng thực hiện và ý tưởng lớn, tạo ra một sự hợp tác ý nghĩa và định hướng mục tiêu. Họ giỏi hỗ trợ nhau trong các mục tiêu chung và tôn trọng sự thực tế của nhau. Sự tương đồng trong phong cách làm việc giúp họ dễ dàng phối hợp.",
        "weaknesses": "Cả hai có thể quá cầu toàn hoặc thiếu sáng tạo, dẫn đến khó khăn trong việc đổi mới nếu không linh hoạt. Sự tương đồng trong tính cách thực tế có thể khiến dự án bị trì hoãn nếu không có kế hoạch rõ ràng.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như xây dựng, kinh doanh hoặc quản lý dự án. Sự kết hợp giữa hai nhà kiến tạo có thể dẫn đến những kết quả độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là xu hướng quá cầu toàn và thiếu sáng tạo. Cả hai cần học cách lập kế hoạch và quản lý thời gian. Việc quá tập trung vào chi tiết có thể gây chậm trễ nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với một người tập trung vào tầm nhìn và người kia xử lý chi tiết thực tế. Cần tổ chức các buổi họp định kỳ để theo dõi tiến độ. Duy trì giao tiếp thường xuyên và tham gia các hoạt động như hội thảo kinh doanh hoặc dự án cộng đồng để tăng sự gắn kết."
      }
    }
  ]
}