{
  "number": 4,
  "description": "Số đường đời 4 đại diện cho sự ổn định, thực tế và kỷ luật. Những người mang số 4 thường đáng tin cậy, chăm chỉ, có khả năng xây dựng nền tảng vững chắc thông qua sự kiên trì và tổ chức. Họ trân trọng cấu trúc và trách nhiệm, nhưng có thể cứng nhắc hoặc thiếu linh hoạt nếu không được khuyến khích đổi mới.",
  "compatibility": [
    {
      "partnerNumber": 1,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 1 (Nhà lãnh đạo) là sự kết hợp giữa sự ổn định và tham vọng. Số 4 mang đến sự đáng tin cậy, kỷ luật và thực tế, trong khi số 1 cung cấp sự quyết đoán, sáng tạo và động lực. Sự tương tác này tạo nên một tình yêu ổn định nhưng có thể gặp thử thách nếu số 1 quá áp đảo.",
        "strengths": "Số 4 mang lại sự an toàn và nền tảng vững chắc, trong khi số 1 bổ sung bằng tầm nhìn và sự tự tin. Họ có thể hỗ trợ nhau, với số 4 giúp số 1 thực hiện kế hoạch và số 1 khuyến khích số 4 đổi mới. Sự kết hợp này có thể tạo ra một mối quan hệ cân bằng và hiệu quả.",
        "weaknesses": "Số 4 có thể cảm thấy số 1 quá kiểm soát hoặc thiếu kiên nhẫn, trong khi số 1 có thể thấy số 4 quá cứng nhắc hoặc chậm chạp. Sự khác biệt trong ưu tiên (cấu trúc vs. đổi mới) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa ổn định và lãnh đạo có thể tạo ra một tình yêu bền vững. Việc cùng lập kế hoạch hoặc tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 cần cấu trúc, số 1 hướng tới thay đổi. Số 4 cần cởi mở hơn với ý tưởng mới, còn số 1 cần tôn trọng kế hoạch của số 4. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động thực tế như lập kế hoạch tài chính hoặc cải tạo nhà cửa để tăng sự gắn kết. Số 4 cần bày tỏ nhu cầu rõ ràng, còn số 1 nên dành thời gian lắng nghe. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi dạo công viên hoặc làm đồ thủ công có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 1 (Nhà lãnh đạo) mang đến sự kết hợp giữa sự ổn định và động lực, tạo nên một gia đình vững chắc nhưng cần sự linh hoạt. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng xây dựng, trong khi số 1 cung cấp tầm nhìn, sự quyết đoán và động lực. Sự tương tác này có thể tạo ra một mái ấm bền vững nếu cả hai bổ sung cho nhau.",
        "strengths": "Số 4 tạo ra một môi trường gia đình an toàn và có tổ chức, trong khi số 1 mang lại sự đổi mới và định hướng. Họ bổ sung cho nhau, với số 4 giúp số 1 thực hiện mục tiêu và số 1 khuyến khích số 4 cởi mở hơn. Khả năng hỗ trợ lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 4 có thể cảm thấy số 1 quá áp đảo hoặc thiếu kiên nhẫn, trong khi số 1 có thể thấy số 4 quá cứng nhắc hoặc bảo thủ. Sự khác biệt trong ưu tiên (ổn định vs. đổi mới) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa ổn định và lãnh đạo có thể tạo ra một gia đình hạnh phúc và thành công. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 ưu tiên cấu trúc, số 1 cần thay đổi. Số 4 cần linh hoạt hơn, còn số 1 cần tôn trọng trách nhiệm gia đình của số 4. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình thực tế như cải tạo nhà cửa hoặc lập ngân sách để tăng sự gắn kết. Số 4 cần cởi mở hơn với ý tưởng mới, còn số 1 nên tham gia các nhiệm vụ gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các hoạt động như tham gia lớp học kỹ năng hoặc lập kế hoạch gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 1 (Nhà lãnh đạo) có thể rất hiệu quả nhờ sự kết hợp giữa sự ổn định và chiến lược. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng thực hiện, trong khi số 1 cung cấp tầm nhìn, sự quyết đoán và động lực. Sự tương tác này tạo nên một đội nhóm mạnh mẽ, với tiềm năng đạt kết quả ấn tượng.",
        "strengths": "Số 4 đảm bảo tiến độ và chất lượng bằng sự kỷ luật, trong khi số 1 dẫn dắt với tầm nhìn chiến lược. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 1 truyền cảm hứng đổi mới. Khả năng học hỏi lẫn nhau giúp số 4 sáng tạo hơn và số 1 tập trung hơn.",
        "weaknesses": "Số 4 có thể cảm thấy số 1 quá bốc đồng hoặc thiếu kiên nhẫn, trong khi số 1 có thể thấy số 4 quá cứng nhắc hoặc chậm chạp. Sự khác biệt trong phong cách làm việc (cấu trúc vs. đổi mới) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như quản lý dự án, kinh doanh hoặc xây dựng. Sự kết hợp giữa ổn định và chiến lược có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật và nhiệm vụ định hướng, số 1 sáng tạo và mục tiêu định hướng. Số 4 cần cởi mở với ý tưởng mới, còn số 1 cần tôn trọng kế hoạch. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 4 tập trung vào thực hiện và số 1 xử lý chiến lược. Số 4 cần khuyến khích ý tưởng của số 1, còn số 1 nên tôn trọng tiến độ của số 4. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo kinh doanh hoặc lập kế hoạch dự án có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 2 (Nhà ngoại giao) là sự kết hợp giữa sự ổn định và sự dịu dàng. Số 4 mang đến sự đáng tin cậy, kỷ luật và thực tế, trong khi số 2 cung cấp sự nhạy cảm, hỗ trợ và hòa giải. Sự tương tác này tạo nên một tình yêu ấm áp và bền vững, với sự hỗ trợ lẫn nhau mạnh mẽ.",
        "strengths": "Số 4 mang lại sự an toàn và cấu trúc, trong khi số 2 bổ sung bằng sự thấu hiểu và an toàn cảm xúc. Họ có thể hỗ trợ nhau, với số 4 cung cấp nền tảng vững chắc và số 2 giúp số 4 cởi mở hơn về cảm xúc. Sự kết hợp này tạo ra một mối quan hệ hài hòa và đáng tin cậy.",
        "weaknesses": "Số 4 có thể cảm thấy số 2 quá nhạy cảm hoặc thiếu quyết đoán, trong khi số 2 có thể thấy số 4 quá cứng nhắc hoặc khô khan. Sự khác biệt trong ưu tiên (cấu trúc vs. cảm xúc) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu sâu sắc nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa ổn định và hỗ trợ có thể tạo ra một mối quan hệ lâu dài. Việc cùng tham gia các hoạt động chăm sóc hoặc thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 cần cấu trúc, số 2 ưu tiên cảm xúc. Số 4 cần cởi mở hơn với cảm xúc, còn số 2 cần tự tin bày tỏ nhu cầu. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động chăm sóc như nấu ăn, làm vườn hoặc thực tế như lập kế hoạch tài chính để tăng sự gắn kết. Số 4 cần bày tỏ tình cảm rõ ràng, còn số 2 nên tự tin chia sẻ mong muốn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tổ chức bữa tối hoặc đi dạo công viên có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 2 (Nhà ngoại giao) mang đến sự kết hợp giữa sự ổn định và tình yêu thương, tạo nên một gia đình hài hòa. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng xây dựng, trong khi số 2 cung cấp sự chu đáo, hỗ trợ và hòa giải. Sự tương tác này giúp xây dựng một mái ấm vững chắc và ấm áp.",
        "strengths": "Số 4 tạo ra một môi trường gia đình an toàn và có tổ chức, trong khi số 2 mang lại sự yêu thương và an toàn cảm xúc. Họ bổ sung cho nhau, với số 4 cung cấp nền tảng và số 2 giúp số 4 cởi mở hơn về cảm xúc. Khả năng thấu hiểu và hỗ trợ lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 4 có thể cảm thấy số 2 quá phụ thuộc hoặc thiếu quyết đoán, trong khi số 2 có thể thấy số 4 quá cứng nhắc hoặc thiếu tình cảm. Sự khác biệt trong ưu tiên (ổn định vs. cảm xúc) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ lý tưởng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa ổn định và chăm sóc có thể tạo ra một gia đình hạnh phúc và bền vững. Việc cùng xây dựng mục tiêu gia đình sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 ưu tiên cấu trúc, số 2 cần cảm xúc. Số 4 cần cởi mở hơn với cảm xúc, còn số 2 cần tự tin chia sẻ trách nhiệm. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình chăm sóc như làm vườn hoặc nấu ăn để tăng sự gắn kết. Số 4 cần thể hiện tình cảm nhiều hơn, còn số 2 nên tham gia các nhiệm vụ gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia từ thiện hoặc lập kế hoạch gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 2 (Nhà ngoại giao) có thể rất hiệu quả nhờ sự kết hợp giữa sự ổn định và ngoại giao. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng thực hiện, trong khi số 2 cung cấp kỹ năng ngoại giao, sự hỗ trợ và khả năng xây dựng mối quan hệ. Sự tương tác này tạo nên một đội nhóm hài hòa, với tiềm năng đạt kết quả lớn.",
        "strengths": "Số 4 đảm bảo tiến độ và chất lượng bằng sự kỷ luật, trong khi số 2 hỗ trợ bằng cách xây dựng mối quan hệ và duy trì hòa khí. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 2 truyền cảm hứng hợp tác. Khả năng học hỏi lẫn nhau giúp số 4 linh hoạt hơn và số 2 quyết đoán hơn.",
        "weaknesses": "Số 4 có thể cảm thấy số 2 quá nhạy cảm hoặc thiếu quyết đoán, trong khi số 2 có thể thấy số 4 quá cứng nhắc hoặc khô khan. Sự khác biệt trong phong cách làm việc (cấu trúc vs. người định hướng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như quản lý dự án, dịch vụ cộng đồng hoặc kinh doanh. Sự kết hợp giữa ổn định và ngoại giao có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật và nhiệm vụ định hướng, số 2 cẩn thận và người định hướng. Số 4 cần cởi mở với ý kiến của số 2, còn số 2 cần tự tin đóng góp ý tưởng. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 4 tập trung vào thực hiện và số 2 xử lý quan hệ đối ngoại. Số 4 cần khuyến khích ý kiến của số 2, còn số 2 nên tự tin đóng góp ý tưởng. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo đội nhóm hoặc dự án cộng đồng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 60,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 3 (Nhà sáng tạo) là sự kết hợp giữa sự ổn định và năng lượng sáng tạo. Số 4 mang đến sự đáng tin cậy, kỷ luật và thực tế, trong khi số 3 cung cấp sự lạc quan, biểu đạt và niềm vui. Sự tương phản này có thể hấp dẫn nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 4 mang lại sự an toàn và cấu trúc, trong khi số 3 bổ sung bằng sự vui tươi và khả năng truyền cảm hứng. Họ có thể học hỏi lẫn nhau, với số 4 giúp số 3 tập trung hơn và số 3 làm sáng cuộc sống của số 4. Sự kết hợp này có thể tạo ra một mối quan hệ cân bằng nếu cả hai nỗ lực.",
        "weaknesses": "Số 4 có thể cảm thấy số 3 quá phóng khoáng hoặc thiếu trách nhiệm, trong khi số 3 có thể thấy số 4 quá cứng nhắc hoặc thiếu sáng tạo. Sự khác biệt trong ưu tiên (cấu trúc vs. tự do) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa ổn định và sáng tạo có thể tạo ra một tình yêu phong phú. Việc cùng tham gia các hoạt động thực tế hoặc sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 cần cấu trúc, số 3 hướng tới tự do. Số 4 cần cởi mở hơn với ý tưởng mới, còn số 3 cần cam kết hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động kết hợp sáng tạo và thực tế như làm đồ thủ công hoặc lập kế hoạch du lịch để tăng sự gắn kết. Số 4 cần bày tỏ sự linh hoạt, còn số 3 nên tôn trọng kế hoạch của số 4. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như làm gốm hoặc đi công viên có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 3 (Nhà sáng tạo) đối mặt với thử thách do sự khác biệt trong phong cách sống. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng xây dựng, trong khi số 3 cung cấp sự lạc quan, sáng tạo và niềm vui. Sự tương phản này có thể tạo ra một gia đình độc đáo nhưng cần nỗ lực lớn để duy trì hòa hợp.",
        "strengths": "Số 4 tạo ra một môi trường gia đình an toàn và có tổ chức, trong khi số 3 mang lại sự vui tươi và năng lượng tích cực. Họ có thể bổ sung cho nhau, với số 4 giúp số 3 trách nhiệm hơn và số 3 làm sáng cuộc sống của số 4. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 4 có thể cảm thấy số 3 quá phóng khoáng hoặc thiếu trách nhiệm, trong khi số 3 có thể thấy số 4 quá cứng nhắc hoặc nghiêm túc. Sự khác biệt trong ưu tiên (ổn định vs. tự do) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa ổn định và sáng tạo có thể tạo ra một gia đình năng động. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 ưu tiên cấu trúc, số 3 cần tự do. Số 4 cần linh hoạt hơn, còn số 3 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình thực tế như cải tạo nhà cửa hoặc lập ngân sách để tăng sự gắn kết. Số 4 cần tham gia các hoạt động sáng tạo, còn số 3 nên cam kết hơn với trách nhiệm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các hoạt động như làm đồ thủ công hoặc tham gia lớp học kỹ năng có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 3 (Nhà sáng tạo) có thể hiệu quả trong các dự án cần sự cân bằng giữa thực tế và ý tưởng. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng thực hiện, trong khi số 3 cung cấp sự lạc quan, sáng tạo và khả năng thu hút. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 4 đảm bảo tiến độ và chất lượng bằng sự kỷ luật, trong khi số 3 mang lại ý tưởng mới mẻ và năng lượng tích cực. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 3 truyền cảm hứng. Khả năng học hỏi lẫn nhau giúp số 4 sáng tạo hơn và số 3 tập trung hơn.",
        "weaknesses": "Số 4 có thể cảm thấy số 3 quá phân tán hoặc thiếu kỷ luật, trong khi số 3 có thể thấy số 4 quá cứng nhắc hoặc thiếu linh hoạt. Sự khác biệt trong phong cách làm việc (cấu trúc vs. tự do) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như thiết kế hoặc quản lý dự án sáng tạo. Sự kết hợp giữa ổn định và sáng tạo có thể dẫn đến những kết quả ấn tượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật và nhiệm vụ định hướng, số 3 tự do và ý tưởng định hướng. Số 4 cần cởi mở với ý tưởng mới, còn số 3 cần tôn trọng kế hoạch. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 4 tập trung vào thực hiện và số 3 xử lý sáng tạo. Số 4 cần khuyến khích ý tưởng của số 3, còn số 3 nên tôn trọng tiến độ của số 4. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo thiết kế hoặc brain-storming có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa hai số 4 (Nhà xây dựng) là sự kết hợp của sự ổn định và kỷ luật. Cả hai đều đáng tin cậy, chăm chỉ và trân trọng cấu trúc, tạo nên một tình yêu vững chắc và an toàn. Sự tương đồng này giúp họ dễ dàng đồng điệu, nhưng cả hai cần tránh sự cứng nhắc để duy trì sự tươi mới.",
        "strengths": "Cả hai đều mang lại sự an toàn và khả năng xây dựng nền tảng vững chắc, tạo ra một mối quan hệ đáng tin cậy. Họ giỏi lập kế hoạch, chia sẻ trách nhiệm và hỗ trợ lẫn nhau trong mục tiêu chung. Sự tương đồng trong giá trị giúp họ xây dựng một tình yêu bền vững.",
        "weaknesses": "Cả hai có thể quá cứng nhắc hoặc bảo thủ, dẫn đến việc thiếu linh hoạt hoặc sáng tạo. Sự thiếu đổi mới có thể khiến mối quan hệ trở nên đơn điệu nếu không có sự nỗ lực làm mới. Việc quá tập trung vào trách nhiệm có thể làm giảm niềm vui.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu lâu dài nếu cả hai học cách linh hoạt hơn. Sự kết hợp giữa hai nhà xây dựng có thể tạo ra một mối quan hệ ổn định và thành công. Việc cùng tham gia các hoạt động sáng tạo sẽ giúp họ giữ được sự tươi mới.",
        "challenges": "Thách thức chính là sự thiếu linh hoạt và xu hướng bảo thủ. Cả hai cần học cách cởi mở với ý tưởng mới và thư giãn hơn. Việc quá tập trung vào trách nhiệm có thể khiến một bên cảm thấy bị áp lực nếu không giao tiếp rõ ràng.",
        "suggestions": "Cả hai nên tham gia các hoạt động sáng tạo như làm đồ thủ công hoặc du lịch để tăng sự gắn kết. Cần lập kế hoạch chung nhưng cũng dành thời gian thư giãn. Duy trì giao tiếp cởi mở, tổ chức các buổi trò chuyện định kỳ để chia sẻ mong muốn. Các buổi hẹn hò như đi công viên hoặc thử thách mới có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nHôn nhân giữa hai số 4 (Nhà xây dựng) mang đến một gia đình ổn định, có tổ chức và đáng tin cậy. Cả hai đều chăm chỉ, kỷ luật và trân trọng trách nhiệm, tạo nên một mái ấm vững chắc. Sự tương đồng này giúp họ dễ dàng phối hợp, nhưng cả hai cần tránh sự cứng nhắc để duy trì sự cân bằng.",
        "strengths": "Cả hai đều mang lại sự an toàn và khả năng xây dựng nền tảng vững chắc, tạo ra một môi trường gia đình đáng tin cậy. Họ giỏi chia sẻ trách nhiệm, lập kế hoạch và hỗ trợ lẫn nhau trong mục tiêu gia đình. Sự tương đồng trong giá trị giúp họ xây dựng một gia đình bền vững và thành công.",
        "weaknesses": "Cả hai có thể quá cứng nhắc hoặc bảo thủ, dẫn đến sự thiếu linh hoạt hoặc sáng tạo. Sự thiếu đổi mới có thể khiến gia đình trở nên đơn điệu nếu không có sự nỗ lực làm mới. Việc quá tập trung vào trách nhiệm có thể làm giảm niềm vui.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ lý tưởng nếu cả hai học cách linh hoạt hơn. Sự kết hợp giữa hai nhà xây dựng có thể tạo ra một gia đình hạnh phúc và ổn định. Việc cùng tham gia các hoạt động sáng tạo hoặc thư giãn sẽ giúp họ giữ được sự tươi mới.",
        "challenges": "Thách thức chính là sự thiếu linh hoạt và xu hướng bảo thủ. Cả hai cần học cách cởi mở với ý tưởng mới và thư giãn hơn. Việc quá tập trung vào trách nhiệm có thể khiến gia đình thiếu niềm vui nếu không giao tiếp rõ ràng.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình sáng tạo như cải tạo nhà cửa hoặc làm đồ thủ công để tăng sự gắn kết. Cần lập kế hoạch chung nhưng cũng dành thời gian thư giãn. Duy trì giao tiếp cởi mở, tổ chức các buổi trò chuyện định kỳ để chia sẻ trách nhiệm. Các hoạt động như tham gia lớp học kỹ năng hoặc đi du lịch có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa hai số 4 (Nhà xây dựng) có thể rất hiệu quả nhờ sự tương đồng về sự ổn định và kỷ luật. Cả hai đều đáng tin cậy, chăm chỉ và trân trọng cấu trúc, tạo nên một đội nhóm mạnh mẽ và hiệu quả. Tuy nhiên, họ cần một người sáng tạo để tránh sự đơn điệu.",
        "strengths": "Cả hai đều mang lại sự kỷ luật và khả năng thực hiện, giúp đội nhóm đạt được kết quả chất lượng cao. Họ giỏi phối hợp trong các dự án cần sự ổn định, như xây dựng hoặc quản lý. Sự tương đồng trong phong cách làm việc giúp họ dễ dàng đồng điệu.",
        "weaknesses": "Cả hai có thể quá cứng nhắc hoặc bảo thủ, dẫn đến việc thiếu sáng tạo hoặc đổi mới. Sự thiếu linh hoạt có thể khiến dự án thiếu sự thu hút nếu không có sự hỗ trợ từ bên ngoài. Việc quá tập trung vào nhiệm vụ có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như xây dựng, quản lý hoặc kinh doanh. Sự kết hợp giữa hai nhà xây dựng có thể dẫn đến những kết quả bền vững. Việc tìm sự hỗ trợ từ một người sáng tạo sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự thiếu linh hoạt và xu hướng bảo thủ. Cả hai cần học cách cởi mở với ý tưởng mới và thư giãn hơn. Việc quá tập trung vào nhiệm vụ có thể khiến một bên cảm thấy bị áp lực nếu không có sự phối hợp.",
        "suggestions": "Cả hai nên tìm một người sáng tạo hoặc phân chia vai trò rõ ràng để đảm bảo đổi mới. Tham gia các buổi họp định kỳ để đưa ra quyết định và tổ chức ý tưởng. Cần tôn trọng kế hoạch của nhau và duy trì giao tiếp cởi mở. Các hoạt động như tham gia hội thảo quản lý hoặc lập kế hoạch dự án có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 5 (Nhà phiêu lưu) là sự kết hợp giữa sự ổn định và tinh thần tự do. Số 4 mang đến sự đáng tin cậy, kỷ luật và thực tế, trong khi số 5 cung cấp sự linh hoạt, năng lượng và tinh thần khám phá. Sự tương phản này có thể hấp dẫn nhưng khó duy trì do khác biệt lớn trong ưu tiên.",
        "strengths": "Số 4 mang lại sự an toàn và cấu trúc, trong khi số 5 bổ sung bằng sự táo bạo và năng lượng tích cực. Họ có thể học hỏi lẫn nhau, với số 4 giúp số 5 tập trung hơn và số 5 khuyến khích số 4 cởi mở hơn. Sự kết hợp này có thể tạo ra một mối quan hệ năng động nếu cả hai nỗ lực.",
        "weaknesses": "Số 4 có thể cảm thấy số 5 quá bốc đồng hoặc thiếu trách nhiệm, trong khi số 5 có thể thấy số 4 quá cứng nhắc hoặc nhàm chán. Sự khác biệt trong ưu tiên (cấu trúc vs. tự do) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa ổn định và phiêu lưu có thể tạo ra một tình yêu độc đáo. Việc cùng tham gia các hoạt động thực tế hoặc phiêu lưu sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 cần cấu trúc, số 5 hướng tới thay đổi. Số 4 cần cởi mở hơn với trải nghiệm mới, còn số 5 cần cam kết hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động phiêu lưu như du lịch hoặc thực tế như lập kế hoạch để tăng sự gắn kết. Số 4 cần bày tỏ sự linh hoạt, còn số 5 nên tôn trọng kế hoạch của số 4. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như khám phá thành phố hoặc làm đồ thủ công có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 50,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 5 (Nhà phiêu lưu) đối mặt với nhiều thử thách do sự khác biệt trong phong cách sống. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng xây dựng, trong khi số 5 cung cấp sự linh hoạt, năng lượng và tinh thần khám phá. Sự tương phản này có thể tạo ra một gia đình năng động nhưng cần nỗ lực lớn để duy trì hòa hợp.",
        "strengths": "Số 4 tạo ra một môi trường gia đình an toàn và có tổ chức, trong khi số 5 mang lại sự táo bạo và năng lượng tích cực. Họ có thể bổ sung cho nhau, với số 4 giúp số 5 trách nhiệm hơn và số 5 khuyến khích số 4 cởi mở hơn. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 4 có thể cảm thấy số 5 quá bốc đồng hoặc thiếu cam kết, trong khi số 5 có thể thấy số 4 quá cứng nhắc hoặc nhàm chán. Sự khác biệt trong ưu tiên (ổn định vs. tự do) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa ổn định và phiêu lưu có thể tạo ra một gia đình độc đáo. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 ưu tiên cấu trúc, số 5 cần thay đổi. Số 4 cần linh hoạt hơn, còn số 5 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình năng động như đi du lịch hoặc thực tế như lập ngân sách để tăng sự gắn kết. Số 4 cần tham gia các hoạt động phiêu lưu, còn số 5 nên cam kết hơn với trách nhiệm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các hoạt động như cắm trại hoặc tham gia lớp học phiêu lưu có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 5 (Nhà phiêu lưu) có thể hiệu quả trong các dự án cần sự cân bằng giữa thực tế và đổi mới. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng thực hiện, trong khi số 5 cung cấp sự linh hoạt, táo bạo và tinh thần khám phá. Sự tương phản này tạo nên một đội nhóm năng động, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 4 đảm bảo tiến độ và chất lượng bằng sự kỷ luật, trong khi số 5 mang lại ý tưởng mới mẻ và năng lượng tích cực. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 5 truyền cảm hứng đổi mới. Khả năng học hỏi lẫn nhau giúp số 4 linh hoạt hơn và số 5 tập trung hơn.",
        "weaknesses": "Số 4 có thể cảm thấy số 5 quá bốc đồng hoặc thiếu kỷ luật, trong khi số 5 có thể thấy số 4 quá cứng nhắc hoặc nhàm chán. Sự khác biệt trong phong cách làm việc (cấu trúc vs. tự do) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như du lịch, truyền thông hoặc quản lý sự kiện. Sự kết hợp giữa ổn định và đổi mới có thể dẫn đến những kết quả độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật và nhiệm vụ định hướng, số 5 tự do và ý tưởng định hướng. Số 4 cần cởi mở với ý tưởng mới, còn số 5 cần tôn trọng kế hoạch. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 4 tập trung vào thực hiện và số 5 xử lý đổi mới. Số 4 cần khuyến khích ý tưởng của số 5, còn số 5 nên tôn trọng tiến độ của số 4. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo sáng tạo hoặc lập kế hoạch dự án có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 6 (Nhà chăm sóc) là sự kết hợp giữa sự ổn định và tình yêu thương. Số 4 mang đến sự đáng tin cậy, kỷ luật và thực tế, trong khi số 6 cung cấp sự chu đáo, trách nhiệm và tình cảm sâu sắc. Sự tương đồng về trách nhiệm tạo nên một tình yêu ấm áp và bền vững.",
        "strengths": "Số 4 mang lại sự an toàn và cấu trúc, trong khi số 6 bổ sung bằng sự thấu hiểu và an toàn cảm xúc. Họ có thể hỗ trợ nhau, với số 4 cung cấp nền tảng vững chắc và số 6 giúp số 4 cởi mở hơn về cảm xúc. Sự kết hợp này tạo ra một mối quan hệ hài hòa và đáng tin cậy.",
        "weaknesses": "Số 4 có thể cảm thấy số 6 quá kiểm soát hoặc nhạy cảm, trong khi số 6 có thể thấy số 4 quá cứng nhắc hoặc khô khan. Sự khác biệt trong ưu tiên (cấu trúc vs. cảm xúc) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu sâu sắc nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa ổn định và chăm sóc có thể tạo ra một mối quan hệ lâu dài. Việc cùng tham gia các hoạt động chăm sóc hoặc thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 cần cấu trúc, số 6 ưu tiên cảm xúc. Số 4 cần cởi mở hơn với cảm xúc, còn số 6 cần tự tin bày tỏ nhu cầu. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động chăm sóc như nấu ăn, làm vườn hoặc thực tế như lập kế hoạch tài chính để tăng sự gắn kết. Số 4 cần bày tỏ tình cảm rõ ràng, còn số 6 nên tự tin chia sẻ mong muốn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tổ chức bữa tối hoặc đi công viên có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 6 (Nhà chăm sóc) mang đến sự kết hợp giữa sự ổn định và trách nhiệm, tạo nên một gia đình hài hòa. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng xây dựng, trong khi số 6 cung cấp sự chu đáo, tình yêu thương và hòa giải. Sự tương đồng này giúp xây dựng một mái ấm vững chắc và ấm áp.",
        "strengths": "Số 4 tạo ra một môi trường gia đình an toàn và có tổ chức, trong khi số 6 mang lại sự yêu thương và an toàn cảm xúc. Họ bổ sung cho nhau, với số 4 cung cấp nền tảng và số 6 giúp số 4 cởi mở hơn về cảm xúc. Khả năng thấu hiểu và hỗ trợ lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 4 có thể cảm thấy số 6 quá kiểm soát hoặc nhạy cảm, trong khi số 6 có thể thấy số 4 quá cứng nhắc hoặc thiếu tình cảm. Sự khác biệt trong ưu tiên (ổn định vs. cảm xúc) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ lý tưởng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa ổn định và chăm sóc có thể tạo ra một gia đình hạnh phúc và bền vững. Việc cùng xây dựng mục tiêu gia đình sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 ưu tiên cấu trúc, số 6 cần cảm xúc. Số 4 cần cởi mở hơn với cảm xúc, còn số 6 cần tự tin chia sẻ trách nhiệm. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình chăm sóc như làm vườn hoặc nấu ăn để tăng sự gắn kết. Số 4 cần thể hiện tình cảm nhiều hơn, còn số 6 nên tham gia các nhiệm vụ gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia từ thiện hoặc lập kế hoạch gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 6 (Nhà chăm sóc) có thể rất hiệu quả nhờ sự kết hợp giữa sự ổn định và chăm sóc. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng thực hiện, trong khi số 6 cung cấp sự chu đáo, trách nhiệm và khả năng xây dựng mối quan hệ. Sự tương đồng này tạo nên một đội nhóm thân thiện, với tiềm năng đạt kết quả lớn.",
        "strengths": "Số 4 đảm bảo tiến độ và chất lượng bằng sự kỷ luật, trong khi số 6 hỗ trợ bằng cách xây dựng mối quan hệ và duy trì hòa khí. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 6 truyền cảm hứng hợp tác. Khả năng học hỏi lẫn nhau giúp số 4 linh hoạt hơn và số 6 quyết đoán hơn.",
        "weaknesses": "Số 4 có thể cảm thấy số 6 quá nhạy cảm hoặc kiểm soát, trong khi số 6 có thể thấy số 4 quá cứng nhắc hoặc khô khan. Sự khác biệt trong phong cách làm việc (cấu trúc vs. người định hướng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như giáo dục, dịch vụ cộng đồng hoặc quản lý dự án. Sự kết hợp giữa ổn định và chăm sóc có thể dẫn đến những kết quả ý nghĩa. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật và nhiệm vụ định hướng, số 6 cẩn thận và người định hướng. Số 4 cần cởi mở với ý kiến của số 6, còn số 6 cần tự tin đóng góp ý tưởng. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 4 tập trung vào thực hiện và số 6 xử lý quan hệ đối ngoại. Số 4 cần khuyến khích ý kiến của số 6, còn số 6 nên tự tin đóng góp ý tưởng. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia dự án cộng đồng hoặc hội thảo đội nhóm có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 7 (Nhà hiền triết) là sự kết hợp giữa sự ổn định và sự suy ngẫm. Số 4 mang đến sự đáng tin cậy, kỷ luật và thực tế, trong khi số 7 cung cấp sự sâu sắc, nội tâm và tri thức. Sự tương phản này có thể tạo ra một tình yêu ý nghĩa nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 4 mang lại sự an toàn và cấu trúc, trong khi số 7 bổ sung bằng sự sâu sắc và tư duy triết học. Họ có thể học hỏi lẫn nhau, với số 4 giúp số 7 thực tế hơn và số 7 khuyến khích số 4 suy ngẫm sâu hơn. Sự kết hợp này có thể tạo ra những cuộc trò chuyện ý nghĩa.",
        "weaknesses": "Số 4 có thể cảm thấy số 7 quá xa cách hoặc thiếu thực tế, trong khi số 7 có thể thấy số 4 quá cứng nhắc hoặc thiếu chiều sâu. Sự khác biệt trong ưu tiên (cấu trúc vs. tinh thần) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa ổn định và suy ngẫm có thể tạo ra một tình yêu độc đáo. Việc cùng tham gia các hoạt động tinh thần hoặc thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 cần cấu trúc, số 7 ưu tiên nội tâm. Số 4 cần cởi mở hơn với suy ngẫm, còn số 7 cần cam kết hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động tinh thần như thiền, đọc sách hoặc thực tế như lập kế hoạch để tăng sự gắn kết. Số 4 cần bày tỏ sự linh hoạt, còn số 7 nên dành thời gian lắng nghe. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi bảo tàng hoặc trò chuyện sâu sắc có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 7 (Nhà hiền triết) mang đến sự kết hợp giữa sự ổn định và chiều sâu tinh thần, nhưng đối mặt với thử thách do khác biệt trong phong cách sống. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng xây dựng, trong khi số 7 cung cấp sự sâu sắc, nội tâm và tri thức. Sự tương phản này có thể tạo ra một gia đình độc đáo nếu cả hai nỗ lực.",
        "strengths": "Số 4 tạo ra một môi trường gia đình an toàn và có tổ chức, trong khi số 7 mang lại sự sâu sắc và tư duy logic. Họ có thể bổ sung cho nhau, với số 4 giúp số 7 thực tế hơn và số 7 khuyến khích số 4 suy ngẫm sâu hơn. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 4 có thể cảm thấy số 7 quá xa cách hoặc thiếu cam kết, trong khi số 7 có thể thấy số 4 quá cứng nhắc hoặc thiếu chiều sâu. Sự khác biệt trong ưu tiên (ổn định vs. tinh thần) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa ổn định và suy ngẫm có thể tạo ra một gia đình ý nghĩa. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 ưu tiên cấu trúc, số 7 cần nội tâm. Số 4 cần cởi mở hơn với suy ngẫm, còn số 7 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình tinh thần như đọc sách hoặc thiền để tăng sự gắn kết. Số 4 cần tham gia các hoạt động suy ngẫm, còn số 7 nên cam kết hơn với trách nhiệm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học triết học hoặc lập kế hoạch gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 7 (Nhà hiền triết) có thể hiệu quả trong các dự án cần sự cân bằng giữa thực tế và phân tích sâu sắc. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng thực hiện, trong khi số 7 cung cấp sự sâu sắc, tri thức và tư duy logic. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 4 đảm bảo tiến độ và chất lượng bằng sự kỷ luật, trong khi số 7 mang lại phân tích sâu sắc và tư duy sáng tạo. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 7 truyền cảm hứng suy ngẫm. Khả năng học hỏi lẫn nhau giúp số 4 linh hoạt hơn và số 7 thực tế hơn.",
        "weaknesses": "Số 4 có thể cảm thấy số 7 quá chậm chạp hoặc xa cách, trong khi số 7 có thể thấy số 4 quá cứng nhắc hoặc thiếu chiều sâu. Sự khác biệt trong phong cách làm việc (cấu trúc vs. phân tích) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghiên cứu, tư vấn hoặc quản lý dự án. Sự kết hợp giữa ổn định và phân tích có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật và nhiệm vụ định hướng, số 7 độc lập và phân tích định hướng. Số 4 cần cởi mở với ý kiến của số 7, còn số 7 cần tôn trọng kế hoạch. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 4 tập trung vào thực hiện và số 7 xử lý phân tích. Số 4 cần khuyến khích ý kiến của số 7, còn số 7 nên tôn trọng tiến độ của số 4. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo nghiên cứu hoặc brain-storming có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 8 (Nhà quyền lực) là sự kết hợp giữa sự ổn định và tham vọng. Số 4 mang đến sự đáng tin cậy, kỷ luật và thực tế, trong khi số 8 cung cấp sự quyết đoán, tham vọng và định hướng thành công. Sự tương đồng về mục tiêu tạo nên một tình yêu ổn định, nhưng có thể gặp thử thách nếu số 8 quá kiểm soát.",
        "strengths": "Số 4 mang lại sự an toàn và khả năng thực hiện, trong khi số 8 bổ sung bằng sự tự tin và tầm nhìn chiến lược. Họ có thể hỗ trợ nhau, với số 4 giúp số 8 thực hiện kế hoạch và số 8 khuyến khích số 4 đặt mục tiêu lớn hơn. Sự kết hợp này có thể tạo ra một mối quan hệ hiệu quả và đầy động lực.",
        "weaknesses": "Số 4 có thể cảm thấy số 8 quá áp đảo hoặc kiểm soát, trong khi số 8 có thể thấy số 4 quá cứng nhắc hoặc thiếu tham vọng. Sự khác biệt trong phong cách (cấu trúc vs. mục tiêu) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa ổn định và lãnh đạo có thể tạo ra một tình yêu bền vững. Việc cùng lập kế hoạch hoặc tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 cần cấu trúc, số 8 hướng tới thành công. Số 4 cần cởi mở hơn với tham vọng, còn số 8 cần tôn trọng kế hoạch của số 4. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động lập kế hoạch như quản lý tài chính hoặc tổ chức sự kiện để tăng sự gắn kết. Số 4 cần bày tỏ sự linh hoạt, còn số 8 nên dành thời gian lắng nghe. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi du lịch hoặc tổ chức bữa tối có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 8 (Nhà quyền lực) mang đến sự kết hợp giữa sự ổn định và tham vọng, tạo nên một gia đình vững chắc nhưng cần sự cân bằng. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng xây dựng, trong khi số 8 cung cấp sự quyết đoán, tham vọng và ổn định tài chính. Sự tương đồng về mục tiêu giúp họ xây dựng một mái ấm thành công.",
        "strengths": "Số 4 tạo ra một môi trường gia đình an toàn và có tổ chức, trong khi số 8 mang lại sự tự tin và khả năng lãnh đạo. Họ bổ sung cho nhau, với số 4 giúp số 8 thực hiện mục tiêu và số 8 khuyến khích số 4 đặt mục tiêu lớn hơn. Khả năng hỗ trợ lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 4 có thể cảm thấy số 8 quá kiểm soát hoặc nghiêm túc, trong khi số 8 có thể thấy số 4 quá cứng nhắc hoặc thiếu tham vọng. Sự khác biệt trong ưu tiên (ổn định vs. sự nghiệp) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa ổn định và lãnh đạo có thể tạo ra một gia đình hạnh phúc và thành công. Việc cùng xây dựng mục tiêu gia đình sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 ưu tiên cấu trúc, số 8 tập trung vào mục tiêu. Số 4 cần cởi mở hơn với tham vọng, còn số 8 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình thực tế như lập kế hoạch tài chính hoặc cải tạo nhà cửa để tăng sự gắn kết. Số 4 cần tham gia các mục tiêu lớn, còn số 8 nên thể hiện sự quan tâm đến gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học kỹ năng hoặc tổ chức sự kiện gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 8 (Nhà quyền lực) có thể rất hiệu quả nhờ sự kết hợp giữa sự ổn định và chiến lược. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng thực hiện, trong khi số 8 cung cấp sự quyết đoán, tham vọng và tầm nhìn chiến lược. Sự tương đồng về mục tiêu tạo nên một đội nhóm mạnh mẽ, với tiềm năng đạt kết quả lớn.",
        "strengths": "Số 4 đảm bảo tiến độ và chất lượng bằng sự kỷ luật, trong khi số 8 dẫn dắt với tầm nhìn chiến lược. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 8 truyền cảm hứng tham vọng. Khả năng học hỏi lẫn nhau giúp số 4 đặt mục tiêu lớn hơn và số 8 thực tế hơn.",
        "weaknesses": "Số 4 có thể cảm thấy số 8 quá kiểm soát hoặc bốc đồng, trong khi số 8 có thể thấy số 4 quá cứng nhắc hoặc chậm chạp. Sự khác biệt trong phong cách làm việc (cấu trúc vs. mục tiêu) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như kinh doanh, quản lý dự án hoặc tài chính. Sự kết hợp giữa ổn định và chiến lược có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật và nhiệm vụ định hướng, số 8 tham vọng và mục tiêu định hướng. Số 4 cần cởi mở với ý tưởng mới, còn số 8 cần tôn trọng kế hoạch. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 4 tập trung vào thực hiện và số 8 xử lý chiến lược. Số 4 cần khuyến khích ý tưởng của số 8, còn số 8 nên tôn trọng tiến độ của số 4. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo kinh doanh hoặc lập kế hoạch dự án có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 9 (Nhà nhân đạo) là sự kết hợp giữa sự ổn định và lòng nhân ái. Số 4 mang đến sự đáng tin cậy, kỷ luật và thực tế, trong khi số 9 cung cấp sự lý tưởng, nhân ái và khả năng truyền cảm hứng. Sự tương phản này có thể tạo ra một tình yêu ý nghĩa nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 4 mang lại sự an toàn và cấu trúc, trong khi số 9 bổ sung bằng sự nhiệt huyết và tầm nhìn lớn. Họ có thể học hỏi lẫn nhau, với số 4 giúp số 9 thực tế hơn và số 9 khuyến khích số 4 hướng tới mục tiêu lớn. Sự kết hợp này có thể tạo ra một mối quan hệ phong phú nếu cả hai nỗ lực.",
        "weaknesses": "Số 4 có thể cảm thấy số 9 quá lý tưởng hoặc thiếu thực tế, trong khi số 9 có thể thấy số 4 quá cứng nhắc hoặc thiếu cảm hứng. Sự khác biệt trong ưu tiên (cấu trúc vs. lý tưởng) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa ổn định và nhân ái có thể tạo ra một tình yêu sâu sắc. Việc cùng tham gia các hoạt động cộng đồng hoặc thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 cần cấu trúc, số 9 hướng tới lý tưởng. Số 4 cần cởi mở hơn với cảm hứng, còn số 9 cần cam kết hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động cộng đồng như tình nguyện hoặc thực tế như lập kế hoạch để tăng sự gắn kết. Số 4 cần bày tỏ sự linh hoạt, còn số 9 nên tôn trọng kế hoạch của số 4. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tham gia sự kiện xã hội hoặc trò chuyện sâu sắc có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 9 (Nhà nhân đạo) mang đến sự kết hợp giữa sự ổn định và lòng nhân ái, tạo nên một gia đình ý nghĩa nhưng cần sự cân bằng. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng xây dựng, trong khi số 9 cung cấp sự lý tưởng, nhân ái và tầm nhìn lớn. Sự tương phản này có thể tạo ra một mái ấm phong phú nếu cả hai bổ sung cho nhau.",
        "strengths": "Số 4 tạo ra một môi trường gia đình an toàn và có tổ chức, trong khi số 9 mang lại sự nhiệt huyết và mục tiêu lớn. Họ bổ sung cho nhau, với số 4 giúp số 9 thực tế hơn và số 9 khuyến khích số 4 hướng tới ý nghĩa lớn. Khả năng hỗ trợ lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 4 có thể cảm thấy số 9 quá lý tưởng hoặc bỏ qua gia đình, trong khi số 9 có thể thấy số 4 quá cứng nhắc hoặc thiếu cảm hứng. Sự khác biệt trong ưu tiên (ổn định vs. lý tưởng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa ổn định và nhân ái có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 ưu tiên cấu trúc, số 9 cần lý tưởng. Số 4 cần cởi mở hơn với cảm hứng, còn số 9 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình ý nghĩa như tham gia từ thiện hoặc lập kế hoạch cộng đồng để tăng sự gắn kết. Số 4 cần tham gia các mục tiêu lớn, còn số 9 nên thể hiện sự quan tâm đến gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia dự án xã hội hoặc trò chuyện về mục tiêu có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 9 (Nhà nhân đạo) có thể hiệu quả trong các dự án cần sự cân bằng giữa thực tế và lý tưởng. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng thực hiện, trong khi số 9 cung cấp sự lý tưởng, nhân ái và tầm nhìn lớn. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 4 đảm bảo tiến độ và chất lượng bằng sự kỷ luật, trong khi số 9 mang lại tầm nhìn lớn và nhiệt huyết. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 9 truyền cảm hứng lý tưởng. Khả năng học hỏi lẫn nhau giúp số 4 hướng tới mục tiêu lớn hơn và số 9 thực tế hơn.",
        "weaknesses": "Số 4 có thể cảm thấy số 9 quá lý tưởng hoặc thiếu kỷ luật, trong khi số 9 có thể thấy số 4 quá cứng nhắc hoặc thiếu cảm hứng. Sự khác biệt trong phong cách làm việc (cấu trúc vs. lý tưởng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như từ thiện, giáo dục hoặc dự án cộng đồng. Sự kết hợp giữa ổn định và nhân ái có thể dẫn đến những kết quả ý nghĩa. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật và nhiệm vụ định hướng, số 9 lý tưởng và mục tiêu định hướng. Số 4 cần cởi mở với ý tưởng mới, còn số 9 cần tôn trọng kế hoạch. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 4 tập trung vào thực hiện và số 9 xử lý tầm nhìn. Số 4 cần khuyến khích ý tưởng của số 9, còn số 9 nên tôn trọng tiến độ của số 4. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia dự án xã hội hoặc hội thảo cộng đồng có thể tăng sự gắn kết."
      }
    },
   {
      "partnerNumber": 11,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 60,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 11 (Nhà truyền cảm hứng) là sự kết hợp giữa sự ổn định và trực giác tinh thần. Số 4 mang đến sự đáng tin cậy, kỷ luật và thực tế, trong khi số 11 cung cấp sự trực giác, lý tưởng và khả năng truyền cảm hứng. Sự tương phản này có thể tạo ra một tình yêu độc đáo nhưng khó duy trì do khác biệt lớn trong ưu tiên.",
        "strengths": "Số 4 mang lại sự an toàn và cấu trúc, trong khi số 11 bổ sung bằng sự trực giác và tầm nhìn tinh thần. Họ có thể học hỏi lẫn nhau, với số 4 giúp số 11 thực tế hơn và số 11 khuyến khích số 4 khám phá chiều sâu tinh thần. Sự kết hợp này có thể tạo ra một mối quan hệ phong phú nếu cả hai nỗ lực.",
        "weaknesses": "Số 4 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu thực tế, trong khi số 11 có thể thấy số 4 quá cứng nhắc hoặc thiếu cảm hứng. Sự khác biệt trong ưu tiên (cấu trúc vs. tinh thần) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa ổn định và truyền cảm hứng có thể tạo ra một tình yêu sâu sắc. Việc cùng tham gia các hoạt động tinh thần hoặc thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 cần cấu trúc, số 11 hướng tới trực giác. Số 4 cần cởi mở hơn với suy ngẫm, còn số 11 cần cam kết hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động tinh thần như thiền, yoga hoặc thực tế như lập kế hoạch để tăng sự gắn kết. Số 4 cần bày tỏ sự linh hoạt, còn số 11 nên tôn trọng kế hoạch của số 4. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như viết nhật ký chung hoặc tham gia hội thảo tâm lý có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 11 (Nhà truyền cảm hứng) mang đến sự kết hợp giữa sự ổn định và trực giác tinh thần, nhưng đối mặt với thử thách do khác biệt lớn trong phong cách sống. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng xây dựng, trong khi số 11 cung cấp sự trực giác, lý tưởng và tầm nhìn tinh thần. Sự tương phản này có thể tạo ra một gia đình độc đáo nếu cả hai nỗ lực.",
        "strengths": "Số 4 tạo ra một môi trường gia đình an toàn và có tổ chức, trong khi số 11 mang lại sự trực giác và chiều sâu tinh thần. Họ có thể bổ sung cho nhau, với số 4 giúp số 11 thực tế hơn và số 11 khuyến khích số 4 khám phá tinh thần. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 4 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu cam kết, trong khi số 11 có thể thấy số 4 quá cứng nhắc hoặc thiếu cảm hứng. Sự khác biệt trong ưu tiên (ổn định vs. tinh thần) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa ổn định và truyền cảm hứng có thể tạo ra một gia đình ý nghĩa. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 ưu tiên cấu trúc, số 11 cần trực giác. Số 4 cần cởi mở hơn với suy ngẫm, còn số 11 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình tinh thần như thiền hoặc yoga để tăng sự gắn kết. Số 4 cần tham gia các hoạt động suy ngẫm, còn số 11 nên cam kết hơn với trách nhiệm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như viết nhật ký chung hoặc tham gia hội thảo tâm lý có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 11 (Nhà truyền cảm hứng) có thể hiệu quả trong các dự án cần sự cân bằng giữa thực tế và trực giác. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng thực hiện, trong khi số 11 cung cấp sự trực giác, lý tưởng và khả năng truyền cảm hứng. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 4 đảm bảo tiến độ và chất lượng bằng sự kỷ luật, trong khi số 11 mang lại trực giác và tầm nhìn lớn. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 11 truyền cảm hứng lý tưởng. Khả năng học hỏi lẫn nhau giúp số 4 hướng tới mục tiêu lớn hơn và số 11 thực tế hơn.",
        "weaknesses": "Số 4 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu kỷ luật, trong khi số 11 có thể thấy số 4 quá cứng nhắc hoặc thiếu cảm hứng. Sự khác biệt trong phong cách làm việc (cấu trúc vs. trực giác) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như tư vấn, giáo dục hoặc dự án sáng tạo. Sự kết hợp giữa ổn định và trực giác có thể dẫn đến những kết quả ý nghĩa. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật và nhiệm vụ định hướng, số 11 trực giác và ý tưởng định hướng. Số 4 cần cởi mở với ý tưởng mới, còn số 11 cần tôn trọng kế hoạch. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 4 tập trung vào thực hiện và số 11 xử lý sáng tạo. Số 4 cần khuyến khích ý tưởng của số 11, còn số 11 nên tôn trọng tiến độ của số 4. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo sáng tạo hoặc lập kế hoạch dự án có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 4 (Nhà xây dựng) và số 22 (Nhà kiến tạo vĩ đại) là sự kết hợp mạnh mẽ giữa sự ổn định và tham vọng lớn. Số 4 mang đến sự đáng tin cậy, kỷ luật và thực tế, trong khi số 22 cung cấp sự thực tế, tầm nhìn chiến lược và khả năng hiện thực hóa ý tưởng lớn. Sự tương đồng về tính kỷ luật giúp họ xây dựng một tình yêu vững chắc và đầy triển vọng.",
        "strengths": "Số 4 mang lại sự an toàn và cấu trúc, trong khi số 22 bổ sung bằng sự tham vọng và khả năng thực hiện vượt trội. Họ hỗ trợ nhau, với số 4 cung cấp nền tảng vững chắc và số 22 khuyến khích số 4 hướng tới mục tiêu lớn hơn. Sự kết hợp này tạo ra một mối quan hệ ổn định và hiệu quả.",
        "weaknesses": "Số 4 có thể cảm thấy số 22 quá áp đảo hoặc tham vọng, trong khi số 22 có thể thấy số 4 quá bảo thủ hoặc thiếu tầm nhìn. Sự khác biệt trong mức độ tham vọng (ổn định vs. vĩ đại) có thể gây căng thẳng nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu lâu dài nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa ổn định và tham vọng có thể tạo ra một mối quan hệ thành công và ý nghĩa. Việc cùng tham gia các dự án thực tế hoặc lập kế hoạch sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 ưu tiên cấu trúc an toàn, số 22 hướng tới mục tiêu lớn. Số 4 cần cởi mở hơn với tham vọng, còn số 22 cần tôn trọng nhịp độ của số 4. Những bất đồng nhỏ có thể leo thang nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên tham gia các hoạt động thực tế như lập kế hoạch tài chính, cải tạo nhà cửa hoặc các dự án lớn để tăng sự gắn kết. Số 4 cần bày tỏ sự linh hoạt, còn số 22 nên dành thời gian lắng nghe. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tham gia hội thảo kỹ năng hoặc làm việc chung trên một dự án có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nHôn nhân giữa số 4 (Nhà xây dựng) và số 22 (Nhà kiến tạo vĩ đại) mang đến sự kết hợp tuyệt vời giữa sự ổn định và tham vọng lớn, tạo nên một gia đình vững chắc và thành công. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng xây dựng, trong khi số 22 cung cấp sự thực tế, tầm nhìn chiến lược và khả năng hiện thực hóa mục tiêu lớn. Sự tương đồng về tính kỷ luật giúp họ xây dựng một mái ấm bền vững.",
        "strengths": "Số 4 tạo ra một môi trường gia đình an toàn và có tổ chức, trong khi số 22 mang lại tham vọng và khả năng lãnh đạo. Họ bổ sung cho nhau, với số 4 cung cấp nền tảng và số 22 khuyến khích số 4 đặt mục tiêu lớn hơn. Khả năng hỗ trợ lẫn nhau và cùng hướng tới thành công là điểm mạnh lớn.",
        "weaknesses": "Số 4 có thể cảm thấy số 22 quá áp đảo hoặc tập trung vào mục tiêu, trong khi số 22 có thể thấy số 4 quá cứng nhắc hoặc thiếu tham vọng. Sự khác biệt trong ưu tiên (ổn định vs. vĩ đại) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ lý tưởng nếu cả hai học cách cân bằng. Sự kết hợp giữa ổn định và tham vọng có thể tạo ra một gia đình hạnh phúc và thành công. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các dự án lớn sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 4 ưu tiên cấu trúc an toàn, số 22 cần mục tiêu lớn. Số 4 cần cởi mở hơn với tham vọng, còn số 22 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình thực tế như lập kế hoạch tài chính hoặc cải tạo nhà cửa để tăng sự gắn kết. Số 4 cần tham gia các mục tiêu lớn, còn số 22 nên thể hiện sự quan tâm đến gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học kỹ năng hoặc làm việc chung trên một dự án có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nSự hợp tác giữa số 4 (Nhà xây dựng) và số 22 (Nhà kiến tạo vĩ đại) là một trong những kết hợp mạnh mẽ trong thần số học, nhờ sự tương đồng về tính kỷ luật và khả năng thực hiện. Số 4 mang đến sự đáng tin cậy, kỷ luật và khả năng xây dựng nền tảng, trong khi số 22 cung cấp sự thực tế, tầm nhìn chiến lược và khả năng hiện thực hóa ý tưởng lớn. Sự kết hợp này tạo nên một đội nhóm xuất sắc, với tiềm năng đạt được những kết quả vượt trội.",
        "strengths": "Số 4 đảm bảo tiến độ và chất lượng bằng sự kỷ luật, trong khi số 22 dẫn dắt với tầm nhìn chiến lược và tham vọng. Họ bổ sung cho nhau, với số 4 mang lại cấu trúc và số 22 truyền cảm hứng cho các mục tiêu lớn. Sự tương đồng về tính thực tế giúp họ phối hợp hiệu quả trong các dự án lớn.",
        "weaknesses": "Số 4 có thể cảm thấy số 22 quá tham vọng hoặc áp đảo, trong khi số 22 có thể thấy số 4 quá bảo thủ hoặc chậm chạp. Sự khác biệt trong mức độ tham vọng (ổn định vs. vĩ đại) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như xây dựng, kinh doanh, kiến trúc hoặc quản lý dự án. Sự kết hợp giữa ổn định và tham vọng có thể dẫn đến những thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 4 kỷ luật và nhiệm vụ định hướng, số 22 tham vọng và mục tiêu định hướng. Số 4 cần cởi mở với ý tưởng lớn, còn số 22 cần tôn trọng tiến độ của số 4. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 4 tập trung vào thực hiện và số 22 xử lý chiến lược. Số 4 cần khuyến khích ý tưởng của số 22, còn số 22 nên tôn trọng kế hoạch của số 4. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo kinh doanh hoặc lập kế hoạch dự án có thể tăng sự gắn kết."
      }
    }
  ]
}