{
  "number": 3,
  "description": "Số đường đời 3 đại diện cho sự sáng tạo, lạc quan và biểu đạt. Những người mang số 3 thường vui tươi, giàu năng lượng, có khả năng truyền cảm hứng qua nghệ thuật, lời nói hoặc hành động. Họ yêu tự do, thích khám phá và thể hiện bản thân, nhưng có thể thiếu tập trung hoặc quá phóng khoáng nếu không được định hướng.",
  "compatibility": [
    {
      "partnerNumber": 1,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 1 (Nhà lãnh đạo) là sự kết hợp giữa năng lượng sáng tạo và tham vọng. Số 3 mang đến sự lạc quan, biểu đạt và niềm vui, trong khi số 1 cung cấp sự quyết đoán, định hướng và động lực. Sự tương tác này tạo nên một tình yêu sôi động, nhưng có thể gặp thử thách do sự khác biệt trong ưu tiên.",
        "strengths": "Số 3 mang lại sự vui tươi và khả năng truyền cảm hứng, trong khi số 1 bổ sung bằng tầm nhìn và sự tự tin. Họ có thể thúc đẩy nhau, với số 3 làm sáng cuộc sống của số 1 và số 1 giúp số 3 tập trung hơn. Sự kết hợp này tạo ra những khoảnh khắc đáng nhớ và đầy năng lượng.",
        "weaknesses": "Số 3 có thể cảm thấy số 1 quá kiểm soát hoặc thiếu linh hoạt, trong khi số 1 có thể thấy số 3 quá phóng khoáng hoặc thiếu trách nhiệm. Sự khác biệt trong cách tiếp cận (tự do vs. mục tiêu) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa sáng tạo và lãnh đạo có thể tạo ra một tình yêu phong phú. Việc cùng tham gia các hoạt động sáng tạo hoặc lập kế hoạch sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong ưu tiên: số 3 cần tự do biểu đạt, số 1 tập trung vào mục tiêu. Số 3 cần cam kết hơn, còn số 1 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động sáng tạo như vẽ tranh, âm nhạc hoặc tổ chức sự kiện để tăng sự gắn kết. Số 3 cần bày tỏ nhu cầu rõ ràng, còn số 1 nên dành thời gian lắng nghe. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi xem biểu diễn nghệ thuật hoặc du lịch có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 1 (Nhà lãnh đạo) mang đến sự kết hợp giữa sự vui tươi và tham vọng, tạo nên một gia đình năng động nhưng cần sự cân bằng. Số 3 mang đến sự lạc quan, sáng tạo và niềm vui, trong khi số 1 cung cấp sự ổn định, định hướng và động lực. Sự tương phản này có thể tạo ra một mái ấm phong phú nếu cả hai tôn trọng lẫn nhau.",
        "strengths": "Số 3 làm sáng không khí gia đình bằng sự sáng tạo và năng lượng, trong khi số 1 mang lại tầm nhìn và sự bảo vệ. Họ bổ sung cho nhau, với số 3 giúp số 1 thư giãn hơn và số 1 khuyến khích số 3 trách nhiệm hơn. Khả năng truyền cảm hứng lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 3 có thể cảm thấy số 1 quá nghiêm túc hoặc kiểm soát, trong khi số 1 có thể thấy số 3 thiếu trách nhiệm hoặc quá phóng khoáng. Sự khác biệt trong ưu tiên (gia đình vs. sự nghiệp) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa sáng tạo và lãnh đạo có thể tạo ra một gia đình hạnh phúc và thành công. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên tự do, số 1 tập trung vào mục tiêu. Số 3 cần chia sẻ trách nhiệm gia đình, còn số 1 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình sáng tạo như trang trí nhà cửa hoặc đi du lịch để tăng sự gắn kết. Số 3 cần cam kết hơn với trách nhiệm, còn số 1 nên thể hiện sự vui tươi. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi trò chuyện định kỳ về mục tiêu gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 1 (Nhà lãnh đạo) có thể rất hiệu quả nhờ sự kết hợp giữa ý tưởng sáng tạo và chiến lược. Số 3 mang đến sự lạc quan, sáng tạo và khả năng thu hút, trong khi số 1 cung cấp tầm nhìn, sự quyết đoán và định hướng. Sự tương tác này tạo nên một đội nhóm năng động, với tiềm năng đạt kết quả ấn tượng.",
        "strengths": "Số 3 mang lại ý tưởng mới mẻ và năng lượng tích cực, trong khi số 1 dẫn dắt với chiến lược và động lực. Họ bổ sung cho nhau, với số 3 truyền cảm hứng và số 1 đảm bảo tiến độ. Khả năng học hỏi lẫn nhau giúp số 3 tập trung hơn và số 1 sáng tạo hơn.",
        "weaknesses": "Số 3 có thể cảm thấy số 1 quá kiểm soát hoặc thiếu linh hoạt, trong khi số 1 có thể thấy số 3 thiếu kỷ luật hoặc phân tán. Sự khác biệt trong phong cách làm việc (tự do vs. cấu trúc) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như truyền thông, nghệ thuật hoặc kinh doanh sáng tạo. Sự kết hợp giữa sáng tạo và chiến lược có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 tự do và ý tưởng định hướng, số 1 kỷ luật và mục tiêu định hướng. Số 3 cần tôn trọng kế hoạch, còn số 1 cần cởi mở với ý tưởng. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 3 tập trung vào sáng tạo và số 1 xử lý chiến lược. Số 3 cần cam kết với kế hoạch, còn số 1 nên khuyến khích ý tưởng của số 3. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp sáng tạo. Các hoạt động như brain-storming hoặc tham gia hội thảo nghệ thuật có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 2 (Nhà ngoại giao) là sự kết hợp giữa năng lượng sáng tạo và sự dịu dàng. Số 3 mang đến sự lạc quan, biểu đạt và niềm vui, trong khi số 2 cung cấp sự nhạy cảm, hỗ trợ và hòa giải. Sự tương tác này tạo nên một tình yêu sôi động nhưng có thể thử thách do sự khác biệt trong ưu tiên.",
        "strengths": "Số 3 mang lại sự vui tươi và khả năng truyền cảm hứng, trong khi số 2 bổ sung bằng sự thấu hiểu và an toàn cảm xúc. Họ có thể tạo ra những khoảnh khắc đáng nhớ, với số 3 làm sáng cuộc sống của số 2 và số 2 giúp số 3 ổn định hơn. Khả năng học hỏi lẫn nhau giúp số 3 kiên nhẫn hơn và số 2 tự tin hơn.",
        "weaknesses": "Số 3 có thể cảm thấy số 2 quá nhạy cảm hoặc phụ thuộc, trong khi số 2 có thể thấy số 3 quá phóng khoáng hoặc thiếu tập trung. Sự khác biệt trong ưu tiên (trải nghiệm vs. cảm xúc) có thể gây hiểu lầm nếu không được giải quyết.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách chấp nhận sự khác biệt. Sự kết hợp giữa sáng tạo và hỗ trợ có thể tạo ra một tình yêu phong phú. Việc cùng tham gia các hoạt động sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 hướng tới niềm vui và trải nghiệm, số 2 ưu tiên cảm xúc. Số 3 cần tôn trọng cảm xúc của số 2, còn số 2 cần tự tin bày tỏ nhu cầu. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động sáng tạo như vẽ tranh, âm nhạc hoặc du lịch để tăng sự gắn kết. Số 3 nên dành thời gian lắng nghe số 2, còn số 2 cần bày tỏ mong muốn rõ ràng. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi công viên hoặc tham gia lớp học nghệ thuật có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 2 (Nhà ngoại giao) mang đến sự kết hợp giữa sự vui tươi và sự chu đáo, tạo nên một gia đình sôi động nhưng cần nỗ lực để duy trì hòa hợp. Số 3 mang đến sự lạc quan, sáng tạo và niềm vui, trong khi số 2 cung cấp tình yêu thương, sự chăm sóc và hòa giải. Sự tương phản này có thể tạo ra một mái ấm phong phú nếu cả hai bổ sung cho nhau.",
        "strengths": "Số 3 làm sáng không khí gia đình bằng sự sáng tạo và năng lượng, trong khi số 2 tạo ra một môi trường ấm áp và hỗ trợ. Họ bổ sung cho nhau, với số 3 mang lại sự mới mẻ và số 2 giúp số 3 ổn định hơn. Khả năng truyền cảm hứng và thấu hiểu lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 3 có thể cảm thấy số 2 quá phụ thuộc hoặc nhạy cảm, trong khi số 2 có thể thấy số 3 thiếu trách nhiệm hoặc quá phóng khoáng. Sự khác biệt trong ưu tiên (trải nghiệm vs. gia đình) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa sáng tạo và chăm sóc có thể tạo ra một gia đình hạnh phúc và đa dạng. Việc cùng tham gia các hoạt động sáng tạo hoặc lập kế hoạch chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên tự do, số 2 cần cảm xúc. Số 3 cần chia sẻ trách nhiệm gia đình, còn số 2 cần tự tin bày tỏ nhu cầu. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình sáng tạo như trang trí nhà cửa hoặc đi du lịch để tăng sự gắn kết. Số 3 cần cam kết hơn với trách nhiệm, còn số 2 nên bày tỏ mong muốn rõ ràng. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi trò chuyện định kỳ về mục tiêu gia đình hoặc tham gia lớp học sáng tạo có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 2 (Nhà ngoại giao) có thể hiệu quả trong các dự án sáng tạo, nhờ sự kết hợp giữa ý tưởng mới mẻ và sự tinh tế. Số 3 mang đến sự lạc quan, sáng tạo và khả năng thu hút, trong khi số 2 cung cấp kỹ năng ngoại giao, sự hỗ trợ và khả năng xây dựng mối quan hệ. Sự tương tác này tạo nên một đội nhóm năng động, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 3 mang lại ý tưởng sáng tạo và năng lượng tích cực, trong khi số 2 hỗ trợ bằng cách xây dựng mối quan hệ và duy trì hòa khí. Họ bổ sung cho nhau, với số 3 truyền cảm hứng và số 2 đảm bảo sự ổn định. Khả năng học hỏi lẫn nhau giúp số 3 tập trung hơn và số 2 tự tin hơn.",
        "weaknesses": "Số 3 có thể cảm thấy số 2 quá chậm chạp hoặc nhạy cảm, trong khi số 2 có thể thấy số 3 thiếu kỷ luật hoặc quá phân tán. Sự khác biệt trong phong cách làm việc (tự do vs. cẩn thận) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghệ thuật, truyền thông hoặc sự kiện. Sự kết hợp giữa sáng tạo và ngoại giao có thể dẫn đến những dự án độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 tự do và ý tưởng định hướng, số 2 cẩn thận và người định hướng. Số 3 cần tôn trọng kế hoạch, còn số 2 cần tự tin đóng góp ý kiến. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 3 tập trung vào sáng tạo và số 2 xử lý quan hệ đối ngoại. Số 3 cần cam kết với kế hoạch, còn số 2 nên chủ động bày tỏ quan điểm. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp sáng tạo. Các hoạt động như brain-storming hoặc tham gia hội thảo nghệ thuật có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nMối quan hệ giữa hai số 3 (Nhà sáng tạo) là sự kết hợp của sự lạc quan, sáng tạo và niềm vui. Cả hai đều yêu tự do, biểu đạt và thích khám phá, tạo nên một tình yêu sôi động và đầy màu sắc. Sự tương đồng này giúp họ dễ dàng kết nối, nhưng cả hai cần tránh thiếu tập trung để duy trì sự ổn định.",
        "strengths": "Cả hai đều có năng lượng tích cực và khả năng truyền cảm hứng, tạo ra một mối quan hệ vui tươi và sáng tạo. Họ giỏi chia sẻ ý tưởng, tổ chức các hoạt động thú vị và thúc đẩy nhau phát triển. Sự tương đồng trong giá trị giúp họ xây dựng một tình yêu đầy cảm hứng và đáng nhớ.",
        "weaknesses": "Cả hai có thể quá phóng khoáng, dẫn đến việc thiếu trách nhiệm hoặc khó cam kết lâu dài. Sự thiếu tập trung của cả hai có thể khiến mối quan hệ thiếu định hướng nếu không có sự tổ chức. Việc cạnh tranh biểu đạt có thể gây căng thẳng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu rực rỡ nếu cả hai học cách tổ chức và cam kết. Sự kết hợp của hai nhà sáng tạo có thể tạo ra một mối quan hệ phong phú và độc đáo. Việc cùng đặt mục tiêu và hỗ trợ nhau sẽ giúp họ tiến xa.",
        "challenges": "Thách thức chính là sự thiếu tập trung và xu hướng tránh trách nhiệm. Cả hai cần học cách lập kế hoạch và cam kết với nhau. Việc cạnh tranh biểu đạt có thể khiến một bên cảm thấy bị lu mờ nếu không giao tiếp rõ ràng.",
        "suggestions": "Cả hai nên tham gia các hoạt động sáng tạo như viết lách, âm nhạc hoặc tổ chức sự kiện để tăng sự gắn kết. Cần lập kế hoạch chung để duy trì định hướng. Duy trì giao tiếp cởi mở, tổ chức các buổi trò chuyện định kỳ để chia sẻ mong muốn. Các buổi hẹn hò như xem biểu diễn nghệ thuật hoặc thử thách sáng tạo có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa hai số 3 (Nhà sáng tạo) mang đến một gia đình sôi động, đầy sáng tạo, nhưng có thể thiếu sự ổn định. Cả hai đều yêu tự do, biểu đạt và thích khám phá, tạo nên một mái ấm vui tươi. Tuy nhiên, sự tương đồng này cần được cân bằng bằng trách nhiệm để duy trì sự hài hòa.",
        "strengths": "Cả hai đều mang lại năng lượng tích cực và khả năng sáng tạo, tạo ra một môi trường gia đình đầy màu sắc. Họ giỏi chia sẻ ý tưởng, tổ chức các hoạt động thú vị và thúc đẩy nhau phát triển. Sự tương đồng trong giá trị giúp họ xây dựng một gia đình độc đáo và đáng nhớ.",
        "weaknesses": "Cả hai có thể thiếu trách nhiệm hoặc khó cam kết với các nghĩa vụ gia đình, dẫn đến sự bất ổn. Sự thiếu tập trung có thể khiến gia đình thiếu cấu trúc nếu không có kế hoạch rõ ràng. Việc cạnh tranh biểu đạt có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách tổ chức và chia sẻ trách nhiệm. Sự kết hợp giữa hai nhà sáng tạo có thể tạo ra một gia đình phong phú và năng động. Việc cùng lập kế hoạch và hỗ trợ nhau sẽ giúp họ phát triển.",
        "challenges": "Thách thức chính là sự thiếu tập trung và xu hướng tránh trách nhiệm. Cả hai cần học cách lập kế hoạch và cam kết với gia đình. Việc cạnh tranh biểu đạt có thể khiến một bên cảm thấy bị lu mờ nếu không giao tiếp rõ ràng.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình sáng tạo như trang trí nhà cửa hoặc tổ chức sự kiện để tăng sự gắn kết. Cần lập kế hoạch chung để duy trì cấu trúc. Duy trì giao tiếp cởi mở, tổ chức các buổi trò chuyện định kỳ để chia sẻ trách nhiệm. Các hoạt động như tham gia lớp học sáng tạo hoặc đi du lịch có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa hai số 3 (Nhà sáng tạo) có thể rất hiệu quả trong các dự án sáng tạo nhờ sự tương đồng về năng lượng và ý tưởng. Cả hai đều mang đến sự lạc quan, sáng tạo và khả năng thu hút, tạo nên một đội nhóm sôi động và đầy cảm hứng. Tuy nhiên, họ cần một người định hướng để đạt kết quả lớn.",
        "strengths": "Cả hai đều có khả năng tạo ra ý tưởng mới mẻ và truyền cảm hứng, giúp đội nhóm nổi bật trong các dự án sáng tạo. Họ giỏi phối hợp trong các hoạt động như nghệ thuật, truyền thông hoặc sự kiện. Sự tương đồng trong phong cách làm việc giúp họ dễ dàng đồng điệu.",
        "weaknesses": "Cả hai có thể thiếu kỷ luật hoặc phân tán, dẫn đến việc trì hoãn các quyết định quan trọng. Sự thiếu tập trung có thể khiến dự án thiếu cấu trúc nếu không có sự lãnh đạo. Việc cạnh tranh ý tưởng có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghệ thuật, quảng cáo hoặc giải trí. Sự kết hợp giữa hai nhà sáng tạo có thể dẫn đến những kết quả độc đáo. Việc tìm sự hỗ trợ từ một người định hướng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự thiếu tập trung và xu hướng phân tán. Cả hai cần học cách lập kế hoạch và tuân thủ tiến độ. Việc cạnh tranh ý tưởng có thể khiến một bên cảm thấy bị lu mờ nếu không có sự phối hợp.",
        "suggestions": "Cả hai nên tìm một người định hướng hoặc phân chia vai trò rõ ràng để đảm bảo tiến độ. Tham gia các buổi họp định kỳ để đưa ra quyết định và tổ chức ý tưởng. Cần tôn trọng ý tưởng của nhau và duy trì giao tiếp cởi mở. Các hoạt động như brain-storming hoặc tham gia hội thảo sáng tạo có thể tăng sự gắn kết."
      }
    },

 {
      "partnerNumber": 4,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 60,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 4 (Nhà xây dựng) là sự kết hợp giữa năng lượng sáng tạo và tính thực tế. Số 3 mang đến sự lạc quan, biểu đạt và niềm vui, trong khi số 4 cung cấp sự ổn định, kỷ luật và cấu trúc. Sự tương phản này có thể hấp dẫn nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 3 mang lại sự vui tươi và khả năng truyền cảm hứng, trong khi số 4 bổ sung bằng sự đáng tin cậy và khả năng thực hiện. Họ có thể học hỏi lẫn nhau, với số 3 làm sáng cuộc sống của số 4 và số 4 giúp số 3 tập trung hơn. Sự kết hợp này có thể tạo ra một mối quan hệ cân bằng nếu cả hai nỗ lực.",
        "weaknesses": "Số 3 có thể cảm thấy số 4 quá cứng nhắc hoặc thiếu sáng tạo, trong khi số 4 có thể thấy số 3 quá phóng khoáng hoặc thiếu trách nhiệm. Sự khác biệt trong ưu tiên (tự do vs. cấu trúc) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa sáng tạo và thực tế có thể tạo ra một tình yêu ổn định và phong phú. Việc cùng tham gia các hoạt động thực tế hoặc sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 cần tự do biểu đạt, số 4 ưu tiên cấu trúc. Số 3 cần cam kết hơn, còn số 4 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động kết hợp sáng tạo và thực tế như làm đồ thủ công hoặc lập kế hoạch du lịch để tăng sự gắn kết. Số 3 cần bày tỏ nhu cầu rõ ràng, còn số 4 nên cởi mở hơn với ý tưởng mới. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như làm gốm hoặc đi dạo công viên có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 4 (Nhà xây dựng) đối mặt với thử thách do sự khác biệt trong phong cách sống. Số 3 mang đến sự lạc quan, sáng tạo và niềm vui, trong khi số 4 cung cấp sự ổn định, kỷ luật và khả năng xây dựng nền tảng. Sự tương phản này có thể tạo ra một gia đình độc đáo nhưng cần nỗ lực lớn để duy trì hòa hợp.",
        "strengths": "Số 3 làm sáng không khí gia đình bằng năng lượng tích cực, trong khi số 4 mang lại sự ổn định và cấu trúc. Họ có thể bổ sung cho nhau, với số 3 mang lại sự mới mẻ và số 4 giúp số 3 trách nhiệm hơn. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 3 có thể cảm thấy số 4 quá nghiêm túc hoặc kiểm soát, trong khi số 4 có thể thấy số 3 thiếu trách nhiệm hoặc quá phóng khoáng. Sự khác biệt trong ưu tiên (trải nghiệm vs. ổn định) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa sáng tạo và thực tế có thể tạo ra một gia đình năng động và ổn định. Việc cùng lập kế hoạch chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên tự do, số 4 cần cấu trúc. Số 3 cần chia sẻ trách nhiệm gia đình, còn số 4 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình thực tế như cải tạo nhà cửa hoặc lập ngân sách để tăng sự gắn kết. Số 3 cần cam kết hơn với trách nhiệm, còn số 4 nên tham gia các hoạt động sáng tạo. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các hoạt động như làm đồ thủ công hoặc tham gia lớp học kỹ năng có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 4 (Nhà xây dựng) có thể hiệu quả trong các dự án cần sự cân bằng giữa ý tưởng và thực tế. Số 3 mang đến sự lạc quan, sáng tạo và khả năng thu hút, trong khi số 4 cung cấp sự kỷ luật, thực tế và khả năng thực hiện. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 3 mang lại ý tưởng mới mẻ và năng lượng tích cực, trong khi số 4 đảm bảo tiến độ và cấu trúc. Họ bổ sung cho nhau, với số 3 truyền cảm hứng và số 4 mang lại sự ổn định. Khả năng học hỏi lẫn nhau giúp số 3 tập trung hơn và số 4 sáng tạo hơn.",
        "weaknesses": "Số 3 có thể cảm thấy số 4 quá cứng nhắc hoặc thiếu linh hoạt, trong khi số 4 có thể thấy số 3 thiếu kỷ luật hoặc phân tán. Sự khác biệt trong phong cách làm việc (tự do vs. cấu trúc) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như thiết kế hoặc quản lý dự án sáng tạo. Sự kết hợp giữa sáng tạo và thực tế có thể dẫn đến những kết quả ấn tượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 tự do và ý tưởng định hướng, số 4 kỷ luật và nhiệm vụ định hướng. Số 3 cần tôn trọng kế hoạch, còn số 4 cần cởi mở với ý tưởng. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 3 tập trung vào sáng tạo và số 4 xử lý thực hiện. Số 3 cần cam kết với tiến độ, còn số 4 nên khuyến khích ý tưởng của số 3. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như brain-storming hoặc tham gia hội thảo thiết kế có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 5 (Nhà phiêu lưu) là sự kết hợp của sự sáng tạo và tinh thần tự do. Số 3 mang đến sự lạc quan, biểu đạt và niềm vui, trong khi số 5 cung cấp sự linh hoạt, năng lượng và tinh thần khám phá. Sự tương đồng này tạo nên một tình yêu sôi động và đầy màu sắc, nhưng cần cam kết để duy trì lâu dài.",
        "strengths": "Cả hai đều yêu tự do và trải nghiệm, tạo ra một mối quan hệ đầy năng lượng và cảm hứng. Số 3 mang lại sự sáng tạo, trong khi số 5 bổ sung bằng sự táo bạo và tinh thần phiêu lưu. Họ có thể cùng nhau khám phá thế giới, thúc đẩy nhau phát triển và tạo ra những kỷ niệm đáng nhớ.",
        "weaknesses": "Cả hai có thể quá phóng khoáng, dẫn đến việc thiếu cam kết hoặc trách nhiệm. Số 3 có thể cảm thấy số 5 quá bốc đồng, trong khi số 5 có thể thấy số 3 thiếu tập trung. Sự thiếu định hướng có thể gây bất ổn nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu rực rỡ nếu cả hai học cách cam kết. Sự kết hợp giữa sáng tạo và phiêu lưu có thể tạo ra một mối quan hệ độc đáo và phong phú. Việc cùng đặt mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự thiếu cam kết và xu hướng phân tán. Cả hai cần học cách lập kế hoạch và tôn trọng nhu cầu của nhau. Việc thiếu định hướng có thể khiến mối quan hệ trở nên bề nổi nếu không có sự sâu sắc.",
        "suggestions": "Cả hai nên tham gia các hoạt động phiêu lưu như du lịch, leo núi hoặc thử thách mới để tăng sự gắn kết. Số 3 cần bày tỏ nhu cầu rõ ràng, còn số 5 nên cam kết hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như khám phá thành phố hoặc tham gia lớp học thể thao có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 5 (Nhà phiêu lưu) mang đến một gia đình năng động, đầy màu sắc, nhưng có thể thiếu sự ổn định. Số 3 mang đến sự lạc quan, sáng tạo và niềm vui, trong khi số 5 cung cấp sự linh hoạt, năng lượng và tinh thần khám phá. Sự tương đồng này tạo nên một mái ấm sôi động, nhưng cần trách nhiệm để duy trì.",
        "strengths": "Cả hai đều mang lại năng lượng tích cực và tinh thần tự do, tạo ra một môi trường gia đình đầy cảm hứng. Số 3 làm sáng không khí bằng sáng tạo, trong khi số 5 bổ sung bằng sự táo bạo và đổi mới. Họ có thể cùng nhau khám phá và thúc đẩy nhau phát triển.",
        "weaknesses": "Cả hai có thể thiếu trách nhiệm hoặc cam kết, dẫn đến sự bất ổn trong gia đình. Số 3 có thể cảm thấy số 5 quá bốc đồng, trong khi số 5 có thể thấy số 3 thiếu tập trung. Sự thiếu định hướng có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách chia sẻ trách nhiệm. Sự kết hợp giữa sáng tạo và phiêu lưu có thể tạo ra một gia đình độc đáo và năng động. Việc cùng lập kế hoạch chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự thiếu cam kết và xu hướng phân tán. Cả hai cần học cách lập kế hoạch và tôn trọng trách nhiệm gia đình. Việc thiếu định hướng có thể khiến gia đình thiếu cấu trúc nếu không có sự phối hợp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình năng động như đi du lịch hoặc thử thách mới để tăng sự gắn kết. Số 3 cần cam kết hơn với trách nhiệm, còn số 5 nên tôn trọng kế hoạch gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các hoạt động như cắm trại hoặc tham gia lớp học phiêu lưu có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 5 (Nhà phiêu lưu) có thể rất hiệu quả trong các dự án đòi hỏi sự đổi mới và năng lượng. Số 3 mang đến sự lạc quan, sáng tạo và khả năng thu hút, trong khi số 5 cung cấp sự linh hoạt, táo bạo và tinh thần khám phá. Sự tương đồng này tạo nên một đội nhóm sôi động, với tiềm năng đạt kết quả ấn tượng.",
        "strengths": "Cả hai đều mang lại ý tưởng mới mẻ và năng lượng tích cực, giúp đội nhóm nổi bật trong các dự án sáng tạo. Số 3 truyền cảm hứng bằng sáng tạo, trong khi số 5 bổ sung bằng sự táo bạo và đổi mới. Họ phối hợp tốt trong các lĩnh vực như truyền thông hoặc sự kiện.",
        "weaknesses": "Cả hai có thể thiếu kỷ luật hoặc phân tán, dẫn đến việc trì hoãn tiến độ. Số 3 có thể cảm thấy số 5 quá bốc đồng, trong khi số 5 có thể thấy số 3 thiếu tập trung. Sự thiếu định hướng có thể gây chậm trễ nếu không có sự lãnh đạo.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như quảng cáo, giải trí hoặc du lịch. Sự kết hợp giữa sáng tạo và phiêu lưu có thể dẫn đến những kết quả độc đáo. Việc tìm sự hỗ trợ từ một người định hướng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự thiếu kỷ luật và xu hướng phân tán. Cả hai cần học cách lập kế hoạch và tuân thủ tiến độ. Việc thiếu định hướng có thể khiến dự án bị trì trệ nếu không có sự phối hợp.",
        "suggestions": "Cả hai nên tìm một người định hướng hoặc phân chia vai trò rõ ràng, với số 3 tập trung vào sáng tạo và số 5 xử lý đổi mới. Cần tôn trọng kế hoạch và duy trì giao tiếp cởi mở. Tham gia các buổi họp định kỳ để tổ chức ý tưởng. Các hoạt động như brain-storming hoặc tham gia hội thảo sáng tạo có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 6 (Nhà chăm sóc) là sự kết hợp giữa sự vui tươi và tình yêu thương. Số 3 mang đến sự lạc quan, biểu đạt và niềm vui, trong khi số 6 cung cấp sự chu đáo, trách nhiệm và tình cảm sâu sắc. Sự tương phản này tạo nên một tình yêu ấm áp nhưng có thể thử thách do khác biệt trong ưu tiên.",
        "strengths": "Số 3 mang lại năng lượng tích cực và khả năng truyền cảm hứng, trong khi số 6 bổ sung bằng sự thấu hiểu và an toàn cảm xúc. Họ có thể bổ sung cho nhau, với số 3 làm sáng cuộc sống của số 6 và số 6 giúp số 3 ổn định hơn. Khả năng học hỏi lẫn nhau giúp số 3 trách nhiệm hơn và số 6 cởi mở hơn.",
        "weaknesses": "Số 3 có thể cảm thấy số 6 quá kiểm soát hoặc thiếu linh hoạt, trong khi số 6 có thể thấy số 3 quá phóng khoáng hoặc thiếu cam kết. Sự khác biệt trong ưu tiên (trải nghiệm vs. cảm xúc) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa sáng tạo và chăm sóc có thể tạo ra một tình yêu phong phú và ý nghĩa. Việc cùng tham gia các hoạt động chăm sóc hoặc sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 cần tự do biểu đạt, số 6 ưu tiên cảm xúc và trách nhiệm. Số 3 cần cam kết hơn, còn số 6 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động chăm sóc như nấu ăn, làm vườn hoặc sáng tạo như vẽ tranh để tăng sự gắn kết. Số 3 cần bày tỏ nhu cầu rõ ràng, còn số 6 nên khuyến khích sự tự do của số 3. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tổ chức bữa tối hoặc tham gia lớp học nghệ thuật có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 6 (Nhà chăm sóc) mang đến sự kết hợp giữa sự vui tươi và trách nhiệm, tạo nên một gia đình ấm áp nhưng cần sự cân bằng. Số 3 mang đến sự lạc quan, sáng tạo và niềm vui, trong khi số 6 cung cấp sự chu đáo, trách nhiệm và khả năng xây dựng mái ấm. Sự tương phản này có thể tạo ra một gia đình phong phú nếu cả hai bổ sung cho nhau.",
        "strengths": "Số 3 làm sáng không khí gia đình bằng năng lượng tích cực, trong khi số 6 tạo ra một môi trường yêu thương và an toàn. Họ bổ sung cho nhau, với số 3 mang lại sự mới mẻ và số 6 giúp số 3 trách nhiệm hơn. Khả năng thấu hiểu và hỗ trợ lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 3 có thể cảm thấy số 6 quá kiểm soát hoặc nghiêm túc, trong khi số 6 có thể thấy số 3 thiếu trách nhiệm hoặc quá phóng khoáng. Sự khác biệt trong ưu tiên (trải nghiệm vs. gia đình) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa sáng tạo và chăm sóc có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên tự do, số 6 cần trách nhiệm. Số 3 cần chia sẻ trách nhiệm gia đình, còn số 6 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình chăm sóc như làm vườn hoặc nấu ăn để tăng sự gắn kết. Số 3 cần cam kết hơn với trách nhiệm, còn số 6 nên tham gia các hoạt động sáng tạo. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các hoạt động như tham gia từ thiện hoặc lớp học sáng tạo có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 6 (Nhà chăm sóc) có thể hiệu quả trong các dự án cần sự sáng tạo và chăm sóc. Số 3 mang đến sự lạc quan, sáng tạo và khả năng thu hút, trong khi số 6 cung cấp sự chu đáo, trách nhiệm và khả năng duy trì hòa khí. Sự tương phản này tạo nên một đội nhóm thân thiện, nhưng cần sự định hướng để đạt kết quả lớn.",
        "strengths": "Số 3 mang lại ý tưởng mới mẻ và năng lượng tích cực, trong khi số 6 hỗ trợ bằng sự chu đáo và xây dựng mối quan hệ. Họ bổ sung cho nhau, với số 3 truyền cảm hứng và số 6 đảm bảo sự ổn định. Khả năng học hỏi lẫn nhau giúp số 3 trách nhiệm hơn và số 6 sáng tạo hơn.",
        "weaknesses": "Số 3 có thể cảm thấy số 6 quá kiểm soát hoặc thiếu linh hoạt, trong khi số 6 có thể thấy số 3 thiếu kỷ luật hoặc phân tán. Sự khác biệt trong phong cách làm việc (tự do vs. trách nhiệm) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như giáo dục, dịch vụ cộng đồng hoặc nghệ thuật. Sự kết hợp giữa sáng tạo và chăm sóc có thể dẫn đến những kết quả ý nghĩa. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 tự do và ý tưởng định hướng, số 6 cẩn thận và trách nhiệm định hướng. Số 3 cần tôn trọng kế hoạch, còn số 6 cần cởi mở với ý tưởng. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 3 tập trung vào sáng tạo và số 6 xử lý quan hệ đối ngoại. Số 3 cần cam kết với tiến độ, còn số 6 nên khuyến khích ý tưởng của số 3. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia dự án cộng đồng hoặc hội thảo sáng tạo có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 60,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 7 (Nhà hiền triết) là sự kết hợp giữa năng lượng sáng tạo và sự suy ngẫm. Số 3 mang đến sự lạc quan, biểu đạt và niềm vui, trong khi số 7 cung cấp sự sâu sắc, nội tâm và tri thức. Sự tương phản này có thể hấp dẫn nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 3 mang lại năng lượng tích cực và khả năng truyền cảm hứng, trong khi số 7 bổ sung bằng sự sâu sắc và tư duy triết học. Họ có thể học hỏi lẫn nhau, với số 3 làm sáng cuộc sống của số 7 và số 7 giúp số 3 suy ngẫm sâu hơn. Sự kết hợp này có thể tạo ra những cuộc trò chuyện ý nghĩa.",
        "weaknesses": "Số 3 có thể cảm thấy số 7 quá xa cách hoặc thiếu năng lượng, trong khi số 7 có thể thấy số 3 quá phóng khoáng hoặc bề nổi. Sự khác biệt trong ưu tiên (trải nghiệm vs. tinh thần) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa sáng tạo và suy ngẫm có thể tạo ra một tình yêu độc đáo. Việc cùng tham gia các hoạt động tinh thần hoặc sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 cần tự do biểu đạt, số 7 ưu tiên nội tâm. Số 3 cần cam kết hơn, còn số 7 cần cởi mở hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động tinh thần như thiền, đọc sách hoặc sáng tạo như viết lách để tăng sự gắn kết. Số 3 cần bày tỏ nhu cầu rõ ràng, còn số 7 nên dành thời gian lắng nghe. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi bảo tàng hoặc trò chuyện sâu sắc có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 7 (Nhà hiền triết) đối mặt với thử thách do sự khác biệt trong phong cách sống. Số 3 mang đến sự lạc quan, sáng tạo và niềm vui, trong khi số 7 cung cấp sự sâu sắc, nội tâm và tri thức. Sự tương phản này có thể tạo ra một gia đình độc đáo nhưng cần nỗ lực lớn để duy trì hòa hợp.",
        "strengths": "Số 3 làm sáng không khí gia đình bằng năng lượng tích cực, trong khi số 7 mang lại sự sâu sắc và tư duy logic. Họ có thể bổ sung cho nhau, với số 3 mang lại sự mới mẻ và số 7 giúp số 3 suy ngẫm sâu hơn. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 3 có thể cảm thấy số 7 quá xa cách hoặc thiếu cam kết, trong khi số 7 có thể thấy số 3 thiếu trách nhiệm hoặc quá phóng khoáng. Sự khác biệt trong ưu tiên (trải nghiệm vs. tinh thần) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa sáng tạo và suy ngẫm có thể tạo ra một gia đình ý nghĩa. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên tự do, số 7 cần nội tâm. Số 3 cần chia sẻ trách nhiệm gia đình, còn số 7 cần cởi mở hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình tinh thần như đọc sách hoặc thiền để tăng sự gắn kết. Số 3 cần cam kết hơn với trách nhiệm, còn số 7 nên tham gia các hoạt động sáng tạo. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các hoạt động như tham gia lớp học triết học hoặc sáng tạo có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 7 (Nhà hiền triết) có thể hiệu quả trong các dự án cần sự sáng tạo và phân tích sâu sắc. Số 3 mang đến sự lạc quan, sáng tạo và khả năng thu hút, trong khi số 7 cung cấp sự sâu sắc, tri thức và tư duy logic. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự định hướng để thành công.",
        "strengths": "Số 3 mang lại ý tưởng mới mẻ và năng lượng tích cực, trong khi số 7 đảm bảo chất lượng bằng phân tích sâu sắc. Họ bổ sung cho nhau, với số 3 truyền cảm hứng và số 7 mang lại sự suy ngẫm. Khả năng học hỏi lẫn nhau giúp số 3 tập trung hơn và số 7 sáng tạo hơn.",
        "weaknesses": "Số 3 có thể cảm thấy số 7 quá chậm chạp hoặc xa cách, trong khi số 7 có thể thấy số 3 thiếu kỷ luật hoặc phân tán. Sự khác biệt trong phong cách làm việc (tự do vs. phân tích) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghiên cứu sáng tạo hoặc tư vấn. Sự kết hợp giữa sáng tạo và phân tích có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 tự do và ý tưởng định hướng, số 7 độc lập và phân tích định hướng. Số 3 cần tôn trọng kế hoạch, còn số 7 cần cởi mở với ý tưởng. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 3 tập trung vào sáng tạo và số 7 xử lý phân tích. Số 3 cần cam kết với tiến độ, còn số 7 nên khuyến khích ý tưởng của số 3. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo nghiên cứu hoặc brain-storming có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 8 (Nhà quyền lực) là sự kết hợp giữa sự vui tươi và tham vọng. Số 3 mang đến sự lạc quan, biểu đạt và niềm vui, trong khi số 8 cung cấp sự quyết đoán, tham vọng và định hướng thành công. Sự tương phản này tạo nên một tình yêu năng động nhưng có thể gặp thử thách nếu số 8 quá kiểm soát.",
        "strengths": "Số 3 mang lại năng lượng tích cực và khả năng truyền cảm hứng, trong khi số 8 bổ sung bằng sự tự tin và khả năng dẫn dắt. Họ có thể thúc đẩy nhau, với số 3 làm dịu sự căng thẳng của số 8 và số 8 giúp số 3 tập trung hơn. Sự kết hợp này có thể tạo ra một mối quan hệ cân bằng và đầy động lực.",
        "weaknesses": "Số 3 có thể cảm thấy số 8 quá nghiêm túc hoặc kiểm soát, trong khi số 8 có thể thấy số 3 thiếu trách nhiệm hoặc quá phóng khoáng. Sự khác biệt trong ưu tiên (trải nghiệm vs. thành công) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa sáng tạo và lãnh đạo có thể tạo ra một tình yêu phong phú. Việc cùng lập kế hoạch chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 cần tự do biểu đạt, số 8 tập trung vào mục tiêu. Số 3 cần cam kết hơn, còn số 8 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động lập kế hoạch như tổ chức sự kiện hoặc quản lý tài chính để tăng sự gắn kết. Số 3 cần bày tỏ nhu cầu rõ ràng, còn số 8 nên dành thời gian thể hiện sự vui tươi. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi du lịch hoặc tổ chức bữa tối có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 8 (Nhà quyền lực) mang đến sự kết hợp giữa sự vui tươi và tham vọng, tạo nên một gia đình năng động nhưng cần sự cân bằng. Số 3 mang đến sự lạc quan, sáng tạo và niềm vui, trong khi số 8 cung cấp sự quyết đoán, ổn định tài chính và định hướng. Sự tương phản này có thể tạo ra một mái ấm phong phú nếu cả hai tôn trọng lẫn nhau.",
        "strengths": "Số 3 làm sáng không khí gia đình bằng năng lượng tích cực, trong khi số 8 mang lại sự ổn định và khả năng lãnh đạo. Họ bổ sung cho nhau, với số 3 mang lại sự mới mẻ và số 8 giúp số 3 trách nhiệm hơn. Khả năng truyền cảm hứng và hỗ trợ lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 3 có thể cảm thấy số 8 quá kiểm soát hoặc nghiêm túc, trong khi số 8 có thể thấy số 3 thiếu trách nhiệm hoặc quá phóng khoáng. Sự khác biệt trong ưu tiên (trải nghiệm vs. sự nghiệp) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa sáng tạo và lãnh đạo có thể tạo ra một gia đình hạnh phúc và thành công. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên tự do, số 8 tập trung vào mục tiêu. Số 3 cần chia sẻ trách nhiệm gia đình, còn số 8 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như lập kế hoạch tài chính hoặc cải tạo nhà cửa để tăng sự gắn kết. Số 3 cần cam kết hơn với trách nhiệm, còn số 8 nên tham gia các hoạt động sáng tạo. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các hoạt động như tham gia lớp học kỹ năng hoặc tổ chức sự kiện gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 8 (Nhà quyền lực) có thể rất hiệu quả nhờ sự kết hợp giữa ý tưởng sáng tạo và chiến lược. Số 3 mang đến sự lạc quan, sáng tạo và khả năng thu hút, trong khi số 8 cung cấp sự quyết đoán, chiến lược và định hướng thành công. Sự tương phản này tạo nên một đội nhóm mạnh mẽ, với tiềm năng đạt kết quả lớn.",
        "strengths": "Số 3 mang lại ý tưởng mới mẻ và năng lượng tích cực, trong khi số 8 dẫn dắt với tầm nhìn chiến lược. Họ bổ sung cho nhau, với số 3 truyền cảm hứng và số 8 đảm bảo tiến độ. Khả năng học hỏi lẫn nhau giúp số 3 tập trung hơn và số 8 sáng tạo hơn.",
        "weaknesses": "Số 3 có thể cảm thấy số 8 quá kiểm soát hoặc thiếu linh hoạt, trong khi số 8 có thể thấy số 3 thiếu kỷ luật hoặc phân tán. Sự khác biệt trong phong cách làm việc (tự do vs. mục tiêu) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như kinh doanh sáng tạo hoặc truyền thông. Sự kết hợp giữa sáng tạo và chiến lược có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 tự do và ý tưởng định hướng, số 8 kỷ luật và mục tiêu định hướng. Số 3 cần tôn trọng kế hoạch, còn số 8 cần cởi mở với ý tưởng. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 3 tập trung vào sáng tạo và số 8 xử lý chiến lược. Số 3 cần cam kết với tiến độ, còn số 8 nên khuyến khích ý tưởng của số 3. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo kinh doanh hoặc brain-storming có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 9 (Nhà nhân đạo) là sự kết hợp giữa sự vui tươi và lòng nhân ái. Số 3 mang đến sự lạc quan, biểu đạt và niềm vui, trong khi số 9 cung cấp sự lý tưởng, nhân ái và khả năng truyền cảm hứng. Sự tương đồng về năng lượng tích cực tạo nên một tình yêu sâu sắc, nhưng cần sự thực tế để duy trì.",
        "strengths": "Cả hai đều có năng lượng tích cực và lòng trắc ẩn, tạo ra một mối quan hệ yêu thương và ý nghĩa. Số 3 mang lại sự sáng tạo, trong khi số 9 bổ sung bằng tầm nhìn lớn và sự nhiệt huyết. Họ có thể truyền cảm hứng lẫn nhau, với số 3 làm sáng cuộc sống của số 9 và số 9 khuyến khích số 3 hướng tới mục tiêu lớn.",
        "weaknesses": "Số 3 có thể cảm thấy số 9 quá lý tưởng hoặc thiếu tập trung vào cá nhân, trong khi số 9 có thể thấy số 3 quá phóng khoáng hoặc thiếu cam kết. Sự khác biệt trong ưu tiên (trải nghiệm vs. cộng đồng) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu sâu sắc nếu cả hai học cách cân bằng lý tưởng và thực tế. Sự kết hợp giữa sáng tạo và nhân ái có thể tạo ra một mối quan hệ phong phú. Việc cùng tham gia các hoạt động cộng đồng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 cần tự do biểu đạt, số 9 hướng tới mục tiêu lớn. Số 3 cần cam kết hơn, còn số 9 cần tập trung hơn vào mối quan hệ. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động cộng đồng như tình nguyện hoặc từ thiện để tăng sự gắn kết. Số 3 cần bày tỏ nhu cầu rõ ràng, còn số 9 nên dành thời gian cho số 3. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như trò chuyện sâu sắc hoặc tham gia sự kiện xã hội có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 9 (Nhà nhân đạo) mang đến sự kết hợp giữa sự vui tươi và lòng nhân ái, tạo nên một gia đình ý nghĩa. Số 3 mang đến sự lạc quan, sáng tạo và niềm vui, trong khi số 9 cung cấp sự lý tưởng, nhân ái và tầm nhìn lớn. Sự tương đồng này giúp họ xây dựng một mái ấm hạnh phúc nếu cân bằng được lý tưởng và thực tế.",
        "strengths": "Cả hai đều có năng lượng tích cực và lòng trắc ẩn, tạo ra một môi trường gia đình yêu thương. Số 3 làm sáng không khí bằng sáng tạo, trong khi số 9 mang lại sự nhiệt huyết và mục tiêu lớn. Họ bổ sung cho nhau, với số 3 giúp số 9 thư giãn hơn và số 9 khuyến khích số 3 hướng tới ý nghĩa lớn.",
        "weaknesses": "Số 3 có thể cảm thấy số 9 quá lý tưởng hoặc bỏ qua gia đình, trong khi số 9 có thể thấy số 3 thiếu trách nhiệm hoặc quá phóng khoáng. Sự khác biệt trong ưu tiên (trải nghiệm vs. cộng đồng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ lý tưởng nếu cả hai học cách cân bằng. Sự kết hợp giữa sáng tạo và nhân ái có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong ưu tiên: số 3 cần tự do, số 9 hướng tới mục tiêu lớn. Số 3 cần chia sẻ trách nhiệm gia đình, còn số 9 cần tập trung hơn vào gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình ý nghĩa như tham gia từ thiện hoặc lập kế hoạch cộng đồng để tăng sự gắn kết. Số 3 cần cam kết hơn với trách nhiệm, còn số 9 nên dành thời gian cho gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các hoạt động như tham gia dự án xã hội hoặc trò chuyện về mục tiêu có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 9 (Nhà nhân đạo) có thể rất hiệu quả trong các dự án cộng đồng hoặc sáng tạo. Số 3 mang đến sự lạc quan, sáng tạo và khả năng thu hút, trong khi số 9 cung cấp sự lý tưởng, nhân ái và tầm nhìn lớn. Sự tương đồng này tạo nên một đội nhóm ý nghĩa, với tiềm năng tạo ra tác động lớn.",
        "strengths": "Cả hai đều mang lại năng lượng tích cực và lòng trắc ẩn, giúp họ phối hợp tốt trong các dự án xã hội. Số 3 truyền cảm hứng bằng sáng tạo, trong khi số 9 mang lại tầm nhìn lớn và nhiệt huyết. Họ bổ sung cho nhau, với số 3 đảm bảo sự thu hút và số 9 định hướng mục tiêu lớn.",
        "weaknesses": "Số 3 có thể cảm thấy số 9 quá lý tưởng hoặc thiếu thực tế, trong khi số 9 có thể thấy số 3 thiếu kỷ luật hoặc phân tán. Sự khác biệt trong phong cách làm việc (tự do vs. lý tưởng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như từ thiện, giáo dục hoặc truyền thông xã hội. Sự kết hợp giữa sáng tạo và nhân ái có thể dẫn đến những kết quả ý nghĩa. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 tự do và ý tưởng định hướng, số 9 lý tưởng và mục tiêu định hướng. Số 3 cần tôn trọng kế hoạch, còn số 9 cần thực tế hơn. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 3 tập trung vào sáng tạo và số 9 xử lý tầm nhìn. Số 3 cần cam kết với tiến độ, còn số 9 nên khuyến khích ý tưởng của số 3. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia dự án xã hội hoặc hội thảo cộng đồng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 11 (Nhà truyền cảm hứng) là sự kết hợp giữa sự sáng tạo và trực giác tinh thần. Số 3 mang đến sự lạc quan, biểu đạt và niềm vui, trong khi số 11 cung cấp sự trực giác, lý tưởng và khả năng truyền cảm hứng. Sự tương đồng về năng lượng tạo nên một tình yêu sâu sắc, nhưng cần sự thực tế để duy trì.",
        "strengths": "Cả hai đều mang lại năng lượng tích cực và khả năng truyền cảm hứng, tạo ra một mối quan hệ đồng điệu. Số 3 mang lại sự sáng tạo, trong khi số 11 bổ sung bằng sự trực giác và tầm nhìn tinh thần. Họ có thể thúc đẩy nhau, với số 3 làm sáng cuộc sống của số 11 và số 11 giúp số 3 khám phá chiều sâu tinh thần.",
        "weaknesses": "Số 3 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu thực tế, trong khi số 11 có thể thấy số 3 quá phóng khoáng hoặc thiếu cam kết. Sự khác biệt trong ưu tiên (trải nghiệm vs. tinh thần) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách cân bằng thực tế và lý tưởng. Sự kết hợp giữa sáng tạo và truyền cảm hứng có thể tạo ra một tình yêu phong phú. Việc cùng tham gia các hoạt động tinh thần hoặc sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 cần tự do biểu đạt, số 11 hướng tới trực giác. Số 3 cần cam kết hơn, còn số 11 cần thực tế hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động tinh thần như thiền, yoga hoặc sáng tạo như vẽ tranh để tăng sự gắn kết. Số 3 cần bày tỏ nhu cầu rõ ràng, còn số 11 nên nỗ lực hiện thực hóa lý tưởng. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như viết nhật ký chung hoặc tham gia hội thảo tâm lý có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 11 (Nhà truyền cảm hứng) mang đến sự kết hợp giữa sự vui tươi và trực giác tinh thần, tạo nên một gia đình sâu sắc nhưng cần sự thực tế. Số 3 mang đến sự lạc quan, sáng tạo và niềm vui, trong khi số 11 cung cấp sự trực giác, lý tưởng và tầm nhìn tinh thần. Sự tương đồng này có thể xây dựng một mái ấm ý nghĩa nếu cả hai cân bằng được lý tưởng và thực tế.",
        "strengths": "Cả hai đều mang lại năng lượng tích cực và khả năng truyền cảm hứng, tạo ra một môi trường gia đình đồng điệu. Số 3 làm sáng không khí bằng sáng tạo, trong khi số 11 mang lại sự trực giác và chiều sâu tinh thần. Họ bổ sung cho nhau, với số 3 giúp số 11 thư giãn hơn và số 11 khuyến khích số 3 khám phá tinh thần.",
        "weaknesses": "Số 3 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu cam kết, trong khi số 11 có thể thấy số 3 thiếu trách nhiệm hoặc quá phóng khoáng. Sự khác biệt trong ưu tiên (trải nghiệm vs. tinh thần) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa sáng tạo và truyền cảm hứng có thể tạo ra một gia đình phong phú và ý nghĩa. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong ưu tiên: số 3 cần tự do, số 11 hướng tới lý tưởng. Số 3 cần chia sẻ trách nhiệm gia đình, còn số 11 cần thực tế hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình tinh thần như thiền hoặc yoga để tăng sự gắn kết. Số 3 cần cam kết hơn với trách nhiệm, còn số 11 nên nỗ lực thực tế hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như viết nhật ký chung hoặc tham gia hội thảo tâm lý có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 11 (Nhà truyền cảm hứng) có thể hiệu quả trong các dự án sáng tạo hoặc tinh thần. Số 3 mang đến sự lạc quan, sáng tạo và khả năng thu hút, trong khi số 11 cung cấp sự trực giác, lý tưởng và khả năng truyền cảm hứng. Sự tương đồng này tạo nên một đội nhóm đồng điệu, nhưng cần sự thực tế để thành công.",
        "strengths": "Cả hai đều mang lại năng lượng tích cực và khả năng truyền cảm hứng, giúp đội nhóm nổi bật trong các dự án sáng tạo. Số 3 mang lại ý tưởng mới mẻ, trong khi số 11 bổ sung bằng trực giác và tầm nhìn lớn. Họ bổ sung cho nhau, với số 3 đảm bảo sự thu hút và số 11 định hướng tinh thần.",
        "weaknesses": "Số 3 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu kỷ luật, trong khi số 11 có thể thấy số 3 thiếu tập trung hoặc quá phóng khoáng. Sự khác biệt trong phong cách làm việc (tự do vs. lý tưởng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghệ thuật, tư vấn hoặc dự án tinh thần. Sự kết hợp giữa sáng tạo và truyền cảm hứng có thể dẫn đến những kết quả độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 tự do và ý tưởng định hướng, số 11 lý tưởng và trực giác định hướng. Số 3 cần tôn trọng kế hoạch, còn số 11 cần thực tế hơn. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 3 tập trung vào sáng tạo và số 11 xử lý tầm nhìn. Số 3 cần cam kết với tiến độ, còn số 11 nên khuyến khích ý tưởng của số 3. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo sáng tạo hoặc thiền có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 22 (Nhà xây dựng bậc thầy) là sự kết hợp giữa sự vui tươi và tham vọng lớn. Số 3 mang đến sự lạc quan, biểu đạt và niềm vui, trong khi số 22 cung cấp tầm nhìn vĩ đại, thực tế và khả năng hiện thực hóa giấc mơ. Sự tương phản này tạo nên một tình yêu năng động nhưng có thể gặp thử thách nếu số 22 quá tập trung vào mục tiêu.",
        "strengths": "Số 3 mang lại năng lượng tích cực và khả năng truyền cảm hứng, trong khi số 22 bổ sung bằng sự quyết tâm và khả năng thực hiện. Họ có thể thúc đẩy nhau, với số 3 làm sáng cuộc sống của số 22 và số 22 giúp số 3 tập trung hơn. Sự kết hợp này có thể tạo ra một mối quan hệ cân bằng và đầy động lực.",
        "weaknesses": "Số 3 có thể cảm thấy số 22 quá nghiêm túc hoặc kiểm soát, trong khi số 22 có thể thấy số 3 thiếu trách nhiệm hoặc quá phóng khoáng. Sự khác biệt trong ưu tiên (trải nghiệm vs. mục tiêu lớn) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa sáng tạo và tham vọng có thể tạo ra một tình yêu phong phú. Việc cùng lập kế hoạch chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 cần tự do biểu đạt, số 22 tập trung vào mục tiêu lớn. Số 3 cần cam kết hơn, còn số 22 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động lập kế hoạch như tổ chức sự kiện hoặc quản lý dự án cá nhân để tăng sự gắn kết. Số 3 cần bày tỏ nhu cầu rõ ràng, còn số 22 nên dành thời gian thể hiện sự vui tươi. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi du lịch hoặc tổ chức bữa tối có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 22 (Nhà xây dựng bậc thầy) mang đến sự kết hợp giữa sự vui tươi và tham vọng vĩ đại, tạo nên một gia đình năng động nhưng cần sự cân bằng. Số 3 mang đến sự lạc quan, sáng tạo và niềm vui, trong khi số 22 cung cấp tầm nhìn lớn, thực tế và khả năng xây dựng. Sự tương phản này có thể tạo ra một mái ấm phong phú nếu cả hai tôn trọng lẫn nhau.",
        "strengths": "Số 3 làm sáng không khí gia đình bằng năng lượng tích cực, trong khi số 22 mang lại sự ổn định và khả năng thực hiện mục tiêu lớn. Họ bổ sung cho nhau, với số 3 mang lại sự mới mẻ và số 22 giúp số 3 trách nhiệm hơn. Khả năng truyền cảm hứng và hỗ trợ lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 3 có thể cảm thấy số 22 quá kiểm soát hoặc nghiêm túc, trong khi số 22 có thể thấy số 3 thiếu trách nhiệm hoặc quá phóng khoáng. Sự khác biệt trong ưu tiên (trải nghiệm vs. mục tiêu lớn) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa sáng tạo và tham vọng có thể tạo ra một gia đình hạnh phúc và thành công. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên tự do, số 22 tập trung vào mục tiêu lớn. Số 3 cần chia sẻ trách nhiệm gia đình, còn số 22 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như lập kế hoạch tài chính hoặc cải tạo nhà cửa để tăng sự gắn kết. Số 3 cần cam kết hơn với trách nhiệm, còn số 22 nên tham gia các hoạt động sáng tạo. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia hội thảo mục tiêu hoặc tổ chức sự kiện gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 22 (Nhà xây dựng bậc thầy) có thể rất hiệu quả nhờ sự kết hợp giữa ý tưởng sáng tạo và tham vọng lớn. Số 3 mang đến sự lạc quan, sáng tạo và khả năng thu hút, trong khi số 22 cung cấp tầm nhìn vĩ đại, thực tế và khả năng thực hiện. Sự tương phản này tạo nên một đội nhóm mạnh mẽ, với tiềm năng đạt kết quả ấn tượng.",
        "strengths": "Số 3 mang lại ý tưởng mới mẻ và năng lượng tích cực, trong khi số 22 dẫn dắt với tầm nhìn lớn và khả năng thực hiện. Họ bổ sung cho nhau, với số 3 truyền cảm hứng và số 22 đảm bảo tiến độ. Khả năng học hỏi lẫn nhau giúp số 3 tập trung hơn và số 22 sáng tạo hơn.",
        "weaknesses": "Số 3 có thể cảm thấy số 22 quá kiểm soát hoặc thiếu linh hoạt, trong khi số 22 có thể thấy số 3 thiếu kỷ luật hoặc phân tán. Sự khác biệt trong phong cách làm việc (tự do vs. mục tiêu) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như kinh doanh, kiến trúc hoặc dự án cộng đồng. Sự kết hợp giữa sáng tạo và tham vọng có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 tự do và ý tưởng định hướng, số 22 kỷ luật và mục tiêu định hướng. Số 3 cần tôn trọng kế hoạch, còn số 22 cần cởi mở với ý tưởng. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 3 tập trung vào sáng tạo và số 22 xử lý chiến lược. Số 3 cần cam kết với tiến độ, còn số 22 nên khuyến khích ý tưởng của số 3. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo kinh doanh hoặc lập kế hoạch dự án có thể tăng sự gắn kết."
      }
    }
  ]
}