{
  "number": 7,
  "description": "Số đường đời 7 đại diện cho sự sâu sắc, nội tâm và tri thức. Những người mang số 7 thường tò mò, thích khám phá những khía cạnh sâu xa của cuộc sống và trân trọng sự suy ngẫm. Họ có xu hướng độc lập và tinh thần, nhưng có thể trở nên xa cách hoặc quá khép kín nếu không cân bằng được nhu cầu kết nối.",
  "compatibility": [
    {
      "partnerNumber": 1,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nMối quan hệ giữa số 7 (Nhà hiền triết) và số 1 (Nhà lãnh đạo) là sự kết hợp giữa sự sâu sắc và tham vọng. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 1 cung cấp sự quyết đoán, sáng tạo và định hướng mục tiêu. Sự tương phản này có thể tạo ra một mối quan hệ hấp dẫn nhưng khó duy trì do khác biệt lớn trong phong cách sống.",
        "strengths": "Số 7 mang lại chiều sâu tư duy và khả năng phân tích, trong khi số 1 bổ sung bằng sự tự tin và năng lượng lãnh đạo. Họ có thể học hỏi lẫn nhau, với số 7 giúp số 1 suy ngẫm sâu hơn và số 1 khuyến khích số 7 hành động. Sự kết hợp này có thể tạo ra một mối quan hệ kích thích nếu cả hai cởi mở.",
        "weaknesses": "Số 7 có thể cảm thấy số 1 quá áp đảo hoặc thiếu chiều sâu, trong khi số 1 có thể thấy số 7 quá xa cách hoặc chậm chạp. Sự khác biệt trong ưu tiên (nội tâm vs. hành động) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa tư duy và lãnh đạo có thể tạo ra một tình yêu độc đáo. Việc cùng tham gia các hoạt động tri thức hoặc sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 cần thời gian riêng tư, số 1 hướng tới kiểm soát. Số 7 cần cởi mở hơn, còn số 1 cần kiên nhẫn hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động tri thức như thảo luận sách hoặc sáng tạo như làm nghệ thuật để tăng sự gắn kết. Số 7 cần bày tỏ cảm xúc, còn số 1 nên tôn trọng nhu cầu riêng tư của số 7. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi bảo tàng hoặc tham gia hội thảo có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 50,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 7 (Nhà hiền triết) và số 1 (Nhà lãnh đạo) đối mặt với nhiều thử thách do sự khác biệt trong phong cách sống. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 1 cung cấp sự quyết đoán, tham vọng và khả năng lãnh đạo. Sự tương phản này có thể tạo ra một gia đình năng động nhưng cần nỗ lực lớn để duy trì hòa hợp.",
        "strengths": "Số 7 mang lại sự sâu sắc và tư duy phân tích, trong khi số 1 tạo ra một môi trường gia đình định hướng và năng động. Họ có thể bổ sung cho nhau, với số 7 giúp số 1 suy ngẫm và số 1 hỗ trợ số 7 hành động. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 7 có thể cảm thấy số 1 quá kiểm soát hoặc thiếu chiều sâu, trong khi số 1 có thể thấy số 7 quá xa cách hoặc thiếu cam kết. Sự khác biệt trong ưu tiên (nội tâm vs. mục tiêu) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa tư duy và lãnh đạo có thể tạo ra một gia đình độc đáo. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động tri thức sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 ưu tiên riêng tư, số 1 cần kiểm soát. Số 7 cần chia sẻ cảm xúc, còn số 1 cần kiên nhẫn hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình tri thức như đọc sách hoặc thực tế như lập kế hoạch tài chính để tăng sự gắn kết. Số 7 cần tham gia các mục tiêu gia đình, còn số 1 nên tôn trọng nhu cầu riêng tư của số 7. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học hoặc tổ chức buổi trò chuyện sâu sắc có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nSự hợp tác giữa số 7 (Nhà hiền triết) và số 1 (Nhà lãnh đạo) có thể gặp khó khăn do sự khác biệt trong phong cách làm việc. Số 7 mang đến sự sâu sắc, tri thức và tư duy logic, trong khi số 1 cung cấp sự quyết đoán, tham vọng và khả năng lãnh đạo. Sự tương phản này có thể tạo ra một đội nhóm độc đáo nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 7 mang lại sự phân tích và chiều sâu tư duy, trong khi số 1 đảm bảo tiến độ bằng sự quyết đoán. Họ có thể bổ sung cho nhau, với số 7 cung cấp nghiên cứu và số 1 mang lại định hướng. Khả năng học hỏi lẫn nhau giúp số 7 hành động nhanh hơn và số 1 suy ngẫm sâu hơn.",
        "weaknesses": "Số 7 có thể cảm thấy số 1 quá áp đảo hoặc thiếu chiều sâu, trong khi số 1 có thể thấy số 7 quá chậm chạp hoặc xa cách. Sự khác biệt trong phong cách làm việc (phân tích vs. hành động) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghiên cứu hoặc tư vấn, nếu cả hai tận dụng thế mạnh của nhau. Sự kết hợp giữa phân tích và lãnh đạo có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 7 độc lập và phân tích định hướng, số 1 quyết đoán và mục tiêu định hướng. Số 7 cần cởi mở với ý tưởng lớn, còn số 1 cần tôn trọng tiến độ của số 7. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 7 tập trung vào phân tích và số 1 xử lý chiến lược. Số 7 cần khuyến khích ý tưởng của số 1, còn số 1 nên tôn trọng tiến độ của số 7. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo nghiên cứu hoặc lập kế hoạch dự án có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nMối quan hệ giữa số 7 (Nhà hiền triết) và số 2 (Nhà ngoại giao) là sự kết hợp giữa sự sâu sắc và sự dịu dàng. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 2 cung cấp sự nhạy cảm, hỗ trợ và hòa giải. Sự tương phản này có thể tạo ra một tình yêu phong phú nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 7 mang lại sự sâu sắc và tư duy phân tích, trong khi số 2 bổ sung bằng sự thấu hiểu và an toàn cảm xúc. Họ có thể hỗ trợ nhau, với số 7 giúp số 2 suy ngẫm sâu hơn và số 2 khuyến khích số 7 cởi mở hơn về cảm xúc. Sự kết hợp này có thể tạo ra một mối quan hệ cân bằng nếu cả hai nỗ lực.",
        "weaknesses": "Số 7 có thể cảm thấy số 2 quá nhạy cảm hoặc phụ thuộc, trong khi số 2 có thể thấy số 7 quá xa cách hoặc lạnh lùng. Sự khác biệt trong ưu tiên (nội tâm vs. cảm xúc) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa tư duy và chăm sóc có thể tạo ra một tình yêu ý nghĩa. Việc cùng tham gia các hoạt động tri thức hoặc chăm sóc sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 cần thời gian riêng tư, số 2 ưu tiên cảm xúc. Số 7 cần bày tỏ cảm xúc, còn số 2 cần tự tin hơn trong việc chia sẻ nhu cầu. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động tri thức như đọc sách hoặc chăm sóc như nấu ăn chung để tăng sự gắn kết. Số 7 cần cởi mở hơn về cảm xúc, còn số 2 nên tôn trọng nhu cầu riêng tư của số 7. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi dạo công viên hoặc tổ chức bữa tối có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 7 (Nhà hiền triết) và số 2 (Nhà ngoại giao) mang đến sự kết hợp giữa sự sâu sắc và tình yêu thương, nhưng đối mặt với thử thách do khác biệt trong phong cách sống. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 2 cung cấp sự chu đáo, hỗ trợ và hòa giải. Sự tương phản này có thể tạo ra một gia đình độc đáo nhưng cần nỗ lực để duy trì hòa hợp.",
        "strengths": "Số 7 tạo ra một môi trường gia đình sâu sắc và tư duy, trong khi số 2 mang lại sự ấm áp và an toàn cảm xúc. Họ có thể bổ sung cho nhau, với số 7 giúp số 2 suy ngẫm và số 2 hỗ trợ số 7 cởi mở hơn. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 7 có thể cảm thấy số 2 quá phụ thuộc hoặc nhạy cảm, trong khi số 2 có thể thấy số 7 quá xa cách hoặc thiếu cảm xúc. Sự khác biệt trong ưu tiên (nội tâm vs. cảm xúc) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa tư duy và chăm sóc có thể tạo ra một gia đình hạnh phúc. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động chăm sóc sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 ưu tiên riêng tư, số 2 cần cảm xúc. Số 7 cần chia sẻ cảm xúc, còn số 2 cần tự tin hơn trong việc bày tỏ nhu cầu. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình chăm sóc như làm vườn hoặc tri thức như đọc sách để tăng sự gắn kết. Số 7 cần cởi mở hơn, còn số 2 nên tham gia các hoạt động suy ngẫm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia từ thiện hoặc tổ chức chuyến đi gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 7 (Nhà hiền triết) và số 2 (Nhà ngoại giao) có thể hiệu quả trong các dự án cần sự cân bằng giữa phân tích và ngoại giao. Số 7 mang đến sự sâu sắc, tri thức và tư duy logic, trong khi số 2 cung cấp kỹ năng ngoại giao, sự hỗ trợ và khả năng xây dựng mối quan hệ. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 7 mang lại sự phân tích và chiều sâu tư duy, trong khi số 2 đảm bảo hòa khí và xây dựng mối quan hệ. Họ bổ sung cho nhau, với số 7 cung cấp nghiên cứu và số 2 mang lại sự hỗ trợ. Khả năng học hỏi lẫn nhau giúp số 7 cởi mở hơn và số 2 tự tin hơn.",
        "weaknesses": "Số 7 có thể cảm thấy số 2 quá nhạy cảm hoặc thiếu quyết đoán, trong khi số 2 có thể thấy số 7 quá xa cách hoặc chậm chạp. Sự khác biệt trong phong cách làm việc (phân tích vs. người định hướng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như tư vấn, giáo dục hoặc dịch vụ cộng đồng. Sự kết hợp giữa phân tích và ngoại giao có thể dẫn đến những kết quả ý nghĩa. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 7 độc lập và phân tích định hướng, số 2 cẩn thận và người định hướng. Số 7 cần tôn trọng ý kiến của số 2, còn số 2 cần tự tin đóng góp ý tưởng. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 7 tập trung vào phân tích và số 2 xử lý quan hệ đối ngoại. Số 7 cần khuyến khích ý kiến của số 2, còn số 2 nên tự tin đóng góp ý tưởng. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo đội nhóm hoặc dự án cộng đồng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nMối quan hệ giữa số 7 (Nhà hiền triết) và số 3 (Nhà sáng tạo) là sự kết hợp giữa sự sâu sắc và năng lượng sáng tạo. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 3 cung cấp sự lạc quan, biểu đạt và niềm vui. Sự tương phản này có thể tạo ra một tình yêu thú vị nhưng khó duy trì do khác biệt trong phong cách sống.",
        "strengths": "Số 7 mang lại sự sâu sắc và tư duy phân tích, trong khi số 3 bổ sung bằng sự vui tươi và khả năng truyền cảm hứng. Họ có thể hỗ trợ nhau, với số 7 giúp số 3 tập trung hơn và số 3 khuyến khích số 7 cởi mở hơn. Sự kết hợp này có thể tạo ra một mối quan hệ năng động nếu cả hai nỗ lực.",
        "weaknesses": "Số 7 có thể cảm thấy số 3 quá phân tán hoặc thiếu chiều sâu, trong khi số 3 có thể thấy số 7 quá nghiêm túc hoặc xa cách. Sự khác biệt trong ưu tiên (nội tâm vs. biểu đạt) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa tư duy và sáng tạo có thể tạo ra một tình yêu phong phú. Việc cùng tham gia các hoạt động tri thức hoặc sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 cần thời gian riêng tư, số 3 ưu tiên biểu đạt. Số 7 cần cởi mở hơn, còn số 3 cần tập trung hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động sáng tạo như làm nghệ thuật hoặc tri thức như thảo luận sách để tăng sự gắn kết. Số 7 cần bày tỏ cảm xúc, còn số 3 nên tôn trọng nhu cầu riêng tư của số 7. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi công viên giải trí hoặc làm gốm có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 7 (Nhà hiền triết) và số 3 (Nhà sáng tạo) mang đến sự kết hợp giữa sự sâu sắc và năng lượng sáng tạo, nhưng đối mặt với thử thách do khác biệt trong phong cách sống. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 3 cung cấp sự lạc quan, sáng tạo và niềm vui. Sự tương phản này có thể tạo ra một gia đình độc đáo nhưng cần nỗ lực để duy trì hòa hợp.",
        "strengths": "Số 7 tạo ra một môi trường gia đình sâu sắc và tư duy, trong khi số 3 mang lại sự vui tươi và sáng tạo. Họ có thể bổ sung cho nhau, với số 7 giúp số 3 tập trung và số 3 hỗ trợ số 7 cởi mở hơn. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 7 có thể cảm thấy số 3 quá phân tán hoặc thiếu trách nhiệm, trong khi số 3 có thể thấy số 7 quá xa cách hoặc nghiêm túc. Sự khác biệt trong ưu tiên (nội tâm vs. biểu đạt) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa tư duy và sáng tạo có thể tạo ra một gia đình hạnh phúc và năng động. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 ưu tiên riêng tư, số 3 cần biểu đạt. Số 7 cần chia sẻ cảm xúc, còn số 3 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình sáng tạo như làm nghệ thuật hoặc tri thức như đọc sách để tăng sự gắn kết. Số 7 cần cởi mở hơn, còn số 3 nên cam kết hơn với trách nhiệm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học sáng tạo hoặc tổ chức chuyến đi gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 7 (Nhà hiền triết) và số 3 (Nhà sáng tạo) có thể hiệu quả trong các dự án cần sự cân bằng giữa phân tích và sáng tạo. Số 7 mang đến sự sâu sắc, tri thức và tư duy logic, trong khi số 3 cung cấp sự lạc quan, biểu đạt và ý tưởng sáng tạo. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 7 mang lại sự phân tích và chiều sâu tư duy, trong khi số 3 đảm bảo sự thu hút và ý tưởng mới mẻ. Họ bổ sung cho nhau, với số 7 cung cấp nghiên cứu và số 3 mang lại biểu đạt. Khả năng học hỏi lẫn nhau giúp số 7 cởi mở hơn và số 3 tập trung hơn.",
        "weaknesses": "Số 7 có thể cảm thấy số 3 quá phân tán hoặc thiếu kỷ luật, trong khi số 3 có thể thấy số 7 quá nghiêm túc hoặc chậm chạp. Sự khác biệt trong phong cách làm việc (phân tích vs. sáng tạo) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như thiết kế, truyền thông hoặc giáo dục. Sự kết hợp giữa phân tích và sáng tạo có thể dẫn đến những kết quả độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 7 độc lập và phân tích định hướng, số 3 tự do và sáng tạo định hướng. Số 7 cần tôn trọng ý tưởng của số 3, còn số 3 cần tôn trọng tiến độ của số 7. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 7 tập trung vào phân tích và số 3 xử lý sáng tạo. Số 7 cần khuyến khích ý tưởng của số 3, còn số 3 nên tôn trọng tiến độ của số 7. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo sáng tạo hoặc brain-storming có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 7 (Nhà hiền triết) và số 4 (Nhà xây dựng) là sự kết hợp giữa sự sâu sắc và sự ổn định. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 4 cung cấp sự đáng tin cậy, kỷ luật và thực tế. Sự tương phản này có thể tạo ra một tình yêu bền vững nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 7 mang lại sự sâu sắc và tư duy phân tích, trong khi số 4 bổ sung bằng sự an toàn và cấu trúc. Họ có thể hỗ trợ nhau, với số 7 giúp số 4 suy ngẫm sâu hơn và số 4 khuyến khích số 7 thực tế hơn. Sự kết hợp này có thể tạo ra một mối quan hệ cân bằng nếu cả hai nỗ lực.",
        "weaknesses": "Số 7 có thể cảm thấy số 4 quá cứng nhắc hoặc nhàm chán, trong khi số 4 có thể thấy số 7 quá xa cách hoặc thiếu thực tế. Sự khác biệt trong ưu tiên (nội tâm vs. cấu trúc) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa tư duy và ổn định có thể tạo ra một tình yêu ý nghĩa. Việc cùng tham gia các hoạt động tri thức hoặc thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 cần thời gian riêng tư, số 4 hướng tới cấu trúc. Số 7 cần cởi mở hơn, còn số 4 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động tri thức như thảo luận sách hoặc thực tế như lập kế hoạch để tăng sự gắn kết. Số 7 cần bày tỏ cảm xúc, còn số 4 nên cởi mở hơn với suy ngẫm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như khám phá thành phố hoặc làm đồ thủ công có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nHôn nhân giữa số 7 (Nhà hiền triết) và số 4 (Nhà xây dựng) mang đến sự kết hợp giữa sự sâu sắc và sự ổn định, nhưng đối mặt với thử thách do khác biệt trong phong cách sống. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 4 cung cấp sự đáng tin cậy, kỷ luật và khả năng xây dựng. Sự tương phản này có thể tạo ra một gia đình bền vững nhưng cần nỗ lực để duy trì hòa hợp.",
        "strengths": "Số 7 tạo ra một môi trường gia đình sâu sắc và tư duy, trong khi số 4 mang lại sự an toàn và tổ chức. Họ có thể bổ sung cho nhau, với số 7 giúp số 4 suy ngẫm và số 4 hỗ trợ số 7 thực tế hơn. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 7 có thể cảm thấy số 4 quá cứng nhắc hoặc thiếu chiều sâu, trong khi số 4 có thể thấy số 7 quá xa cách hoặc thiếu cam kết. Sự khác biệt trong ưu tiên (nội tâm vs. cấu trúc) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa tư duy và ổn định có thể tạo ra một gia đình hạnh phúc. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 ưu tiên riêng tư, số 4 cần cấu trúc. Số 7 cần chia sẻ cảm xúc, còn số 4 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình thực tế như lập ngân sách hoặc tri thức như đọc sách để tăng sự gắn kết. Số 7 cần cởi mở hơn, còn số 4 nên tham gia các hoạt động suy ngẫm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như cắm trại hoặc tham gia lớp học kỹ năng có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 7 (Nhà hiền triết) và số 4 (Nhà xây dựng) có thể hiệu quả trong các dự án cần sự cân bằng giữa phân tích và thực tế. Số 7 mang đến sự sâu sắc, tri thức và tư duy logic, trong khi số 4 cung cấp sự đáng tin cậy, kỷ luật và khả năng thực hiện. Sự tương phản này tạo nên một đội nhóm năng động, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 7 mang lại sự phân tích và chiều sâu tư duy, trong khi số 4 đảm bảo tiến độ và chất lượng bằng sự kỷ luật. Họ bổ sung cho nhau, với số 7 cung cấp nghiên cứu và số 4 mang lại cấu trúc. Khả năng học hỏi lẫn nhau giúp số 7 thực tế hơn và số 4 sâu sắc hơn.",
        "weaknesses": "Số 7 có thể cảm thấy số 4 quá cứng nhắc hoặc thiếu chiều sâu, trong khi số 4 có thể thấy số 7 quá chậm chạp hoặc xa cách. Sự khác biệt trong phong cách làm việc (phân tích vs. cấu trúc) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghiên cứu, công nghệ hoặc quản lý dự án. Sự kết hợp giữa phân tích và thực tế có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 7 độc lập và phân tích định hướng, số 4 kỷ luật và nhiệm vụ định hướng. Số 7 cần cởi mở với kế hoạch, còn số 4 cần tôn trọng tiến độ của số 7. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 7 tập trung vào phân tích và số 4 xử lý thực hiện. Số 7 cần khuyến khích kế hoạch của số 4, còn số 4 nên tôn trọng tiến độ của số 7. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo chiến lược hoặc lập kế hoạch dự án có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 7 (Nhà hiền triết) và số 5 (Nhà phiêu lưu) là sự kết hợp của sự sâu sắc và sự tự do. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 5 cung cấp sự linh hoạt, năng lượng và tinh thần khám phá. Sự tương đồng về tính tò mò tạo nên một tình yêu phong phú và đầy cảm hứng.",
        "strengths": "Số 7 mang lại sự sâu sắc và tư duy triết học, trong khi số 5 bổ sung bằng sự táo bạo và khả năng thích nghi. Họ hỗ trợ nhau, với số 7 giúp số 5 suy ngẫm sâu hơn và số 5 khuyến khích số 7 khám phá thế giới bên ngoài. Sự kết hợp này tạo ra một mối quan hệ thú vị và ý nghĩa.",
        "weaknesses": "Số 7 có thể cảm thấy số 5 quá bốc đồng hoặc thiếu chiều sâu, trong khi số 5 có thể thấy số 7 quá xa cách hoặc nghiêm túc. Sự khác biệt trong ưu tiên (nội tâm vs. tự do) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu sâu sắc nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa suy ngẫm và tự do có thể tạo ra một mối quan hệ phong phú. Việc cùng tham gia các hoạt động tinh thần hoặc phiêu lưu sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 cần thời gian riêng tư, số 5 ưu tiên tự do. Số 7 cần cởi mở hơn, còn số 5 cần cam kết hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động tinh thần như thiền hoặc phiêu lưu như du lịch để tăng sự gắn kết. Số 7 cần bày tỏ cảm xúc, còn số 5 nên tôn trọng nhu cầu riêng tư của số 7. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi bảo tàng hoặc trò chuyện sâu sắc có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nHôn nhân giữa số 7 (Nhà hiền triết) và số 5 (Nhà phiêu lưu) mang đến sự kết hợp giữa sự sâu sắc và sự tự do, tạo nên một gia đình độc đáo và ý nghĩa. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 5 cung cấp sự linh hoạt, năng lượng và tinh thần khám phá. Sự tương đồng về tính tò mò giúp họ xây dựng một mái ấm phong phú, nhưng cần sự cân bằng để duy trì hòa hợp.",
        "strengths": "Số 7 tạo ra một môi trường gia đình sâu sắc và tư duy, trong khi số 5 mang lại sự táo bạo và năng lượng tích cực. Họ bổ sung cho nhau, với số 7 giúp số 5 suy ngẫm sâu hơn và số 5 khuyến khích số 7 khám phá. Khả năng hỗ trợ lẫn nhau trong các hoạt động tinh thần là điểm mạnh lớn.",
        "weaknesses": "Số 7 có thể cảm thấy số 5 quá bốc đồng hoặc thiếu chiều sâu, trong khi số 5 có thể thấy số 7 quá xa cách hoặc nghiêm túc. Sự khác biệt trong ưu tiên (nội tâm vs. tự do) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa suy ngẫm và tự do có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động tinh thần sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 ưu tiên riêng tư, số 5 cần tự do. Số 7 cần chia sẻ cảm xúc, còn số 5 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình tinh thần như thiền hoặc phiêu lưu như đi du lịch để tăng sự gắn kết. Số 7 cần cởi mở hơn, còn số 5 nên cam kết hơn với trách nhiệm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học triết học hoặc tổ chức chuyến đi gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 7 (Nhà hiền triết) và số 5 (Nhà phiêu lưu) là sự kết hợp mạnh mẽ của sự phân tích và sáng tạo. Số 7 mang đến sự sâu sắc, tri thức và tư duy logic, trong khi số 5 cung cấp sự linh hoạt, ý tưởng mới mẻ và năng lượng. Sự tương đồng về tính tò mò tạo nên một đội nhóm độc đáo, với tiềm năng đạt được những kết quả ấn tượng.",
        "strengths": "Số 7 mang lại sự phân tích và chiều sâu tư duy, trong khi số 5 đảm bảo sự sáng tạo và khả năng thích nghi. Họ bổ sung cho nhau, với số 7 cung cấp nghiên cứu và số 5 truyền cảm hứng khám phá. Khả năng phối hợp trong các dự án sáng tạo và nghiên cứu giúp họ đạt được thành công lớn.",
        "weaknesses": "Số 7 có thể cảm thấy số 5 quá bốc đồng hoặc thiếu chiều sâu, trong khi số 5 có thể thấy số 7 quá chậm chạp hoặc xa cách. Sự khác biệt trong phong cách làm việc (phân tích vs. tự do) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghiên cứu, truyền thông hoặc tư vấn. Sự kết hợp giữa phân tích và sáng tạo có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 7 độc lập và phân tích định hướng, số 5 tự do và ý tưởng định hướng. Số 7 cần cởi mở với ý tưởng mới, còn số 5 cần tôn trọng tiến độ của số 7. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 7 tập trung vào phân tích và số 5 xử lý sáng tạo. Số 7 cần khuyến khích ý tưởng của số 5, còn số 5 nên tôn trọng tiến độ của số 7. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo nghiên cứu hoặc brain-storming có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nMối quan hệ giữa số 7 (Nhà hiền triết) và số 6 (Nhà chăm sóc) là sự kết hợp giữa sự sâu sắc và tình yêu thương. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 6 cung cấp sự chu đáo, trách nhiệm và tình cảm sâu sắc. Sự tương phản này có thể tạo ra một tình yêu phong phú nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 7 mang lại sự sâu sắc và tư duy phân tích, trong khi số 6 bổ sung bằng sự thấu hiểu và an toàn cảm xúc. Họ có thể hỗ trợ nhau, với số 7 giúp số 6 suy ngẫm sâu hơn và số 6 khuyến khích số 7 cởi mở hơn về cảm xúc. Sự kết hợp này có thể tạo ra một mối quan hệ cân bằng nếu cả hai nỗ lực.",
        "weaknesses": "Số 7 có thể cảm thấy số 6 quá kiểm soát hoặc nhạy cảm, trong khi số 6 có thể thấy số 7 quá xa cách hoặc thiếu cảm xúc. Sự khác biệt trong ưu tiên (nội tâm vs. cảm xúc) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa tư duy và chăm sóc có thể tạo ra một tình yêu sâu sắc. Việc cùng tham gia các hoạt động tri thức hoặc chăm sóc sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 cần thời gian riêng tư, số 6 ưu tiên cảm xúc. Số 7 cần bày tỏ cảm xúc, còn số 6 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động tri thức như đọc sách hoặc chăm sóc như nấu ăn chung để tăng sự gắn kết. Số 7 cần cởi mở hơn về cảm xúc, còn số 6 nên tôn trọng nhu cầu riêng tư của số 7. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tổ chức bữa tối hoặc đi công viên có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 7 (Nhà hiền triết) và số 6 (Nhà chăm sóc) mang đến sự kết hợp giữa sự sâu sắc và tình yêu thương, nhưng đối mặt với thử thách do khác biệt trong phong cách sống. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 6 cung cấp sự chu đáo, tình yêu thương và hòa giải. Sự tương phản này có thể tạo ra một gia đình độc đáo nhưng cần nỗ lực để duy trì hòa hợp.",
        "strengths": "Số 7 tạo ra một môi trường gia đình sâu sắc và tư duy, trong khi số 6 mang lại sự ấm áp và an toàn cảm xúc. Họ có thể bổ sung cho nhau, với số 7 giúp số 6 suy ngẫm và số 6 hỗ trợ số 7 cởi mở hơn. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 7 có thể cảm thấy số 6 quá kiểm soát hoặc nhạy cảm, trong khi số 6 có thể thấy số 7 quá xa cách hoặc thiếu trách nhiệm. Sự khác biệt trong ưu tiên (nội tâm vs. cảm xúc) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa tư duy và chăm sóc có thể tạo ra một gia đình hạnh phúc. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động chăm sóc sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 ưu tiên riêng tư, số 6 cần cảm xúc. Số 7 cần chia sẻ cảm xúc, còn số 6 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình chăm sóc như làm vườn hoặc tri thức như đọc sách để tăng sự gắn kết. Số 7 cần cởi mở hơn, còn số 6 nên tham gia các hoạt động suy ngẫm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia từ thiện hoặc tổ chức chuyến đi gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 7 (Nhà hiền triết) và số 6 (Nhà chăm sóc) có thể hiệu quả trong các dự án cần sự cân bằng giữa phân tích và chăm sóc. Số 7 mang đến sự sâu sắc, tri thức và tư duy logic, trong khi số 6 cung cấp sự chu đáo, trách nhiệm và khả năng xây dựng mối quan hệ. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 7 mang lại sự phân tích và chiều sâu tư duy, trong khi số 6 đảm bảo hòa khí và xây dựng mối quan hệ. Họ bổ sung cho nhau, với số 7 cung cấp nghiên cứu và số 6 mang lại sự hỗ trợ. Khả năng học hỏi lẫn nhau giúp số 7 cởi mở hơn và số 6 sâu sắc hơn.",
        "weaknesses": "Số 7 có thể cảm thấy số 6 quá kiểm soát hoặc nhạy cảm, trong khi số 6 có thể thấy số 7 quá xa cách hoặc thiếu kỷ luật. Sự khác biệt trong phong cách làm việc (phân tích vs. người định hướng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như giáo dục, tư vấn hoặc dịch vụ cộng đồng. Sự kết hợp giữa phân tích và chăm sóc có thể dẫn đến những kết quả ý nghĩa. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 7 độc lập và phân tích định hướng, số 6 cẩn thận và người định hướng. Số 7 cần tôn trọng ý kiến của số 6, còn số 6 cần tự tin đóng góp ý tưởng. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 7 tập trung vào phân tích và số 6 xử lý quan hệ đối ngoại. Số 7 cần khuyến khích ý kiến của số 6, còn số 6 nên tôn trọng tiến độ của số 7. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo đội nhóm hoặc dự án cộng đồng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa hai số 7 (Nhà hiền triết) là sự kết hợp của sự sâu sắc và nội tâm. Cả hai đều tò mò, thích khám phá những khía cạnh sâu xa của cuộc sống và trân trọng sự suy ngẫm, tạo nên một tình yêu sâu sắc và đầy ý nghĩa. Sự tương đồng này giúp họ dễ dàng đồng điệu, nhưng có thể thiếu sự năng động nếu không có sự cân bằng.",
        "strengths": "Cả hai đều mang lại sự sâu sắc và tư duy phân tích, tạo ra một mối quan hệ kích thích trí tuệ và tinh thần. Họ giỏi hỗ trợ nhau trong các hoạt động suy ngẫm và tôn trọng nhu cầu riêng tư của nhau. Sự tương đồng trong phong cách sống giúp họ dễ dàng tận hưởng thời gian bên nhau.",
        "weaknesses": "Cả hai có thể quá khép kín hoặc thiếu cởi mở về cảm xúc, dẫn đến việc khó duy trì sự kết nối sâu sắc. Sự thiếu năng lượng xã hội có thể khiến mối quan hệ trở nên đơn điệu nếu không có sự kích thích từ bên ngoài.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu sâu sắc nếu cả hai học cách cởi mở hơn. Sự kết hợp giữa hai nhà hiền triết có thể tạo ra một mối quan hệ phong phú. Việc cùng tham gia các hoạt động tinh thần hoặc khám phá sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là xu hướng khép kín và thiếu giao tiếp cảm xúc. Cả hai cần học cách bày tỏ cảm xúc và tạo sự năng động. Việc quá tập trung vào nội tâm có thể khiến một bên cảm thấy cô đơn nếu không giao tiếp rõ ràng.",
        "suggestions": "Cả hai nên tham gia các hoạt động tinh thần như thiền, đọc sách hoặc khám phá như du lịch để tăng sự gắn kết. Cần bày tỏ cảm xúc và tổ chức các buổi trò chuyện định kỳ để chia sẻ mong muốn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi bảo tàng hoặc thảo luận triết học có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nHôn nhân giữa hai số 7 (Nhà hiền triết) mang đến một gia đình sâu sắc và đầy ý nghĩa, nhưng cần nỗ lực để duy trì sự năng động. Cả hai đều tò mò, thích khám phá những khía cạnh sâu xa của cuộc sống và trân trọng sự suy ngẫm, tạo nên một mái ấm kích thích trí tuệ. Sự tương đồng này giúp họ dễ dàng đồng điệu, nhưng cần sự cân bằng để tránh sự đơn điệu.",
        "strengths": "Cả hai đều mang lại sự sâu sắc và tư duy phân tích, tạo ra một môi trường gia đình kích thích trí tuệ và tinh thần. Họ giỏi hỗ trợ nhau trong các hoạt động suy ngẫm và tôn trọng nhu cầu riêng tư của nhau. Sự tương đồng trong phong cách sống giúp họ tận hưởng thời gian bên nhau.",
        "weaknesses": "Cả hai có thể quá khép kín hoặc thiếu cởi mở về cảm xúc, dẫn đến việc khó duy trì sự kết nối sâu sắc. Sự thiếu năng lượng xã hội có thể khiến gia đình trở nên đơn điệu nếu không có sự kích thích từ bên ngoài.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cởi mở hơn. Sự kết hợp giữa hai nhà hiền triết có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động tinh thần sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là xu hướng khép kín và thiếu giao tiếp cảm xúc. Cả hai cần học cách bày tỏ cảm xúc và tạo sự năng động. Việc quá tập trung vào nội tâm có thể khiến gia đình thiếu sự kết nối nếu không có sự phối hợp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình tinh thần như thiền hoặc khám phá như đi du lịch để tăng sự gắn kết. Cần bày tỏ cảm xúc và tổ chức các buổi trò chuyện định kỳ để chia sẻ mong muốn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học triết học hoặc tổ chức buổi trò chuyện sâu sắc có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa hai số 7 (Nhà hiền triết) là sự kết hợp mạnh mẽ của sự sâu sắc và tri thức. Cả hai đều tò mò, thích khám phá những khía cạnh sâu xa và trân trọng sự suy ngẫm, tạo nên một đội nhóm kích thích trí tuệ và tinh thần. Sự tương đồng này giúp họ dễ dàng phối hợp, nhưng có thể thiếu sự năng động nếu không có sự kích thích từ bên ngoài.",
        "strengths": "Cả hai đều mang lại sự phân tích và chiều sâu tư duy, giúp đội nhóm tạo ra những giải pháp chất lượng cao. Họ giỏi hỗ trợ nhau trong các dự án nghiên cứu và tôn trọng nhu cầu độc lập của nhau. Sự tương đồng trong phong cách làm việc giúp họ tận hưởng quá trình hợp tác.",
        "weaknesses": "Cả hai có thể quá khép kín hoặc thiếu quyết đoán, dẫn đến việc khó đưa ra quyết định nhanh chóng. Sự thiếu năng lượng sáng tạo có thể khiến dự án trở nên chậm trễ nếu không có sự kích thích từ bên ngoài.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghiên cứu, giáo dục hoặc tư vấn. Sự kết hợp giữa hai nhà hiền triết có thể dẫn đến những kết quả ấn tượng. Việc tìm một người năng động để hỗ trợ sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là xu hướng khép kín và thiếu giao tiếp nhanh chóng. Cả hai cần học cách đưa ra quyết định và tạo sự năng động. Việc quá tập trung vào phân tích có thể khiến dự án bị trì hoãn nếu không có sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng và tìm một người năng động để hỗ trợ. Cần đặt ra tiến độ và tôn trọng kế hoạch. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo nghiên cứu hoặc brain-storming có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nMối quan hệ giữa số 7 (Nhà hiền triết) và số 8 (Nhà quyền lực) là sự kết hợp giữa sự sâu sắc và tham vọng. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 8 cung cấp sự quyết đoán, tham vọng và định hướng thành công. Sự tương phản này có thể tạo ra một mối quan hệ hấp dẫn nhưng khó duy trì do khác biệt lớn trong ưu tiên.",
        "strengths": "Số 7 mang lại sự sâu sắc và tư duy phân tích, trong khi số 8 bổ sung bằng sự tự tin và tầm nhìn chiến lược. Họ có thể học hỏi lẫn nhau, với số 7 giúp số 8 suy ngẫm sâu hơn và số 8 khuyến khích số 7 hành động. Sự kết hợp này có thể tạo ra một mối quan hệ kích thích nếu cả hai cởi mở.",
        "weaknesses": "Số 7 có thể cảm thấy số 8 quá kiểm soát hoặc thiếu chiều sâu, trong khi số 8 có thể thấy số 7 quá xa cách hoặc thiếu tham vọng. Sự khác biệt trong ưu tiên (nội tâm vs. mục tiêu) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa tư duy và lãnh đạo có thể tạo ra một tình yêu độc đáo. Việc cùng tham gia các hoạt động tri thức hoặc lập kế hoạch sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 cần thời gian riêng tư, số 8 hướng tới thành công. Số 7 cần cởi mở hơn, còn số 8 cần kiên nhẫn hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động tri thức như thảo luận sách hoặc lập kế hoạch như quản lý tài chính để tăng sự gắn kết. Số 7 cần bày tỏ cảm xúc, còn số 8 nên tôn trọng nhu cầu riêng tư của số 7. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi du lịch hoặc tổ chức bữa tối có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 50,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 7 (Nhà hiền triết) và số 8 (Nhà quyền lực) đối mặt với nhiều thử thách do sự khác biệt trong phong cách sống. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 8 cung cấp sự quyết đoán, tham vọng và ổn định tài chính. Sự tương phản này có thể tạo ra một gia đình năng động nhưng cần nỗ lực lớn để duy trì hòa hợp.",
        "strengths": "Số 7 tạo ra một môi trường gia đình sâu sắc và tư duy, trong khi số 8 mang lại sự an toàn và định hướng thành công. Họ có thể bổ sung cho nhau, với số 7 giúp số 8 suy ngẫm và số 8 hỗ trợ số 7 thực tế hơn. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 7 có thể cảm thấy số 8 quá kiểm soát hoặc thiếu chiều sâu, trong khi số 8 có thể thấy số 7 quá xa cách hoặc thiếu tham vọng. Sự khác biệt trong ưu tiên (nội tâm vs. sự nghiệp) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa tư duy và lãnh đạo có thể tạo ra một gia đình hạnh phúc và thành công. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động lập kế hoạch sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 ưu tiên riêng tư, số 8 tập trung vào mục tiêu. Số 7 cần chia sẻ cảm xúc, còn số 8 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình lập kế hoạch như quản lý tài chính hoặc tri thức như đọc sách để tăng sự gắn kết. Số 7 cần cởi mở hơn, còn số 8 nên tham gia các hoạt động suy ngẫm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học kỹ năng hoặc tổ chức sự kiện gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nSự hợp tác giữa số 7 (Nhà hiền triết) và số 8 (Nhà quyền lực) có thể gặp khó khăn do sự khác biệt trong phong cách làm việc. Số 7 mang đến sự sâu sắc, tri thức và tư duy logic, trong khi số 8 cung cấp sự quyết đoán, tham vọng và tầm nhìn chiến lược. Sự tương phản này có thể tạo ra một đội nhóm độc đáo nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 7 mang lại sự phân tích và chiều sâu tư duy, trong khi số 8 đảm bảo tiến độ và chất lượng bằng sự quyết đoán. Họ có thể bổ sung cho nhau, với số 7 cung cấp nghiên cứu và số 8 mang lại chiến lược. Khả năng học hỏi lẫn nhau giúp số 7 thực tế hơn và số 8 sâu sắc hơn.",
        "weaknesses": "Số 7 có thể cảm thấy số 8 quá kiểm soát hoặc thiếu chiều sâu, trong khi số 8 có thể thấy số 7 quá chậm chạp hoặc xa cách. Sự khác biệt trong phong cách làm việc (phân tích vs. mục tiêu) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như kinh doanh, nghiên cứu hoặc tư vấn. Sự kết hợp giữa phân tích và chiến lược có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 7 độc lập và phân tích định hướng, số 8 tham vọng và mục tiêu định hướng. Số 7 cần cởi mở với ý tưởng lớn, còn số 8 cần tôn trọng tiến độ của số 7. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 7 tập trung vào phân tích và số 8 xử lý chiến lược. Số 7 cần khuyến khích ý tưởng của số 8, còn số 8 nên tôn trọng tiến độ của số 7. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo kinh doanh hoặc lập kế hoạch dự án có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 7 (Nhà hiền triết) và số 9 (Nhà nhân đạo) là sự kết hợp của sự sâu sắc và lòng nhân ái. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 9 cung cấp sự lý tưởng, nhân ái và khả năng truyền cảm hứng. Sự tương đồng về tính tò mò và khát vọng tạo nên một tình yêu phong phú và đầy cảm hứng.",
        "strengths": "Số 7 mang lại sự sâu sắc và tư duy phân tích, trong khi số 9 bổ sung bằng sự nhiệt huyết và tầm nhìn lớn. Họ hỗ trợ nhau, với số 7 giúp số 9 củng cố ý tưởng bằng logic và số 9 khuyến khích số 7 hướng tới mục tiêu ý nghĩa. Sự kết hợp này tạo ra một mối quan hệ sâu sắc và ý nghĩa.",
        "weaknesses": "Số 7 có thể cảm thấy số 9 quá lý tưởng hoặc thiếu thực tế, trong khi số 9 có thể thấy số 7 quá xa cách hoặc thiếu cảm xúc. Sự khác biệt trong ưu tiên (nội tâm vs. lý tưởng) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu sâu sắc nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa tư duy và nhân ái có thể tạo ra một mối quan hệ phong phú. Việc cùng tham gia các hoạt động cộng đồng hoặc tri thức sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 cần thời gian riêng tư, số 9 hướng tới lý tưởng. Số 7 cần cởi mở hơn, còn số 9 cần thực tế hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động cộng đồng như tình nguyện hoặc tri thức như đọc sách để tăng sự gắn kết. Số 7 cần bày tỏ cảm xúc, còn số 9 nên cởi mở hơn với suy ngẫm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tham gia sự kiện xã hội hoặc trò chuyện sâu sắc có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nHôn nhân giữa số 7 (Nhà hiền triết) và số 9 (Nhà nhân đạo) mang đến sự kết hợp giữa sự sâu sắc và lòng nhân ái, tạo nên một gia đình ý nghĩa và năng động. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 9 cung cấp sự lý tưởng, nhân ái và tầm nhìn lớn. Sự tương đồng về khát vọng giúp họ xây dựng một mái ấm phong phú, nhưng cần sự cân bằng để duy trì hòa hợp.",
        "strengths": "Số 7 tạo ra một môi trường gia đình sâu sắc và tư duy, trong khi số 9 mang lại sự nhiệt huyết và ý nghĩa. Họ bổ sung cho nhau, với số 7 giúp số 9 thực tế hơn và số 9 hỗ trợ số 7 hướng tới mục tiêu lớn. Khả năng hỗ trợ lẫn nhau trong các hoạt động cộng đồng là điểm mạnh lớn.",
        "weaknesses": "Số 7 có thể cảm thấy số 9 quá lý tưởng hoặc bỏ qua gia đình, trong khi số 9 có thể thấy số 7 quá xa cách hoặc thiếu cảm xúc. Sự khác biệt trong ưu tiên (nội tâm vs. lý tưởng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa tư duy và nhân ái có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động cộng đồng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 ưu tiên riêng tư, số 9 cần lý tưởng. Số 7 cần chia sẻ cảm xúc, còn số 9 cần thực tế hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình ý nghĩa như tham gia từ thiện hoặc tri thức như đọc sách để tăng sự gắn kết. Số 7 cần cởi mở hơn, còn số 9 nên tham gia các hoạt động thực tế. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia dự án xã hội hoặc trò chuyện về mục tiêu có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 7 (Nhà hiền triết) và số 9 (Nhà nhân đạo) là sự kết hợp mạnh mẽ của sự phân tích và lý tưởng. Số 7 mang đến sự sâu sắc, tri thức và tư duy logic, trong khi số 9 cung cấp sự lý tưởng, nhân ái và tầm nhìn lớn. Sự tương đồng về khát vọng tạo nên một đội nhóm độc đáo, với tiềm năng đạt được những kết quả ý nghĩa.",
        "strengths": "Số 7 mang lại sự phân tích và chiều sâu tư duy, trong khi số 9 đảm bảo tầm nhìn lớn và nhiệt huyết. Họ bổ sung cho nhau, với số 7 cung cấp nghiên cứu và số 9 truyền cảm hứng ý nghĩa. Khả năng phối hợp trong các dự án cộng đồng giúp họ đạt được thành công lớn.",
        "weaknesses": "Số 7 có thể cảm thấy số 9 quá lý tưởng hoặc thiếu kỷ luật, trong khi số 9 có thể thấy số 7 quá xa cách hoặc thiếu cảm xúc. Sự khác biệt trong phong cách làm việc (phân tích vs. lý tưởng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như từ thiện, giáo dục hoặc truyền thông. Sự kết hợp giữa phân tích và nhân ái có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 7 độc lập và phân tích định hướng, số 9 lý tưởng và mục tiêu định hướng. Số 7 cần cởi mở với ý tưởng lớn, còn số 9 cần thực tế hơn. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 7 tập trung vào phân tích và số 9 xử lý tầm nhìn. Số 7 cần khuyến khích ý tưởng của số 9, còn số 9 nên tôn trọng tiến độ của số 7. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia dự án xã hội hoặc hội thảo cộng đồng có thể tăng sự gắn kết."
      }
    },
     {
      "partnerNumber": 11,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nMối quan hệ giữa số 7 (Nhà hiền triết) và số 11 (Nhà truyền cảm hứng) là sự kết hợp mạnh mẽ giữa sự sâu sắc và trực giác tinh thần. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 11 cung cấp sự nhạy bén, lý tưởng và khả năng truyền cảm hứng. Sự tương đồng về tính tò mò tinh thần tạo nên một tình yêu sâu sắc và đầy ý nghĩa.",
        "strengths": "Số 7 mang lại sự sâu sắc và tư duy phân tích, trong khi số 11 bổ sung bằng sự trực giác và tầm nhìn tinh thần. Họ hỗ trợ nhau, với số 7 giúp số 11 củng cố ý tưởng bằng logic và số 11 khuyến khích số 7 khám phá trực giác. Sự kết hợp này tạo ra một mối quan hệ phong phú và kích thích trí tuệ.",
        "weaknesses": "Số 7 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu thực tế, trong khi số 11 có thể thấy số 7 quá xa cách hoặc nghiêm túc. Sự khác biệt trong phong cách (phân tích vs. trực giác) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu sâu sắc nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa tư duy và trực giác có thể tạo ra một mối quan hệ đầy cảm hứng. Việc cùng tham gia các hoạt động tinh thần hoặc tri thức sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 cần thời gian riêng tư, số 11 hướng tới lý tưởng. Số 7 cần cởi mở hơn, còn số 11 cần thực tế hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động tinh thần như thiền, đọc sách hoặc thảo luận triết học để tăng sự gắn kết. Số 7 cần bày tỏ cảm xúc, còn số 11 nên tôn trọng nhu cầu riêng tư của số 7. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi bảo tàng hoặc tham gia hội thảo tâm lý có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nHôn nhân giữa số 7 (Nhà hiền triết) và số 11 (Nhà truyền cảm hứng) mang đến sự kết hợp giữa sự sâu sắc và trực giác tinh thần, tạo nên một gia đình ý nghĩa và kích thích trí tuệ. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 11 cung cấp sự nhạy bén, lý tưởng và tầm nhìn tinh thần. Sự tương đồng về tính tò mò tinh thần giúp họ xây dựng một mái ấm phong phú, nhưng cần sự cân bằng để duy trì hòa hợp.",
        "strengths": "Số 7 tạo ra một môi trường gia đình sâu sắc và tư duy, trong khi số 11 mang lại sự trực giác và chiều sâu tinh thần. Họ bổ sung cho nhau, với số 7 giúp số 11 thực tế hơn và số 11 khuyến khích số 7 khám phá trực giác. Khả năng hỗ trợ lẫn nhau trong các hoạt động tinh thần là điểm mạnh lớn.",
        "weaknesses": "Số 7 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu cam kết, trong khi số 11 có thể thấy số 7 quá xa cách hoặc thiếu cảm xúc. Sự khác biệt trong ưu tiên (phân tích vs. trực giác) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa tư duy và trực giác có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động tinh thần sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 ưu tiên riêng tư, số 11 cần trực giác. Số 7 cần chia sẻ cảm xúc, còn số 11 cần thực tế hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình tinh thần như thiền hoặc đọc sách để tăng sự gắn kết. Số 7 cần tham gia các hoạt động trực giác, còn số 11 nên tôn trọng nhu cầu riêng tư của số 7. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học triết học hoặc tổ chức buổi trò chuyện sâu sắc có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nSự hợp tác giữa số 7 (Nhà hiền triết) và số 11 (Nhà truyền cảm hứng) là sự kết hợp mạnh mẽ của sự phân tích và trực giác tinh thần. Số 7 mang đến sự sâu sắc, tri thức và tư duy logic, trong khi số 11 cung cấp sự nhạy bén, lý tưởng và khả năng truyền cảm hứng. Sự tương đồng về tính tò mò tinh thần tạo nên một đội nhóm xuất sắc, với tiềm năng đạt được những kết quả ấn tượng.",
        "strengths": "Số 7 mang lại sự phân tích và khả năng nghiên cứu, trong khi số 11 đảm bảo chất lượng bằng trực giác tinh thần. Họ bổ sung cho nhau, với số 7 cung cấp cấu trúc logic và số 11 truyền cảm hứng lý tưởng. Khả năng phối hợp trong các dự án nghiên cứu hoặc tinh thần giúp họ đạt được thành công lớn.",
        "weaknesses": "Số 7 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu kỷ luật, trong khi số 11 có thể thấy số 7 quá chậm chạp hoặc xa cách. Sự khác biệt trong phong cách làm việc (phân tích vs. trực giác) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghiên cứu, tư vấn hoặc giáo dục tinh thần. Sự kết hợp giữa phân tích và trực giác có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 7 độc lập và phân tích định hướng, số 11 trực giác và ý tưởng định hướng. Số 7 cần cởi mở với ý tưởng mới, còn số 11 cần tôn trọng tiến độ của số 7. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 7 tập trung vào phân tích và số 11 xử lý sáng tạo. Số 7 cần khuyến khích ý tưởng của số 11, còn số 11 nên tôn trọng tiến độ của số 7. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo nghiên cứu hoặc dự án tinh thần có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nMối quan hệ giữa số 7 (Nhà hiền triết) và số 22 (Nhà kiến tạo vĩ đại) là sự kết hợp giữa sự sâu sắc và tham vọng thực tế. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 22 cung cấp sự kỷ luật, tầm nhìn chiến lược và khả năng hiện thực hóa ý tưởng lớn. Sự tương phản này có thể tạo ra một tình yêu độc đáo nhưng khó duy trì do khác biệt trong ưu tiên.",
        "strengths": "Số 7 mang lại sự sâu sắc và tư duy phân tích, trong khi số 22 bổ sung bằng sự ổn định và khả năng thực hiện. Họ có thể học hỏi lẫn nhau, với số 7 giúp số 22 suy ngẫm sâu hơn và số 22 khuyến khích số 7 hướng tới mục tiêu lớn hơn. Sự kết hợp này có thể tạo ra một mối quan hệ phong phú nếu cả hai nỗ lực.",
        "weaknesses": "Số 7 có thể cảm thấy số 22 quá nghiêm túc hoặc áp đảo, trong khi số 22 có thể thấy số 7 quá xa cách hoặc thiếu thực tế. Sự khác biệt trong ưu tiên (nội tâm vs. cấu trúc) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa tư duy và tham vọng có thể tạo ra một tình yêu ý nghĩa. Việc cùng tham gia các hoạt động tri thức hoặc lập kế hoạch sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 cần thời gian riêng tư, số 22 hướng tới cấu trúc. Số 7 cần cởi mở hơn, còn số 22 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu sự thấu hiểu.",
        "suggestions": "Cả hai nên tham gia các hoạt động tri thức như đọc sách hoặc thực tế như lập kế hoạch dự án để tăng sự gắn kết. Số 7 cần bày tỏ cảm xúc, còn số 22 nên tôn trọng nhu cầu riêng tư của số 7. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như thảo luận triết học hoặc tham gia hội thảo kỹ năng có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 7 (Nhà hiền triết) và số 22 (Nhà kiến tạo vĩ đại) mang đến sự kết hợp giữa sự sâu sắc và tham vọng thực tế, nhưng đối mặt với thử thách do khác biệt trong phong cách sống. Số 7 mang đến sự nội tâm, tri thức và tư duy logic, trong khi số 22 cung cấp sự kỷ luật, tầm nhìn chiến lược và khả năng xây dựng. Sự tương phản này có thể tạo ra một gia đình độc đáo nhưng cần nỗ lực để duy trì hòa hợp.",
        "strengths": "Số 7 tạo ra một môi trường gia đình sâu sắc và tư duy, trong khi số 22 mang lại sự ổn định và khả năng thực hiện. Họ có thể bổ sung cho nhau, với số 7 giúp số 22 suy ngẫm sâu hơn và số 22 hỗ trợ số 7 đạt được mục tiêu lớn. Khả năng học hỏi lẫn nhau là điểm mạnh nếu cả hai cởi mở.",
        "weaknesses": "Số 7 có thể cảm thấy số 22 quá nghiêm túc hoặc kiểm soát, trong khi số 22 có thể thấy số 7 quá xa cách hoặc thiếu cam kết. Sự khác biệt trong ưu tiên (nội tâm vs. cấu trúc) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa tư duy và tham vọng có thể tạo ra một gia đình hạnh phúc và thành công. Việc cùng xây dựng mục tiêu gia đình hoặc tham gia các hoạt động lập kế hoạch sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách: số 7 ưu tiên riêng tư, số 22 cần cấu trúc. Số 7 cần chia sẻ cảm xúc, còn số 22 cần linh hoạt hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình tri thức như đọc sách hoặc thực tế như lập kế hoạch tài chính để tăng sự gắn kết. Số 7 cần tham gia các mục tiêu lớn, còn số 22 nên tôn trọng nhu cầu riêng tư của số 7. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học kỹ năng hoặc tổ chức buổi trò chuyện sâu sắc có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 7 (Nhà hiền triết) và số 22 (Nhà kiến tạo vĩ đại) có thể hiệu quả trong các dự án cần sự cân bằng giữa phân tích và thực tế. Số 7 mang đến sự sâu sắc, tri thức và tư duy logic, trong khi số 22 cung cấp sự kỷ luật, tầm nhìn chiến lược và khả năng thực hiện. Sự tương phản này tạo nên một đội nhóm năng động, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 7 mang lại sự phân tích và khả năng nghiên cứu, trong khi số 22 đảm bảo tiến độ và chất lượng bằng sự kỷ luật. Họ bổ sung cho nhau, với số 7 cung cấp chiều sâu tư duy và số 22 mang lại cấu trúc. Khả năng học hỏi lẫn nhau giúp số 7 thực tế hơn và số 22 sâu sắc hơn.",
        "weaknesses": "Số 7 có thể cảm thấy số 22 quá nghiêm túc hoặc áp đảo, trong khi số 22 có thể thấy số 7 quá chậm chạp hoặc xa cách. Sự khác biệt trong phong cách làm việc (phân tích vs. cấu trúc) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghiên cứu, công nghệ hoặc quản lý dự án. Sự kết hợp giữa phân tích và thực tế có thể dẫn đến những kết quả độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 7 độc lập và phân tích định hướng, số 22 kỷ luật và mục tiêu định hướng. Số 7 cần cởi mở với ý tưởng lớn, còn số 22 cần tôn trọng tiến độ của số 7. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 7 tập trung vào phân tích và số 22 xử lý thực hiện. Số 7 cần khuyến khích ý tưởng của số 22, còn số 22 nên tôn trọng tiến độ của số 7. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ. Các hoạt động như tham gia hội thảo chiến lược hoặc lập kế hoạch dự án có thể tăng sự gắn kết."
      }
    }
  ]
}