{
  "number": 3,
  "description": "Số đường đời 3 đại diện cho sự sáng tạo, vui tươi và khả năng biểu đạt. Những người mang số 3 thường lạc quan, yêu đời, và có tài năng trong giao tiếp, nghệ thuật hoặc viết lách. Họ thích truyền cảm hứng và mang lại niềm vui cho mọi người, nhưng đôi khi có thể thiếu tập trung hoặc quá bốc đồng. Số 3 cần không gian để thể hiện bản thân và tránh bị kìm hãm bởi sự cứng nhắc.",
  "compatibility": [
    {
      "partnerNumber": 1,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 1 (Nhà lãnh đạo) là sự kết hợp giữa sự vui tươi và tham vọng. Số 3 mang lại năng lượng lạc quan và sáng tạo, trong khi số 1 cung cấp định hướng và sự quyết đoán. Sự tương tác này tạo ra một tình yêu sôi động, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 3 truyền cảm hứng cho số 1 với sự sáng tạo và niềm vui, trong khi số 1 giúp số 3 tập trung và đạt mục tiêu. Họ bổ sung cho nhau, với số 3 làm dịu sự nghiêm túc của số 1 và số 1 mang lại cấu trúc cho số 3. Khả năng tạo ra những khoảnh khắc đáng nhớ là điểm mạnh.",
        "weaknesses": "Số 3 có thể cảm thấy số 1 quá kiểm soát, trong khi số 1 có thể thấy số 3 quá bốc đồng hoặc thiếu nghiêm túc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (niềm vui vs. mục tiêu) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa sáng tạo và lãnh đạo có thể tạo ra một tình yêu phong phú. Việc cùng nhau tham gia các hoạt động sáng tạo hoặc lập kế hoạch sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên niềm vui, số 1 ưu tiên thành công. Số 3 cần tránh bốc đồng quá mức, còn số 1 cần cởi mở hơn với sự tự do. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như sáng tạo nghệ thuật hoặc du lịch để tăng sự gắn kết. Số 3 nên bày tỏ nhu cầu rõ ràng, còn số 1 cần học cách thư giãn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 1 (Nhà lãnh đạo) là sự kết hợp giữa sự lạc quan và định hướng, tạo nên một gia đình sôi động nhưng cần sự cân bằng. Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 1 cung cấp sự ổn định và khả năng lãnh đạo. Sự tương phản này có thể bền vững, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 mang lại không khí vui vẻ và sáng tạo, trong khi số 1 đảm bảo gia đình có cấu trúc và mục tiêu. Họ bổ sung cho nhau, với số 3 làm dịu sự nghiêm túc của số 1 và số 1 giúp số 3 tổ chức hơn. Khả năng truyền cảm hứng lẫn nhau tạo nên một gia đình hạnh phúc.",
        "weaknesses": "Số 3 có thể cảm thấy số 1 quá kiểm soát, trong khi số 1 có thể thấy số 3 thiếu trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (niềm vui vs. trách nhiệm) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ phong phú nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa sáng tạo và lãnh đạo có thể tạo ra một cuộc sống gia đình đầy màu sắc. Việc cùng nhau tham gia các hoạt động sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận trách nhiệm: số 3 tập trung vào hiện tại, số 1 tập trung vào mục tiêu. Số 3 cần chia sẻ trách nhiệm, còn số 1 cần cởi mở hơn với niềm vui. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như trang trí nhà cửa hoặc đi du lịch. Số 3 cần bày tỏ nhu cầu rõ ràng, còn số 1 nên nỗ lực thư giãn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 1 (Nhà lãnh đạo) có thể tạo ra kết quả ấn tượng nhờ sự kết hợp giữa sáng tạo và chiến lược. Số 3 mang lại ý tưởng mới và khả năng giao tiếp, trong khi số 1 cung cấp tầm nhìn và sự quyết đoán. Sự tương tác này tạo nên một đội nhóm năng động, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 hỗ trợ bằng cách thu hút sự chú ý và sáng tạo ý tưởng, trong khi số 1 dẫn dắt dự án với chiến lược rõ ràng. Họ bổ sung cho nhau, với số 3 mang lại năng lượng và số 1 mang lại cấu trúc. Khả năng phối hợp tạo ra những dự án độc đáo.",
        "weaknesses": "Số 3 có thể thấy số 1 quá nghiêm túc, trong khi số 1 có thể cảm thấy số 3 thiếu kỷ luật. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (tự do vs. kỷ luật) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực sáng tạo hoặc kinh doanh. Sự kết hợp giữa ý tưởng và lãnh đạo có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 bốc đồng, số 1 kỷ luật. Số 3 cần tuân thủ kế hoạch, còn số 1 cần cởi mở hơn với sáng tạo. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 3 tập trung vào sáng tạo và số 1 tập trung vào chiến lược. Số 3 nên chủ động tuân thủ kế hoạch, còn số 1 cần chấp nhận sự linh hoạt. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp sáng tạo."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 2 (Nhà ngoại giao) mang đến sự kết hợp giữa năng lượng vui tươi và sự nhạy cảm. Số 3 mang lại sự lạc quan và sáng tạo, trong khi số 2 cung cấp sự thấu hiểu và hỗ trợ. Sự tương tác này tạo ra một tình yêu sôi động, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 2 hỗ trợ bằng sự quan tâm và khả năng lắng nghe. Họ bổ sung cho nhau, với số 3 giúp số 2 thư giãn và số 2 giúp số 3 tập trung hơn. Khả năng tạo ra những khoảnh khắc đáng nhớ là điểm mạnh lớn.",
        "weaknesses": "Số 3 có thể cảm thấy số 2 quá nhạy cảm hoặc phụ thuộc, trong khi số 2 có thể thấy số 3 quá bốc đồng hoặc thiếu nghiêm túc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (niềm vui vs. cảm xúc) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách chấp nhận sự khác biệt. Sự kết hợp giữa sáng tạo và hỗ trợ có thể tạo ra một tình yêu phong phú. Việc cùng nhau tham gia các hoạt động sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên trải nghiệm, số 2 ưu tiên cảm xúc. Số 3 cần tôn trọng cảm xúc của số 2, còn số 2 cần tránh phụ thuộc quá mức. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động sáng tạo như vẽ tranh hoặc du lịch để tăng sự gắn kết. Số 3 cần học cách nghiêm túc hơn trong các vấn đề quan trọng, còn số 2 nên bày tỏ cảm xúc rõ ràng. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 2 (Nhà ngoại giao) là sự kết hợp giữa sự lạc quan và sự chăm sóc, tạo nên một gia đình sôi động nhưng cần sự cân bằng. Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 2 cung cấp sự chu đáo và thấu hiểu. Sự tương phản này có thể tạo ra một gia đình phong phú, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 mang lại không khí vui vẻ và sáng tạo, trong khi số 2 cung cấp sự ấm áp và hỗ trợ. Họ bổ sung cho nhau, với số 3 làm dịu sự nhạy cảm của số 2 và số 2 giúp số 3 ổn định hơn. Khả năng truyền cảm hứng lẫn nhau tạo nên một gia đình đầy tiếng cười.",
        "weaknesses": "Số 3 có thể cảm thấy số 2 quá phụ thuộc, trong khi số 2 có thể thấy số 3 thiếu trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (niềm vui vs. trách nhiệm) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ phong phú nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa sáng tạo và chăm sóc có thể tạo ra một cuộc sống gia đình đầy màu sắc. Việc cùng nhau tham gia các hoạt động sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận trách nhiệm: số 3 tập trung vào niềm vui, số 2 tập trung vào cảm xúc. Số 3 cần chia sẻ trách nhiệm gia đình, còn số 2 cần học cách độc lập hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình sáng tạo như trang trí nhà cửa hoặc đi du lịch. Số 3 nên nỗ lực chia sẻ trách nhiệm, còn số 2 cần bày tỏ nhu cầu rõ ràng. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 2 (Nhà ngoại giao) có thể tạo ra kết quả ấn tượng nhờ sự kết hợp giữa sáng tạo và ngoại giao. Số 3 mang lại ý tưởng mới và năng lượng lạc quan, trong khi số 2 cung cấp sự tinh tế và kỹ năng xây dựng mối quan hệ. Sự tương tác này tạo nên một đội nhóm năng động, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 hỗ trợ bằng cách thu hút sự chú ý và sáng tạo ý tưởng, trong khi số 2 xây dựng quan hệ và giải quyết xung đột. Họ bổ sung cho nhau, với số 3 mang lại năng lượng và số 2 mang lại sự ổn định. Khả năng phối hợp tạo ra những dự án độc đáo.",
        "weaknesses": "Số 3 có thể thấy số 2 quá cẩn thận, trong khi số 2 có thể cảm thấy số 3 thiếu kỷ luật. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (tự do vs. cẩn thận) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực sáng tạo hoặc giao tiếp. Sự kết hợp giữa ý tưởng và ngoại giao có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 bốc đồng, số 2 chậm rãi. Số 3 cần tuân thủ kế hoạch, còn số 2 cần chấp nhận sự linh hoạt. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 3 tập trung vào sáng tạo và số 2 tập trung vào quan hệ đối ngoại. Số 3 nên chủ động tuân thủ kế hoạch, còn số 2 cần cởi mở hơn với ý tưởng mới. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp sáng tạo."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 90,
      "details": {
        "overview": "9/10\nMối quan hệ giữa hai số 3 (Nhà sáng tạo) là sự kết hợp lý tưởng của sự vui tươi và sáng tạo. Cả hai đều lạc quan, yêu đời và có khả năng biểu đạt, tạo nên một tình yêu đầy năng lượng và cảm hứng. Sự tương đồng này mang lại sự thoải mái, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Cả hai đều có khả năng truyền cảm hứng và tạo niềm vui, tạo ra một mối quan hệ sôi động và thú vị. Họ hỗ trợ lẫn nhau trong các hoạt động sáng tạo, với mỗi người mang lại năng lượng và ý tưởng mới. Sự tương đồng trong cách tiếp cận giúp họ dễ dàng đồng điệu.",
        "weaknesses": "Cả hai có thể quá bốc đồng hoặc thiếu tập trung, dẫn đến việc bỏ qua các vấn đề quan trọng. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự thiếu kỷ luật của cả hai có thể gây ra trì trệ trong các quyết định lớn.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu mẫu mực nếu cả hai học cách tổ chức hơn. Sự kết hợp của hai nhà sáng tạo tạo ra một mối quan hệ đầy màu sắc. Việc cùng nhau tham gia các dự án sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức lớn nhất là sự thiếu kỷ luật và xu hướng né tránh trách nhiệm. Cả hai cần học cách đối mặt với vấn đề thay vì chỉ tập trung vào niềm vui. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động sáng tạo như vẽ tranh, viết lách hoặc du lịch. Họ cần lập kế hoạch chung để giải quyết các vấn đề quan trọng. Duy trì giao tiếp cởi mở và khuyến khích sự tổ chức sẽ giúp mối quan hệ bền vững."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nHôn nhân giữa hai số 3 (Nhà sáng tạo) là sự kết hợp của sự lạc quan và sáng tạo, tạo nên một gia đình sôi động và đầy màu sắc. Cả hai đều yêu đời, giỏi giao tiếp và thích truyền cảm hứng, giúp họ xây dựng một mái ấm vui vẻ. Sự tương đồng này rất bền vững, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Cả hai đều giỏi mang lại niềm vui và sáng tạo, tạo ra một gia đình thú vị và năng động. Họ hỗ trợ lẫn nhau trong các hoạt động sáng tạo, với mỗi người mang lại năng lượng và ý tưởng mới. Sự tương đồng trong cách tiếp cận giúp họ phối hợp tốt trong các trách nhiệm gia đình.",
        "weaknesses": "Cả hai có thể thiếu kỷ luật hoặc né tránh trách nhiệm, dẫn đến việc trì hoãn giải quyết vấn đề. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự bốc đồng của cả hai có thể gây ra bất đồng nếu không có sự tổ chức.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ mẫu mực nếu cả hai học cách tổ chức hơn. Sự kết hợp của hai nhà sáng tạo tạo ra một cuộc sống gia đình đầy cảm hứng. Việc cùng nhau xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự thiếu kỷ luật và xu hướng tập trung vào niềm vui hơn trách nhiệm. Cả hai cần học cách phân chia nhiệm vụ và đối mặt với vấn đề. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như sáng tạo nghệ thuật hoặc đi du lịch. Họ cần lập kế hoạch rõ ràng để phân chia trách nhiệm. Duy trì giao tiếp cởi mở và khuyến khích sự tổ chức sẽ giúp gia đình bền vững."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nSự hợp tác giữa hai số 3 (Nhà sáng tạo) có thể tạo ra kết quả ấn tượng nhờ sự kết hợp của ý tưởng và năng lượng. Cả hai đều giỏi giao tiếp, sáng tạo và truyền cảm hứng, tạo nên một đội nhóm năng động và hiệu quả. Tuy nhiên, thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Cả hai đều có khả năng sáng tạo ý tưởng và thu hút sự chú ý, giúp họ phối hợp tốt trong các dự án sáng tạo. Sự tương đồng trong cách tiếp cận tạo ra một môi trường làm việc thú vị. Họ có thể hỗ trợ nhau trong việc phát triển các ý tưởng độc đáo.",
        "weaknesses": "Cả hai có thể thiếu kỷ luật, dẫn đến trì hoãn trong các quyết định quan trọng. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự bốc đồng của cả hai có thể khiến dự án thiếu cấu trúc nếu không có sự tổ chức.",
        "potential": "Sự hợp tác này có tiềm năng tạo ra kết quả xuất sắc trong các lĩnh vực sáng tạo hoặc truyền thông. Sự kết hợp của hai nhà sáng tạo có thể dẫn đến những dự án đột phá. Việc phân chia vai trò rõ ràng và tìm kiếm sự hỗ trợ từ bên ngoài sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự thiếu kỷ luật và xu hướng tập trung vào ý tưởng hơn thực hiện. Cả hai cần học cách tuân thủ kế hoạch và phân chia nhiệm vụ. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng và tìm kiếm sự hỗ trợ từ một người có tổ chức. Tham gia các buổi họp định kỳ để duy trì đồng thuận. Cả hai cần học cách tuân thủ kế hoạch và duy trì giao tiếp cởi mở để đảm bảo thành công."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 60,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 4 (Nhà xây dựng) có thể ổn định nhưng thiếu sự lãng mạn do sự khác biệt trong cách tiếp cận. Số 3 mang lại sự lạc quan và sáng tạo, trong khi số 4 cung cấp sự thực tế và ổn định. Sự tương phản này có thể hỗ trợ lẫn nhau, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 4 cung cấp sự đáng tin cậy và nền tảng vững chắc. Họ có thể bổ sung cho nhau, với số 3 làm dịu sự cứng nhắc của số 4 và số 4 giúp số 3 tổ chức hơn. Khả năng xây dựng một mối quan hệ an toàn là điểm mạnh.",
        "weaknesses": "Số 3 có thể cảm thấy số 4 quá cứng nhắc hoặc thiếu thú vị, trong khi số 4 có thể thấy số 3 quá bốc đồng hoặc thiếu trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (niềm vui vs. thực tế) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa sáng tạo và thực tế có thể tạo ra một tình yêu bền vững. Việc cùng nhau tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên niềm vui, số 4 ưu tiên ổn định. Số 3 cần tránh bốc đồng, còn số 4 cần cởi mở hơn với sự sáng tạo. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động thực tế như lập kế hoạch tài chính hoặc làm việc nhà chung. Số 3 nên bày tỏ nhu cầu rõ ràng, còn số 4 cần học cách thư giãn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 4 (Nhà xây dựng) có thể gặp thử thách do sự khác biệt trong ưu tiên. Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 4 cung cấp sự thực tế và khả năng xây dựng nền tảng. Sự tương phản này có thể ổn định, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 mang lại không khí vui vẻ và sáng tạo, trong khi số 4 mang lại sự ổn định và tổ chức. Họ có thể bổ sung cho nhau, với số 3 làm dịu sự nghiêm túc của số 4 và số 4 giúp số 3 có cấu trúc hơn. Khả năng xây dựng một gia đình an toàn là điểm mạnh.",
        "weaknesses": "Số 3 có thể cảm thấy số 4 quá cứng nhắc, trong khi số 4 có thể thấy số 3 thiếu trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (niềm vui vs. trách nhiệm) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa sáng tạo và thực tế có thể tạo ra một cuộc sống gia đình ổn định. Việc cùng nhau tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 tập trung vào niềm vui, số 4 tập trung vào trách nhiệm. Số 3 cần chia sẻ trách nhiệm, còn số 4 cần cởi mở hơn với sự sáng tạo. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình thực tế như quản lý tài chính hoặc xây dựng dự án chung. Số 3 nên nỗ lực chia sẻ trách nhiệm, còn số 4 cần thư giãn hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 4 (Nhà xây dựng) có thể hiệu quả nếu tận dụng thế mạnh của nhau. Số 3 mang lại ý tưởng mới và năng lượng lạc quan, trong khi số 4 cung cấp sự thực tế và kỷ luật. Sự tương phản này tạo nên một đội nhóm cân bằng, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 hỗ trợ bằng cách sáng tạo ý tưởng và thu hút sự chú ý, trong khi số 4 đảm bảo mọi thứ được thực hiện đúng kế hoạch. Họ bổ sung cho nhau, với số 3 mang lại năng lượng và số 4 mang lại cấu trúc. Khả năng phối hợp tạo ra những dự án vững chắc.",
        "weaknesses": "Số 3 có thể thấy số 4 quá cứng nhắc, trong khi số 4 có thể cảm thấy số 3 thiếu kỷ luật. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (tự do vs. kỷ luật) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án dài hạn. Sự kết hợp giữa sáng tạo và thực tế có thể dẫn đến thành công trong kinh doanh hoặc tổ chức. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 bốc đồng, số 4 kỷ luật. Số 3 cần tuân thủ kế hoạch, còn số 4 cần cởi mở hơn với sự đổi mới. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 3 tập trung vào sáng tạo và số 4 tập trung vào thực hiện. Số 3 nên chủ động tuân thủ kế hoạch, còn số 4 cần chấp nhận sự linh hoạt. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 5 (Nhà phiêu lưu) là sự kết hợp của sự vui tươi và tinh thần tự do. Số 3 mang lại sự lạc quan và sáng tạo, trong khi số 5 cung cấp sự linh hoạt và khát vọng khám phá. Sự tương đồng này tạo ra một tình yêu năng động, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Cả hai đều yêu thích sự mới mẻ và trải nghiệm, tạo ra một mối quan hệ đầy thú vị. Số 3 mang lại sự sáng tạo, trong khi số 5 mang lại năng lượng phiêu lưu. Khả năng cùng nhau khám phá và tận hưởng cuộc sống là điểm mạnh lớn.",
        "weaknesses": "Cả hai có thể quá bốc đồng hoặc thiếu cam kết, dẫn đến việc bỏ qua các vấn đề quan trọng. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự thiếu kỷ luật của cả hai có thể gây ra bất đồng nếu không có sự tổ chức.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách cân bằng tự do và trách nhiệm. Sự kết hợp giữa sáng tạo và phiêu lưu có thể tạo ra một tình yêu phong phú. Việc cùng nhau tham gia các hoạt động mới mẻ sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự thiếu cam kết và xu hướng tập trung vào trải nghiệm hơn cảm xúc sâu sắc. Số 3 cần nghiêm túc hơn, còn số 5 cần cam kết hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động phiêu lưu như du lịch hoặc thử thách mới. Số 3 nên bày tỏ nhu cầu rõ ràng, còn số 5 cần học cách cam kết. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 5 (Nhà phiêu lưu) là sự kết hợp của sự lạc quan và tự do, tạo nên một gia đình năng động nhưng cần sự cân bằng. Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 5 cung cấp sự linh hoạt và tinh thần khám phá. Sự tương đồng này có thể thú vị, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Cả hai đều yêu thích sự mới mẻ, tạo ra một gia đình đầy trải nghiệm thú vị. Số 3 mang lại không khí vui vẻ, trong khi số 5 mang lại năng lượng phiêu lưu. Khả năng cùng nhau khám phá và tận hưởng cuộc sống là điểm mạnh.",
        "weaknesses": "Cả hai có thể thiếu trách nhiệm hoặc cam kết, dẫn đến việc bỏ qua các nhiệm vụ gia đình. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự bốc đồng của cả hai có thể gây căng thẳng nếu không có sự tổ chức.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng tự do và trách nhiệm. Sự kết hợp giữa sáng tạo và phiêu lưu có thể tạo ra một cuộc sống gia đình phong phú. Việc cùng nhau tham gia các hoạt động mới sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự thiếu cam kết và xu hướng tập trung vào trải nghiệm hơn trách nhiệm. Số 3 cần chia sẻ nhiệm vụ, còn số 5 cần cam kết hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình năng động như du lịch hoặc thử thách mới. Số 3 nên nỗ lực chia sẻ trách nhiệm, còn số 5 cần cam kết hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 5 (Nhà phiêu lưu) có thể tạo ra kết quả ấn tượng nhờ sự kết hợp giữa sáng tạo và đổi mới. Số 3 mang lại ý tưởng mới và năng lượng lạc quan, trong khi số 5 cung cấp sự linh hoạt và tinh thần khám phá. Sự tương đồng này tạo nên một đội nhóm năng động, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Cả hai đều giỏi sáng tạo và thích nghi, giúp họ phối hợp tốt trong các dự án đổi mới. Số 3 mang lại ý tưởng độc đáo, trong khi số 5 mang lại khả năng thích ứng nhanh. Khả năng thu hút sự chú ý và tạo ra những dự án thú vị là điểm mạnh.",
        "weaknesses": "Cả hai có thể thiếu kỷ luật, dẫn đến trì hoãn trong các quyết định quan trọng. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự bốc đồng của cả hai có thể khiến dự án thiếu cấu trúc nếu không có sự tổ chức.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án sáng tạo hoặc thay đổi nhanh. Sự kết hợp giữa ý tưởng và phiêu lưu có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng và tìm kiếm sự hỗ trợ từ bên ngoài sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự thiếu kỷ luật và xu hướng tập trung vào ý tưởng hơn thực hiện. Số 3 cần tuân thủ kế hoạch, còn số 5 cần cam kết hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 3 tập trung vào sáng tạo và số 5 tập trung vào thích nghi. Số 3 nên chủ động tuân thủ kế hoạch, còn số 5 cần cam kết hơn. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp sáng tạo."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 6 (Nhà chăm sóc) là sự kết hợp giữa sự vui tươi và yêu thương. Số 3 mang lại sự lạc quan và sáng tạo, trong khi số 6 cung cấp sự chu đáo và khả năng chăm sóc. Sự tương tác này tạo ra một tình yêu sâu sắc và hài hòa, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 6 cung cấp sự quan tâm và ổn định. Họ bổ sung cho nhau, với số 3 truyền cảm hứng cho số 6 và số 6 giúp số 3 tập trung hơn. Khả năng thấu hiểu và hỗ trợ lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 3 có thể cảm thấy số 6 quá kiểm soát, trong khi số 6 có thể thấy số 3 thiếu trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (niềm vui vs. chăm sóc) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách cân bằng niềm vui và trách nhiệm. Sự kết hợp giữa sáng tạo và chăm sóc có thể tạo ra một tình yêu phong phú. Việc cùng nhau tham gia các hoạt động ý nghĩa sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên trải nghiệm, số 6 ưu tiên chăm sóc. Số 3 cần nghiêm túc hơn, còn số 6 cần cởi mở hơn với sự sáng tạo. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như từ thiện hoặc sáng tạo nghệ thuật. Số 3 nên bày tỏ nhu cầu rõ ràng, còn số 6 cần học cách thư giãn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 6 (Nhà chăm sóc) là sự kết hợp của sự lạc quan và trách nhiệm, tạo nên một gia đình ấm áp và phong phú. Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 6 cung cấp sự chu đáo và khả năng xây dựng mái ấm. Sự tương tác này rất hài hòa, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 mang lại không khí vui vẻ và sáng tạo, trong khi số 6 cung cấp sự quan tâm và ổn định. Họ bổ sung cho nhau, với số 3 truyền cảm hứng cho số 6 và số 6 giúp số 3 tổ chức hơn. Khả năng phối hợp tạo nên một gia đình hạnh phúc.",
        "weaknesses": "Số 3 có thể cảm thấy số 6 quá kiểm soát, trong khi số 6 có thể thấy số 3 thiếu trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (niềm vui vs. trách nhiệm) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ mẫu mực nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa sáng tạo và chăm sóc có thể tạo ra một cuộc sống gia đình ý nghĩa. Việc cùng nhau tham gia các hoạt động ý nghĩa sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 tập trung vào niềm vui, số 6 tập trung vào trách nhiệm. Số 3 cần chia sẻ nhiệm vụ, còn số 6 cần cởi mở hơn với sự sáng tạo. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như từ thiện hoặc làm việc nhà chung. Số 3 nên nỗ lực chia sẻ trách nhiệm, còn số 6 cần thư giãn hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 6 (Nhà chăm sóc) có thể hiệu quả trong các dự án cần sự sáng tạo và trách nhiệm. Số 3 mang lại ý tưởng mới và năng lượng lạc quan, trong khi số 6 cung cấp sự chu đáo và khả năng quản lý. Sự tương tác này tạo nên một đội nhóm hài hòa, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 hỗ trợ bằng cách sáng tạo ý tưởng và thu hút sự chú ý, trong khi số 6 đảm bảo mọi thứ được thực hiện đúng kế hoạch. Họ bổ sung cho nhau, với số 3 mang lại năng lượng và số 6 mang lại cấu trúc. Khả năng phối hợp tạo ra những dự án có ý nghĩa.",
        "weaknesses": "Số 3 có thể thấy số 6 quá kiểm soát, trong khi số 6 có thể cảm thấy số 3 thiếu kỷ luật. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (tự do vs. trách nhiệm) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án cộng đồng hoặc sáng tạo. Sự kết hợp giữa ý tưởng và chăm sóc có thể dẫn đến thành công. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 bốc đồng, số 6 trách nhiệm. Số 3 cần tuân thủ kế hoạch, còn số 6 cần cởi mở hơn với sự đổi mới. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 3 tập trung vào sáng tạo và số 6 tập trung vào quản lý. Số 3 nên chủ động tuân thủ kế hoạch, còn số 6 cần chấp nhận sự linh hoạt. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 7 (Nhà hiền triết) có thể gặp thử thách do sự khác biệt trong cách tiếp cận. Số 3 mang lại sự lạc quan và sáng tạo, trong khi số 7 nội tâm, sâu sắc và ưu tiên sự khám phá tinh thần. Sự tương phản này có thể hấp dẫn ban đầu, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 7 cung cấp sự sâu sắc và tư duy triết học. Họ có thể học hỏi lẫn nhau, với số 3 giúp số 7 cởi mở hơn và số 7 giúp số 3 suy ngẫm sâu hơn. Khả năng tạo ra một mối quan hệ độc đáo là điểm mạnh.",
        "weaknesses": "Số 3 có thể cảm thấy số 7 quá xa cách, trong khi số 7 có thể thấy số 3 quá bốc đồng hoặc thiếu chiều sâu. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (niềm vui vs. tinh thần) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa sáng tạo và hiền triết có thể tạo ra một tình yêu sâu sắc. Việc cùng nhau tham gia các hoạt động tinh thần sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên trải nghiệm, số 7 ưu tiên suy ngẫm. Số 3 cần nghiêm túc hơn, còn số 7 cần cởi mở hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động tinh thần như thiền hoặc đọc sách cùng nhau. Số 3 nên bày tỏ nhu cầu rõ ràng, còn số 7 cần học cách cởi mở hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 50,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 7 (Nhà hiền triết) có thể gặp nhiều thử thách do sự khác biệt trong ưu tiên. Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 7 nội tâm và tập trung vào sự khám phá tinh thần. Sự tương phản này có thể tạo ra một gia đình độc đáo, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 mang lại không khí vui vẻ và sáng tạo, trong khi số 7 mang lại sự sâu sắc và tư duy triết học. Họ có thể bổ sung cho nhau, với số 3 giúp số 7 cởi mở hơn và số 7 giúp số 3 suy ngẫm sâu hơn. Khả năng tạo ra một gia đình độc đáo là điểm mạnh.",
        "weaknesses": "Số 3 có thể cảm thấy số 7 quá xa cách, trong khi số 7 có thể thấy số 3 thiếu trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (niềm vui vs. tinh thần) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa sáng tạo và hiền triết có thể tạo ra một cuộc sống gia đình phong phú. Việc cùng nhau tham gia các hoạt động tinh thần sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách sống: số 3 hướng tới trải nghiệm, số 7 hướng tới suy ngẫm. Số 3 cần chia sẻ trách nhiệm, còn số 7 cần cởi mở hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động tinh thần như thiền hoặc đọc sách cùng nhau. Số 3 nên nỗ lực chia sẻ trách nhiệm, còn số 7 cần cởi mở hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 7 (Nhà hiền triết) có thể hiệu quả trong các dự án cần sự sáng tạo và chiều sâu. Số 3 mang lại ý tưởng mới và năng lượng lạc quan, trong khi số 7 cung cấp sự phân tích và tư duy triết học. Sự tương phản này có thể tạo ra một đội nhóm độc đáo, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 hỗ trợ bằng cách sáng tạo ý tưởng và thu hút sự chú ý, trong khi số 7 mang lại sự sâu sắc và khả năng phân tích. Họ bổ sung cho nhau, với số 3 mang lại năng lượng và số 7 mang lại chiều sâu. Khả năng phối hợp tạo ra những dự án có ý nghĩa.",
        "weaknesses": "Số 3 có thể thấy số 7 quá xa cách, trong khi số 7 có thể cảm thấy số 3 thiếu chiều sâu. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (tự do vs. suy ngẫm) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án đòi hỏi tư duy sâu sắc. Sự kết hợp giữa sáng tạo và triết học có thể dẫn đến những dự án độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 bốc đồng, số 7 suy ngẫm. Số 3 cần tuân thủ kế hoạch, còn số 7 cần hành động nhanh hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 3 tập trung vào sáng tạo và số 7 tập trung vào phân tích. Số 3 nên chủ động tuân thủ kế hoạch, còn số 7 cần hành động nhanh hơn. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp để đảm bảo đồng thuận."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 60,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 8 (Nhà quyền lực) có thể gặp thử thách do sự khác biệt trong cách tiếp cận. Số 3 mang lại sự lạc quan và sáng tạo, trong khi số 8 cung cấp sự thực tế, quyết đoán và khát vọng thành công. Sự tương phản này có thể hấp dẫn ban đầu, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 8 cung cấp sự ổn định và động lực. Họ có thể bổ sung cho nhau, với số 3 làm dịu sự nghiêm túc của số 8 và số 8 giúp số 3 tập trung hơn. Khả năng tạo ra một mối quan hệ năng động là điểm mạnh.",
        "weaknesses": "Số 3 có thể cảm thấy số 8 quá kiểm soát hoặc thực dụng, trong khi số 8 có thể thấy số 3 quá bốc đồng hoặc thiếu trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (niềm vui vs. thành công) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa sáng tạo và quyền lực có thể tạo ra một tình yêu bền vững. Việc cùng nhau tham gia các hoạt động thực tế hoặc sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên trải nghiệm, số 8 ưu tiên thành công. Số 3 cần nghiêm túc hơn, còn số 8 cần cởi mở hơn với sự sáng tạo. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như lập kế hoạch tài chính hoặc sáng tạo nghệ thuật. Số 3 nên bày tỏ nhu cầu rõ ràng, còn số 8 cần học cách thư giãn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 8 (Nhà quyền lực) có thể gặp nhiều thử thách do sự khác biệt trong ưu tiên. Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 8 cung cấp sự thực tế và khả năng lãnh đạo. Sự tương phản này có thể ổn định, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 mang lại không khí vui vẻ và sáng tạo, trong khi số 8 mang lại sự ổn định và tầm nhìn lớn. Họ có thể bổ sung cho nhau, với số 3 làm dịu sự nghiêm túc của số 8 và số 8 giúp số 3 tổ chức hơn. Khả năng tạo ra một gia đình thành công là điểm mạnh.",
        "weaknesses": "Số 3 có thể cảm thấy số 8 quá kiểm soát, trong khi số 8 có thể thấy số 3 thiếu trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (niềm vui vs. thành công) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa sáng tạo và quyền lực có thể tạo ra một cuộc sống gia đình thành công. Việc cùng nhau xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 tập trung vào niềm vui, số 8 tập trung vào thành công. Số 3 cần chia sẻ trách nhiệm, còn số 8 cần cởi mở hơn với sự sáng tạo. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như lập kế hoạch tài chính hoặc xây dựng dự án chung. Số 3 nên nỗ lực chia sẻ trách nhiệm, còn số 8 cần thư giãn hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 8 (Nhà quyền lực) có thể hiệu quả trong các dự án kinh doanh hoặc sáng tạo nếu tận dụng thế mạnh của nhau. Số 3 mang lại ý tưởng mới và năng lượng lạc quan, trong khi số 8 cung cấp sự quyết đoán và khả năng quản lý. Sự tương phản này tạo nên một đội nhóm mạnh mẽ, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 hỗ trợ bằng cách sáng tạo ý tưởng và thu hút sự chú ý, trong khi số 8 dẫn dắt dự án với tầm nhìn lớn. Họ bổ sung cho nhau, với số 3 mang lại năng lượng và số 8 mang lại cấu trúc. Khả năng phối hợp tạo ra những dự án thành công.",
        "weaknesses": "Số 3 có thể thấy số 8 quá kiểm soát, trong khi số 8 có thể cảm thấy số 3 thiếu kỷ luật. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (tự do vs. kỷ luật) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án kinh doanh hoặc sáng tạo. Sự kết hợp giữa ý tưởng và quyền lực có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 bốc đồng, số 8 quyết đoán. Số 3 cần tuân thủ kế hoạch, còn số 8 cần cởi mở hơn với sự đổi mới. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 3 tập trung vào sáng tạo và số 8 tập trung vào quản lý. Số 3 nên chủ động tuân thủ kế hoạch, còn số 8 cần chấp nhận sự linh hoạt. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 9 (Nhà nhân đạo) là sự kết hợp giữa sự vui tươi và lý tưởng cao cả. Số 3 mang lại sự lạc quan và sáng tạo, trong khi số 9 cung cấp lòng trắc ẩn và khát vọng thay đổi thế giới. Sự tương đồng về cảm xúc tạo ra một tình yêu sâu sắc, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Cả hai đều yêu thích sự sáng tạo và quan tâm đến người khác, tạo ra một mối quan hệ đầy cảm hứng. Số 3 mang lại niềm vui, trong khi số 9 truyền cảm hứng với những lý tưởng lớn. Khả năng đồng cảm giúp họ xây dựng một tình yêu ý nghĩa.",
        "weaknesses": "Số 3 có thể cảm thấy số 9 quá lý tưởng hoặc xa cách, trong khi số 9 có thể thấy số 3 thiếu nghiêm túc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (niềm vui vs. lý tưởng) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách cân bằng cảm xúc và lý tưởng. Sự kết hợp giữa sáng tạo và nhân đạo có thể tạo ra một tình yêu phong phú. Việc cùng nhau tham gia các hoạt động từ thiện sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 tập trung vào niềm vui, số 9 tập trung vào lý tưởng. Số 3 cần nghiêm túc hơn, còn số 9 cần chú ý hơn đến cảm xúc cá nhân. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động từ thiện hoặc sáng tạo để tăng sự gắn kết. Số 3 nên bày tỏ nhu cầu rõ ràng, còn số 9 cần học cách cân bằng lý tưởng với thực tế. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 9 (Nhà nhân đạo) là sự kết hợp giữa sự lạc quan và lý tưởng, tạo nên một gia đình đầy cảm hứng và ý nghĩa. Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 9 cung cấp lòng trắc ẩn và khát vọng cống hiến. Sự tương đồng về cảm xúc có thể bền vững, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Cả hai đều quan tâm đến người khác, tạo ra một gia đình ấm áp và phong phú. Số 3 mang lại không khí vui vẻ, trong khi số 9 truyền cảm hứng với những mục tiêu lớn. Khả năng đồng cảm giúp họ phối hợp tốt trong các trách nhiệm gia đình.",
        "weaknesses": "Số 3 có thể cảm thấy số 9 quá xa cách hoặc thiếu thực tế, trong khi số 9 có thể thấy số 3 thiếu trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (niềm vui vs. lý tưởng) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ phong phú nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa sáng tạo và nhân đạo có thể tạo ra một cuộc sống gia đình ý nghĩa. Việc cùng nhau tham gia các hoạt động từ thiện sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 tập trung vào niềm vui, số 9 tập trung vào lý tưởng. Số 3 cần chia sẻ trách nhiệm, còn số 9 cần chú ý hơn đến gia đình. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như từ thiện hoặc làm việc chung vì cộng đồng. Số 3 nên nỗ lực chia sẻ trách nhiệm, còn số 9 cần cân bằng lý tưởng với thực tế. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 9 (Nhà nhân đạo) có thể tạo ra kết quả ấn tượng trong các dự án cộng đồng hoặc sáng tạo. Số 3 mang lại ý tưởng mới và năng lượng lạc quan, trong khi số 9 cung cấp lòng trắc ẩn và tầm nhìn lớn. Sự tương đồng về cảm xúc tạo nên một đội nhóm hài hòa, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 hỗ trợ bằng cách sáng tạo ý tưởng và thu hút sự chú ý, trong khi số 9 mang lại ý tưởng cao cả và sự đam mê. Họ bổ sung cho nhau, với số 3 mang lại năng lượng và số 9 mang lại cảm hứng. Khả năng phối hợp tạo ra những dự án có ý nghĩa.",
        "weaknesses": "Số 3 có thể thấy số 9 thiếu thực tế, trong khi số 9 có thể cảm thấy số 3 thiếu tham vọng. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (tự do vs. lý tưởng) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án từ thiện hoặc sáng tạo. Sự kết hợp giữa ý tưởng và nhân đạo có thể dẫn đến những dự án có tác động lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 bốc đồng, số 9 lý tưởng. Số 3 cần tuân thủ kế hoạch, còn số 9 cần thực tế hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 3 tập trung vào sáng tạo và số 9 tập trung vào ý tưởng lớn. Số 3 nên chủ động tuân thủ kế hoạch, còn số 9 cần thực tế hơn. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp để đảm bảo đồng thuận."
      }
    },
   {
      "partnerNumber": 11,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 11 (Nhà truyền cảm hứng) mang lại sự kết hợp giữa sự vui tươi và tâm linh. Số 3 mang lại sự lạc quan và sáng tạo, trong khi số 11 cung cấp sự sáng tạo, trực giác và năng lượng tâm linh. Sự tương tác này tạo ra một tình yêu độc đáo, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 11 truyền cảm hứng với sự trực giác và tầm nhìn tâm linh. Họ bổ sung cho nhau, với số 3 mang lại năng lượng và số 11 mang lại chiều sâu. Khả năng đồng cảm tạo nên một mối quan hệ sâu sắc.",
        "weaknesses": "Số 3 có thể cảm thấy số 11 quá xa cách hoặc không thực tế, trong khi số 11 có thể thấy số 3 quá bốc đồng hoặc thiếu chiều sâu. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (niềm vui vs. tâm linh) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa sáng tạo và truyền cảm hứng có thể tạo ra một tình yêu phong phú. Việc cùng nhau tham gia các hoạt động tâm linh hoặc sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên trải nghiệm, số 11 ưu tiên tâm linh. Số 3 cần nghiêm túc hơn, còn số 11 cần chú ý hơn đến cảm xúc cá nhân. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như thiền, yoga hoặc sáng tạo nghệ thuật. Số 3 nên bày tỏ nhu cầu rõ ràng, còn số 11 cần học cách thực tế hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 11 (Nhà truyền cảm hứng) là sự kết hợp giữa sự lạc quan và tâm linh, tạo nên một gia đình độc đáo nhưng cần sự cân bằng. Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 11 cung cấp sự sáng tạo và năng lượng tâm linh. Sự tương phản này có thể hấp dẫn, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 mang lại không khí vui vẻ và sáng tạo, trong khi số 11 mang lại sự truyền cảm hứng và tầm nhìn tâm linh. Họ bổ sung cho nhau, với số 3 mang lại năng lượng và số 11 mang lại chiều sâu. Khả năng đồng cảm giúp họ phối hợp trong các trách nhiệm gia đình.",
        "weaknesses": "Số 3 có thể cảm thấy số 11 quá xa cách hoặc không thực tế, trong khi số 11 có thể thấy số 3 thiếu trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (niềm vui vs. tâm linh) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa sáng tạo và truyền cảm hứng có thể tạo ra một cuộc sống gia đình độc đáo. Việc cùng nhau tham gia các hoạt động tâm linh sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 tập trung vào niềm vui, số 11 tập trung vào tâm linh. Số 3 cần chia sẻ trách nhiệm, còn số 11 cần chú ý hơn đến gia đình. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như thiền hoặc sáng tạo nghệ thuật. Số 3 nên nỗ lực chia sẻ trách nhiệm, còn số 11 cần thực tế hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 11 (Nhà truyền cảm hứng) có thể tạo ra kết quả ấn tượng trong các dự án sáng tạo hoặc tâm linh. Số 3 mang lại ý tưởng mới và năng lượng lạc quan, trong khi số 11 cung cấp sự sáng tạo và trực giác. Sự tương đồng này tạo nên một đội nhóm năng động, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 hỗ trợ bằng cách sáng tạo ý tưởng và thu hút sự chú ý, trong khi số 11 mang lại ý tưởng tâm linh và cảm hứng. Họ bổ sung cho nhau, với số 3 mang lại năng lượng và số 11 mang lại chiều sâu. Khả năng phối hợp tạo ra những dự án độc đáo.",
        "weaknesses": "Số 3 có thể thấy số 11 thiếu thực tế, trong khi số 11 có thể cảm thấy số 3 thiếu chiều sâu. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (tự do vs. trực giác) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án sáng tạo hoặc tâm linh. Sự kết hợp giữa ý tưởng và truyền cảm hứng có thể dẫn đến những dự án có tác động lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 bốc đồng, số 11 trực giác. Số 3 cần tuân thủ kế hoạch, còn số 11 cần thực tế hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 3 tập trung vào sáng tạo và số 11 tập trung vào ý tưởng tâm linh. Số 3 nên chủ động tuân thủ kế hoạch, còn số 11 cần thực tế hơn. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp sáng tạo để đảm bảo đồng thuận."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5/10\nMối quan hệ giữa số 3 (Nhà sáng tạo) và số 22 (Nhà kiến tạo bậc thầy) có thể gặp thử thách do sự khác biệt trong cách tiếp cận. Số 3 mang lại sự lạc quan và sáng tạo, trong khi số 22 tập trung vào mục tiêu lớn, thực tế và xây dựng. Sự tương phản này có thể hấp dẫn ban đầu, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 22 cung cấp sự ổn định và tầm nhìn dài hạn. Họ có thể bổ sung cho nhau, với số 3 làm dịu sự căng thẳng của số 22 và số 22 giúp số 3 có cấu trúc hơn. Khả năng tạo ra một mối quan hệ an toàn là điểm mạnh.",
        "weaknesses": "Số 3 có thể cảm thấy số 22 quá thực dụng hoặc xa cách, trong khi số 22 có thể thấy số 3 quá bốc đồng hoặc thiếu trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (niềm vui vs. mục tiêu) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa sáng tạo và kiến tạo có thể tạo ra một tình yêu bền vững. Việc cùng nhau tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 3 ưu tiên trải nghiệm, số 22 ưu tiên mục tiêu lớn. Số 3 cần nghiêm túc hơn, còn số 22 cần thể hiện tình cảm nhiều hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động thực tế như lập kế hoạch hoặc xây dựng dự án chung. Số 3 nên bày tỏ nhu cầu rõ ràng, còn số 22 cần học cách thể hiện tình cảm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 50,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 3 (Nhà sáng tạo) và số 22 (Nhà kiến tạo bậc thầy) có thể gặp nhiều thử thách do sự khác biệt trong ưu tiên. Số 3 mang lại niềm vui và sự sáng tạo, trong khi số 22 tập trung vào mục tiêu lớn và thực tế. Sự tương phản này có thể tạo ra một gia đình ổn định, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 mang lại không khí vui vẻ và sáng tạo, trong khi số 22 cung cấp sự ổn định và khả năng xây dựng nền tảng. Họ có thể bổ sung cho nhau, với số 3 làm dịu sự căng thẳng của số 22 và số 22 giúp số 3 có cấu trúc hơn. Khả năng tạo ra một gia đình an toàn là điểm mạnh.",
        "weaknesses": "Số 3 có thể cảm thấy số 22 quá xa cách hoặc kiểm soát, trong khi số 22 có thể thấy số 3 thiếu trách nhiệm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (niềm vui vs. mục tiêu) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa sáng tạo và kiến tạo có thể tạo ra một cuộc sống gia đình ổn định. Việc cùng nhau tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách sống: số 3 hướng tới trải nghiệm, số 22 hướng tới mục tiêu. Số 3 cần chia sẻ trách nhiệm, còn số 22 cần thể hiện tình cảm nhiều hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như quản lý tài chính hoặc xây dựng dự án chung. Số 3 nên nỗ lực chia sẻ trách nhiệm, còn số 22 cần thể hiện tình cảm nhiều hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 3 (Nhà sáng tạo) và số 22 (Nhà kiến tạo bậc thầy) có thể hiệu quả trong các dự án dài hạn nếu tận dụng thế mạnh của nhau. Số 3 mang lại ý tưởng mới và năng lượng lạc quan, trong khi số 22 cung cấp tầm nhìn lớn và khả năng thực hiện. Sự tương phản này có thể tạo ra một đội nhóm mạnh mẽ, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 3 hỗ trợ bằng cách sáng tạo ý tưởng và thu hút sự chú ý, trong khi số 22 dẫn dắt dự án với tầm nhìn chiến lược. Họ bổ sung cho nhau, với số 3 mang lại năng lượng và số 22 mang lại cấu trúc. Khả năng phối hợp tạo ra những dự án vững chắc.",
        "weaknesses": "Số 3 có thể cảm thấy số 22 quá kiểm soát hoặc xa cách, trong khi số 22 có thể thấy số 3 thiếu kỷ luật. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (tự do vs. kỷ luật) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án xây dựng hoặc tổ chức. Sự kết hợp giữa sáng tạo và kiến tạo có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 3 bốc đồng, số 22 quyết đoán. Số 3 cần tuân thủ kế hoạch, còn số 22 cần lắng nghe nhiều hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 3 tập trung vào sáng tạo và số 22 tập trung vào thực hiện. Số 3 nên chủ động tuân thủ kế hoạch, còn số 22 cần tôn trọng ý kiến của số 3. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ để đảm bảo đồng thuận."
      }
    }
  ]
}