{
  "number": 2,
  "description": "Số đường đời 2 đại diện cho sự hòa giải, nhạy cảm và hợp tác. Những người mang số 2 thường dịu dàng, chu đáo, có khả năng thấu hiểu cảm xúc của người khác và giỏi xây dựng hòa bình. Họ trân trọng sự hài hòa trong các mối quan hệ, nhưng có thể nhạy cảm quá mức hoặc thiếu quyết đoán nếu không được hỗ trợ.",
  "compatibility": [
    {
      "partnerNumber": 1,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 1 (Nhà lãnh đạo) là sự kết hợp cân bằng giữa sự dịu dàng và sức mạnh. Số 2 mang đến sự nhạy cảm, hỗ trợ và khả năng hòa giải, trong khi số 1 cung cấp sự quyết đoán, tham vọng và định hướng. Sự tương phản này tạo nên một tình yêu lãng mạn, nơi cả hai bổ sung cho nhau nếu tôn trọng sự khác biệt.",
        "strengths": "Số 2 hỗ trợ số 1 bằng sự thấu hiểu và khả năng duy trì hòa khí, trong khi số 1 mang lại sự tự tin và động lực cho số 2. Họ có thể học hỏi lẫn nhau, với số 2 giúp số 1 kiên nhẫn hơn và số 1 khuyến khích số 2 quyết đoán hơn. Sự kết hợp này tạo nên một mối quan hệ hài hòa và đầy cảm hứng.",
        "weaknesses": "Số 2 có thể cảm thấy bị áp đảo bởi phong cách mạnh mẽ của số 1, trong khi số 1 có thể xem số 2 là quá nhạy cảm hoặc thiếu quyết đoán. Sự khác biệt trong cách thể hiện cảm xúc có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng phát triển mạnh mẽ nếu cả hai học cách trân trọng thế mạnh của nhau. Sự kết hợp giữa hỗ trợ và lãnh đạo có thể tạo ra một tình yêu sâu sắc, nơi cả hai cùng trưởng thành. Việc cùng chia sẻ cảm xúc và mục tiêu sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 1 tập trung vào mục tiêu. Số 2 cần tự tin bày tỏ nhu cầu, còn số 1 cần tránh kiểm soát quá mức. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên dành thời gian lắng nghe và thấu hiểu lẫn nhau. Số 2 nên thẳng thắn chia sẻ cảm xúc, trong khi số 1 cần thể hiện sự quan tâm và trân trọng sự hỗ trợ của số 2. Các hoạt động như đi dạo, trò chuyện sâu sắc hoặc sáng tạo nghệ thuật có thể tăng sự gắn kết. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 90,
      "details": {
        "overview": "9/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 1 (Nhà lãnh đạo) là sự kết hợp giữa sự chu đáo và khả năng lãnh đạo, tạo nên một gia đình hài hòa. Số 2 mang đến tình yêu thương, sự chăm sóc và khả năng duy trì hòa khí, trong khi số 1 cung cấp sự ổn định, định hướng và tham vọng. Sự tương phản này giúp họ xây dựng một mái ấm bền vững nếu có sự tôn trọng lẫn nhau.",
        "strengths": "Số 2 tạo ra một môi trường gia đình ấm áp và hỗ trợ, trong khi số 1 mang lại tầm nhìn và sự bảo vệ. Họ bổ sung cho nhau, với số 2 giúp số 1 quan tâm hơn đến cảm xúc và số 1 khuyến khích số 2 tự tin hơn. Khả năng thấu hiểu lẫn nhau là điểm mạnh lớn, giúp gia đình phát triển hài hòa.",
        "weaknesses": "Số 2 có thể cảm thấy bị lu mờ bởi tham vọng của số 1, trong khi số 1 có thể thấy số 2 quá phụ thuộc hoặc nhạy cảm. Sự khác biệt trong ưu tiên (gia đình vs. sự nghiệp) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ mẫu mực nếu cả hai cùng nỗ lực. Sự kết hợp giữa chăm sóc và lãnh đạo có thể tạo ra một gia đình hạnh phúc và thành công. Việc cùng xây dựng mục tiêu chung và chia sẻ trách nhiệm sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là cân bằng giữa nhu cầu cảm xúc của số 2 và tham vọng của số 1. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 1 cần dành thời gian cho gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các buổi tối gia đình hoặc cùng lập kế hoạch tương lai để tăng sự gắn kết. Số 2 cần tự tin chia sẻ mong muốn, còn số 1 nên thể hiện tình cảm nhiều hơn. Các hoạt động như nấu ăn cùng nhau hoặc tham gia lớp học kỹ năng có thể giúp cải thiện mối quan hệ. Duy trì giao tiếp cởi mở và tôn trọng không gian cá nhân."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 1 (Nhà lãnh đạo) có thể hiệu quả nếu tận dụng thế mạnh của nhau. Số 2 mang đến sự tinh tế, kỹ năng ngoại giao và khả năng xây dựng mối quan hệ, trong khi số 1 cung cấp tầm nhìn chiến lược, sự quyết đoán và khả năng dẫn dắt. Sự kết hợp này tạo nên một đội nhóm cân bằng, nhưng cần sự tôn trọng để thành công.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng mạng lưới quan hệ và giải quyết xung đột, trong khi số 1 dẫn dắt dự án với tầm nhìn lớn. Họ bổ sung cho nhau, với số 2 mang lại sự ổn định và số 1 mang lại động lực. Khả năng học hỏi lẫn nhau giúp số 2 quyết đoán hơn và số 1 lắng nghe tốt hơn.",
        "weaknesses": "Số 2 có thể cảm thấy bị áp đảo bởi phong cách mạnh mẽ của số 1, trong khi số 1 có thể thấy số 2 thiếu quyết đoán hoặc chậm chạp. Sự khác biệt trong tốc độ làm việc có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng tạo ra những kết quả ấn tượng nếu cả hai phối hợp tốt. Sự kết hợp giữa ngoại giao và chiến lược có thể dẫn đến thành công trong kinh doanh hoặc dự án sáng tạo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 chậm rãi và cẩn thận, số 1 nhanh và quyết đoán. Số 2 cần tự tin đóng góp ý kiến, còn số 1 cần tránh kiểm soát quá mức. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự tôn trọng.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 2 xử lý quan hệ đối ngoại và số 1 tập trung vào chiến lược. Số 2 nên chủ động bày tỏ quan điểm, còn số 1 cần lắng nghe ý kiến của số 2. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ để đảm bảo đồng thuận. Các hoạt động như xây dựng đội nhóm có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 90,
      "details": {
        "overview": "9/10\nMối quan hệ giữa hai số 2 (Nhà ngoại giao) là sự kết hợp của sự nhạy cảm, thấu hiểu và hài hòa. Cả hai đều trân trọng sự hòa bình, hợp tác và cảm xúc sâu sắc, tạo nên một tình yêu đầy yêu thương và đồng điệu. Sự tương đồng này giúp họ dễ dàng kết nối, nhưng cả hai cần tránh phụ thuộc quá mức để duy trì sự cân bằng.",
        "strengths": "Cả hai đều có khả năng thấu hiểu và hỗ trợ lẫn nhau, tạo ra một mối quan hệ ấm áp và an toàn về cảm xúc. Họ giỏi lắng nghe, chia sẻ và duy trì hòa khí, giúp mối quan hệ luôn êm đềm. Sự tương đồng trong giá trị giúp họ xây dựng một tình yêu bền vững và đầy ý nghĩa.",
        "weaknesses": "Cả hai có thể quá nhạy cảm, dẫn đến việc dễ bị tổn thương hoặc né tránh xung đột. Sự thiếu quyết đoán của cả hai có thể khiến mối quan hệ thiếu định hướng nếu không có sự chủ động. Việc phụ thuộc quá mức vào nhau có thể gây mất cân bằng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu sâu sắc nếu cả hai học cách tự tin và chủ động hơn. Sự kết hợp của hai nhà ngoại giao có thể tạo ra một mối quan hệ hài hòa, nơi cả hai cùng phát triển. Việc cùng nhau đặt mục tiêu và khuyến khích nhau sẽ giúp họ tiến xa.",
        "challenges": "Thách thức chính là sự thiếu quyết đoán và xu hướng né tránh xung đột. Cả hai cần học cách đối mặt với vấn đề và bày tỏ nhu cầu rõ ràng. Việc phụ thuộc quá mức có thể khiến mối quan hệ trở nên ngột ngạt nếu không có không gian cá nhân.",
        "suggestions": "Cả hai nên khuyến khích nhau tự tin bày tỏ cảm xúc và đối mặt với xung đột một cách xây dựng. Tham gia các hoạt động sáng tạo như vẽ tranh, viết lách hoặc thiền có thể giúp tăng sự gắn kết. Duy trì giao tiếp cởi mở, tổ chức các buổi trò chuyện định kỳ để chia sẻ mong muốn. Tạo không gian cá nhân để cả hai phát triển độc lập, giúp mối quan hệ cân bằng hơn."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 95,
      "details": {
        "overview": "9.5/10\nHôn nhân giữa hai số 2 (Nhà ngoại giao) là một mối quan hệ đầy yêu thương, thấu hiểu và hài hòa. Cả hai đều ưu tiên sự hòa bình, chăm sóc và cảm xúc, tạo nên một gia đình ấm áp và an toàn. Sự tương đồng này giúp họ xây dựng một mái ấm bền vững, nhưng cả hai cần tránh phụ thuộc quá mức để duy trì sự năng động.",
        "strengths": "Cả hai đều có khả năng chăm sóc và hỗ trợ lẫn nhau, tạo ra một môi trường gia đình yên bình. Họ giỏi lắng nghe, chia sẻ trách nhiệm và duy trì sự hài hòa, giúp gia đình luôn ổn định. Sự thấu hiểu sâu sắc về cảm xúc của nhau là điểm mạnh lớn, giúp họ vượt qua khó khăn cùng nhau.",
        "weaknesses": "Cả hai có thể quá nhạy cảm, dẫn đến việc né tránh xung đột hoặc khó đưa ra quyết định lớn. Sự phụ thuộc quá mức có thể khiến gia đình thiếu định hướng nếu cả hai không chủ động. Việc thiếu sự quyết đoán có thể gây trì trệ trong một số tình huống.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ lý tưởng nếu cả hai học cách chủ động và cân bằng. Sự kết hợp của hai nhà ngoại giao có thể tạo ra một gia đình hạnh phúc và bền vững. Việc cùng nhau lập kế hoạch và khuyến khích nhau phát triển sẽ giúp họ đạt được nhiều thành công.",
        "challenges": "Thách thức chính là sự thiếu quyết đoán và xu hướng né tránh vấn đề. Cả hai cần học cách đối mặt với khó khăn và đưa ra quyết định chung. Sự phụ thuộc quá mức có thể khiến gia đình thiếu năng lượng nếu không có sự đổi mới.",
        "suggestions": "Cả hai nên cùng nhau lập kế hoạch gia đình, như quản lý tài chính hoặc tổ chức các hoạt động chung, để tăng sự chủ động. Tham gia các lớp học kỹ năng hoặc hoạt động sáng tạo như làm gốm, nấu ăn có thể giúp tăng sự gắn kết. Duy trì giao tiếp cởi mở, tổ chức các buổi trò chuyện định kỳ để giải quyết vấn đề. Tạo không gian cá nhân để cả hai phát triển độc lập, giúp gia đình năng động hơn."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nSự hợp tác giữa hai số 2 (Nhà ngoại giao) có thể hiệu quả trong việc xây dựng mối quan hệ và duy trì hòa khí, nhưng có thể thiếu định hướng nếu cả hai không chủ động. Cả hai đều có kỹ năng ngoại giao, sự tinh tế và khả năng hợp tác, tạo nên một đội nhóm hài hòa. Tuy nhiên, họ cần một người dẫn dắt để đạt được kết quả lớn.",
        "strengths": "Cả hai đều giỏi xây dựng mạng lưới quan hệ, giải quyết xung đột và duy trì sự hài hòa trong nhóm. Họ có khả năng hỗ trợ lẫn nhau, tạo ra một môi trường làm việc thân thiện và hợp tác. Sự thấu hiểu về cách làm việc của nhau giúp họ phối hợp tốt trong các dự án cần sự tinh tế.",
        "weaknesses": "Cả hai có thể thiếu quyết đoán, dẫn đến việc trì hoãn các quyết định quan trọng. Sự nhạy cảm quá mức có thể khiến họ né tránh xung đột, gây chậm trễ trong công việc. Thiếu một người dẫn dắt có thể khiến đội nhóm thiếu định hướng rõ ràng.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực cần sự hợp tác và ngoại giao, như quan hệ công chúng hoặc dịch vụ khách hàng. Nếu có sự hỗ trợ từ một người dẫn dắt, họ có thể đạt được thành công lớn. Việc cùng nhau đặt mục tiêu và phân chia trách nhiệm sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự thiếu quyết đoán và xu hướng né tránh vấn đề. Cả hai cần học cách đưa ra quyết định nhanh chóng và đối mặt với xung đột. Thiếu định hướng có thể khiến dự án bị trì trệ nếu không có sự lãnh đạo rõ ràng.",
        "suggestions": "Cả hai nên tìm một người dẫn dắt hoặc phân chia vai trò rõ ràng để đảm bảo định hướng. Tham gia các buổi họp định kỳ để đưa ra quyết định và giải quyết vấn đề. Số 2 cần học cách tự tin đóng góp ý kiến và đối mặt với xung đột. Các hoạt động như brain-storming hoặc đào tạo kỹ năng lãnh đạo có thể giúp tăng sự chủ động và gắn kết."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 3 (Nhà sáng tạo) là sự kết hợp giữa sự dịu dàng và năng lượng sáng tạo. Số 2 mang đến sự nhạy cảm, hỗ trợ và khả năng hòa giải, trong khi số 3 cung cấp sự lạc quan, sáng tạo và yêu đời. Sự tương tác này tạo nên một tình yêu sôi động, nhưng sự khác biệt có thể vừa hấp dẫn vừa thử thách.",
        "strengths": "Số 2 mang lại sự thấu hiểu và an toàn cảm xúc, trong khi số 3 bổ sung bằng sự vui tươi và khả năng truyền cảm hứng. Họ có thể tạo ra những khoảnh khắc đáng nhớ, với số 3 làm sáng lên cuộc sống của số 2 và số 2 giúp số 3 ổn định hơn. Khả năng học hỏi lẫn nhau giúp số 2 tự tin hơn và số 3 kiên nhẫn hơn.",
        "weaknesses": "Số 2 có thể cảm thấy số 3 quá phóng khoáng hoặc thiếu tập trung, trong khi số 3 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Sự khác biệt trong ưu tiên (cảm xúc vs. trải nghiệm) có thể gây hiểu lầm nếu không được giải quyết.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách chấp nhận sự khác biệt. Sự kết hợp giữa hỗ trợ và sáng tạo có thể tạo ra một tình yêu phong phú, nơi cả hai cùng khám phá điều mới mẻ. Việc cùng tham gia các hoạt động sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên sự ổn định cảm xúc, số 3 hướng tới niềm vui và trải nghiệm. Số 2 cần tự tin bày tỏ nhu cầu, còn số 3 cần tôn trọng cảm xúc của số 2. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động sáng tạo như vẽ tranh, âm nhạc hoặc du lịch để tăng sự gắn kết. Số 2 cần học cách bày tỏ mong muốn rõ ràng, còn số 3 nên dành thời gian lắng nghe số 2. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò vui tươi như đi công viên hoặc tham gia lớp học nghệ thuật có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 3 (Nhà sáng tạo) mang đến sự kết hợp giữa sự chu đáo và năng lượng sáng tạo, tạo nên một gia đình sôi động nhưng cũng đầy thử thách. Số 2 mang đến tình yêu thương, sự chăm sóc và khả năng duy trì hòa khí, trong khi số 3 cung cấp sự lạc quan, sáng tạo và yêu đời. Sự tương phản này có thể tạo ra một gia đình phong phú, nhưng cần nỗ lực để duy trì sự hòa hợp.",
        "strengths": "Số 2 tạo ra một môi trường gia đình ấm áp và hỗ trợ, trong khi số 3 mang lại sự vui tươi và khả năng truyền cảm hứng. Họ có thể bổ sung cho nhau, với số 3 làm sáng lên cuộc sống gia đình và số 2 giúp số 3 ổn định hơn. Khả năng học hỏi lẫn nhau giúp số 2 tự tin hơn và số 3 trách nhiệm hơn.",
        "weaknesses": "Số 2 có thể cảm thấy số 3 thiếu trách nhiệm hoặc quá phóng khoáng, trong khi số 3 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Sự khác biệt trong ưu tiên (gia đình vs. trải nghiệm) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ phong phú nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa chăm sóc và sáng tạo có thể tạo ra một gia đình hạnh phúc và đa dạng. Việc cùng tham gia các hoạt động sáng tạo hoặc lập kế hoạch chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên sự ổn định, số 3 hướng tới niềm vui. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 3 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình sáng tạo, như trang trí nhà cửa hoặc đi du lịch, để tăng sự gắn kết. Số 2 cần học cách bày tỏ mong muốn, còn số 3 nên nỗ lực chia sẻ trách nhiệm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi trò chuyện định kỳ về mục tiêu gia đình có thể giúp cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 3 (Nhà sáng tạo) có thể hiệu quả trong các dự án sáng tạo, nhờ sự kết hợp giữa sự tinh tế và ý tưởng mới mẻ. Số 2 mang đến kỹ năng ngoại giao, sự hỗ trợ và khả năng xây dựng mối quan hệ, trong khi số 3 cung cấp sự sáng tạo, lạc quan và khả năng thu hút sự chú ý. Sự tương tác này tạo nên một đội nhóm năng động, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng mối quan hệ và duy trì hòa khí, trong khi số 3 mang lại ý tưởng sáng tạo và năng lượng tích cực. Họ có thể bổ sung cho nhau, với số 3 truyền cảm hứng và số 2 đảm bảo sự ổn định. Khả năng học hỏi lẫn nhau giúp số 2 tự tin hơn và số 3 tập trung hơn.",
        "weaknesses": "Số 2 có thể thấy số 3 thiếu kỷ luật hoặc quá phân tán, trong khi số 3 có thể cảm thấy số 2 quá chậm chạp hoặc nhạy cảm. Sự khác biệt trong phong cách làm việc (cẩn thận vs. tự do) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực sáng tạo như nghệ thuật hoặc truyền thông. Sự kết hợp giữa ngoại giao và sáng tạo có thể dẫn đến những dự án độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 cẩn thận và người định hướng, số 3 tự do và ý tưởng định hướng. Số 2 cần tự tin đóng góp ý kiến, còn số 3 cần tôn trọng kế hoạch. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 2 xử lý quan hệ đối ngoại và số 3 tập trung vào sáng tạo. Số 2 cần chủ động bày tỏ quan điểm, còn số 3 nên cố gắng tuân thủ kế hoạch. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp sáng tạo để đảm bảo đồng thuận. Các hoạt động như brain-storming hoặc tham gia hội thảo nghệ thuật có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 4 (Nhà xây dựng) là sự kết hợp giữa sự dịu dàng và sự ổn định. Số 2 mang đến sự nhạy cảm, hỗ trợ và khả năng hòa giải, trong khi số 4 cung cấp sự thực tế, kỷ luật và khả năng xây dựng nền tảng vững chắc. Sự tương tác này tạo nên một tình yêu đáng tin cậy, nhưng có thể thiếu cảm hứng nếu không có sự linh hoạt.",
        "strengths": "Số 2 mang lại sự thấu hiểu và an toàn cảm xúc, trong khi số 4 bổ sung bằng sự ổn định và khả năng thực hiện. Họ có thể tạo ra một mối quan hệ bền vững, với số 4 cung cấp cấu trúc và số 2 mang lại sự ấm áp. Khả năng học hỏi lẫn nhau giúp số 2 quyết đoán hơn và số 4 linh hoạt hơn.",
        "weaknesses": "Số 2 có thể cảm thấy số 4 quá cứng nhắc hoặc thiếu cảm xúc, trong khi số 4 có thể thấy số 2 quá nhạy cảm hoặc thiếu thực tế. Sự khác biệt trong ưu tiên (cảm xúc vs. thực tế) có thể gây hiểu lầm nếu không được giải quyết.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa hỗ trợ và thực tế có thể tạo ra một tình yêu ổn định và lâu dài. Việc cùng tham gia các hoạt động thực tế hoặc lập kế hoạch chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 4 ưu tiên cấu trúc. Số 2 cần tự tin bày tỏ nhu cầu, còn số 4 cần cởi mở hơn với cảm xúc. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động thực tế như lập kế hoạch tài chính hoặc làm việc chung trên một dự án để tăng sự gắn kết. Số 2 cần học cách bày tỏ mong muốn rõ ràng, còn số 4 nên dành thời gian thể hiện tình cảm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò đơn giản như đi dạo hoặc tổ chức bữa tối tại nhà có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 4 (Nhà xây dựng) là sự kết hợp giữa sự chu đáo và sự ổn định, tạo nên một gia đình vững chắc. Số 2 mang đến tình yêu thương, sự chăm sóc và khả năng duy trì hòa khí, trong khi số 4 cung cấp sự thực tế, kỷ luật và khả năng xây dựng nền tảng. Sự tương tác này giúp họ xây dựng một mái ấm đáng tin cậy nếu có sự tôn trọng lẫn nhau.",
        "strengths": "Số 2 tạo ra một môi trường gia đình ấm áp và hỗ trợ, trong khi số 4 mang lại sự ổn định và khả năng thực hiện. Họ bổ sung cho nhau, với số 2 giúp số 4 cởi mở hơn với cảm xúc và số 4 cung cấp cấu trúc cho số 2. Khả năng thấu hiểu lẫn nhau là điểm mạnh lớn, giúp gia đình phát triển hài hòa.",
        "weaknesses": "Số 2 có thể cảm thấy số 4 quá cứng nhắc hoặc thiếu lãng mạn, trong khi số 4 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Sự khác biệt trong ưu tiên (gia đình vs. thực tế) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ bền vững nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa chăm sóc và thực tế có thể tạo ra một gia đình hạnh phúc và ổn định. Việc cùng xây dựng mục tiêu chung và chia sẻ trách nhiệm sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là cân bằng giữa nhu cầu cảm xúc của số 2 và tính thực tế của số 4. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 4 cần dành thời gian cho cảm xúc. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình thực tế, như quản lý tài chính hoặc cải tạo nhà cửa, để tăng sự gắn kết. Số 2 cần tự tin chia sẻ mong muốn, còn số 4 nên thể hiện tình cảm nhiều hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các hoạt động như làm việc chung trên một dự án hoặc tham gia lớp học kỹ năng có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 4 (Nhà xây dựng) có thể rất hiệu quả nhờ sự kết hợp giữa sự tinh tế và tính thực tế. Số 2 mang đến kỹ năng ngoại giao, sự hỗ trợ và khả năng xây dựng mối quan hệ, trong khi số 4 cung cấp sự kỷ luật, thực tế và khả năng thực hiện. Sự tương tác này tạo nên một đội nhóm đáng tin cậy, với tiềm năng thành công nếu có sự phối hợp tốt.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng mối quan hệ và duy trì hòa khí, trong khi số 4 mang lại cấu trúc và khả năng thực hiện. Họ bổ sung cho nhau, với số 2 mang lại sự tinh tế và số 4 đảm bảo tiến độ. Khả năng học hỏi lẫn nhau giúp số 2 quyết đoán hơn và số 4 linh hoạt hơn.",
        "weaknesses": "Số 2 có thể cảm thấy số 4 quá cứng nhắc hoặc thiếu sáng tạo, trong khi số 4 có thể thấy số 2 quá chậm chạp hoặc nhạy cảm. Sự khác biệt trong phong cách làm việc (người định hướng vs. nhiệm vụ định hướng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực cần sự ổn định và ngoại giao, như quản lý dự án hoặc dịch vụ khách hàng. Sự kết hợp giữa ngoại giao và thực tế có thể dẫn đến những kết quả vững chắc. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 cẩn thận và người định hướng, số 4 kỷ luật và nhiệm vụ định hướng. Số 2 cần tự tin đóng góp ý kiến, còn số 4 cần cởi mở hơn với ý tưởng. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 2 xử lý quan hệ đối ngoại và số 4 tập trung vào thực hiện. Số 2 cần chủ động bày tỏ quan điểm, còn số 4 nên cố gắng linh hoạt hơn. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ để đảm bảo đồng thuận. Các hoạt động như lập kế hoạch dự án hoặc tham gia hội thảo kỹ năng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 60,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 5 (Nhà phiêu lưu) là sự kết hợp giữa sự dịu dàng và sự tự do. Số 2 mang đến sự nhạy cảm, hỗ trợ và khả năng hòa giải, trong khi số 5 cung cấp sự linh hoạt, năng lượng và tinh thần khám phá. Sự tương phản này tạo ra một tình yêu thú vị nhưng đầy thử thách do sự khác biệt trong ưu tiên.",
        "strengths": "Số 2 mang lại sự thấu hiểu và an toàn cảm xúc, trong khi số 5 bổ sung bằng sự năng động và khả năng truyền cảm hứng. Họ có thể tạo ra những trải nghiệm đáng nhớ, với số 5 mang lại sự mới mẻ và số 2 cung cấp sự ổn định. Khả năng học hỏi lẫn nhau giúp số 2 cởi mở hơn và số 5 chu đáo hơn.",
        "weaknesses": "Số 2 có thể cảm thấy số 5 quá bốc đồng hoặc thiếu cam kết, trong khi số 5 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Sự khác biệt trong ưu tiên (ổn định vs. tự do) có thể gây hiểu lầm nếu không được giải quyết.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách cân bằng sự khác biệt. Sự kết hợp giữa hỗ trợ và phiêu lưu có thể tạo ra một tình yêu độc đáo và đầy màu sắc. Việc cùng tham gia các hoạt động năng động sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên sự ổn định cảm xúc, số 5 hướng tới tự do và trải nghiệm. Số 2 cần tự tin bày tỏ nhu cầu, còn số 5 cần cam kết hơn. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động năng động như du lịch, leo núi hoặc thử thách mới để tăng sự gắn kết. Số 2 cần học cách bày tỏ mong muốn rõ ràng, còn số 5 nên dành thời gian lắng nghe và cam kết. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò phiêu lưu như khám phá thành phố hoặc tham gia lớp học thể thao có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 5 (Nhà phiêu lưu) có thể gặp nhiều thử thách do sự khác biệt trong ưu tiên và phong cách sống. Số 2 mang đến tình yêu thương, sự chăm sóc và khả năng duy trì hòa khí, trong khi số 5 cung cấp sự linh hoạt, năng lượng và tinh thần khám phá. Sự tương phản này có thể hấp dẫn ban đầu, nhưng cần nỗ lực lớn để duy trì sự ổn định.",
        "strengths": "Số 2 tạo ra một môi trường gia đình ấm áp và hỗ trợ, trong khi số 5 mang lại sự mới mẻ và năng lượng tích cực. Họ có thể bổ sung cho nhau, với số 5 mang lại sự đổi mới và số 2 cung cấp sự ổn định. Khả năng học hỏi lẫn nhau giúp số 2 cởi mở hơn và số 5 trách nhiệm hơn.",
        "weaknesses": "Số 2 có thể cảm thấy số 5 thiếu cam kết hoặc quá bốc đồng, trong khi số 5 có thể thấy số 2 quá phụ thuộc hoặc nhạy cảm. Sự khác biệt trong ưu tiên (gia đình vs. tự do) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng sự khác biệt. Sự kết hợp giữa chăm sóc và phiêu lưu có thể tạo ra một gia đình độc đáo và năng động. Việc cùng xây dựng mục tiêu chung và tham gia các hoạt động mới sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên sự ổn định, số 5 hướng tới tự do. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 5 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình năng động, như đi du lịch hoặc thử thách mới, để tăng sự gắn kết. Số 2 cần tự tin chia sẻ mong muốn, còn số 5 nên nỗ lực cam kết hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi trò chuyện định kỳ về mục tiêu gia đình hoặc tham gia các hoạt động như cắm trại có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6.5/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 5 (Nhà phiêu lưu) có thể tạo ra những kết quả thú vị nhờ sự kết hợp giữa sự tinh tế và sự đổi mới. Số 2 mang đến kỹ năng ngoại giao, sự hỗ trợ và khả năng xây dựng mối quan hệ, trong khi số 5 cung cấp sự linh hoạt, sáng tạo và tinh thần khám phá. Sự tương tác này tạo nên một đội nhóm năng động, nhưng cần sự phối hợp để thành công.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng mối quan hệ và duy trì hòa khí, trong khi số 5 mang lại ý tưởng mới mẻ và năng lượng tích cực. Họ có thể bổ sung cho nhau, với số 5 truyền cảm hứng và số 2 đảm bảo sự ổn định. Khả năng học hỏi lẫn nhau giúp số 2 cởi mở hơn và số 5 tập trung hơn.",
        "weaknesses": "Số 2 có thể thấy số 5 thiếu kỷ luật hoặc quá bốc đồng, trong khi số 5 có thể cảm thấy số 2 quá chậm chạp hoặc nhạy cảm. Sự khác biệt trong phong cách làm việc (cẩn thận vs. tự do) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực đòi hỏi sự sáng tạo và ngoại giao, như truyền thông hoặc sự kiện. Sự kết hợp giữa ngoại giao và đổi mới có thể dẫn đến những dự án độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 cẩn thận và người định hướng, số 5 tự do và ý tưởng định hướng. Số 2 cần tự tin đóng góp ý kiến, còn số 5 cần tôn trọng kế hoạch. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 2 xử lý quan hệ đối ngoại và số 5 tập trung vào đổi mới. Số 2 cần chủ động bày tỏ quan điểm, còn số 5 nên cố gắng tuân thủ kế hoạch. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp sáng tạo để đảm bảo đồng thuận. Các hoạt động như brain-storming hoặc tham gia hội thảo sáng tạo có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 6 (Nhà chăm sóc) là sự kết hợp của sự dịu dàng và tình yêu thương. Số 2 mang đến sự nhạy cảm, hỗ trợ và khả năng hòa giải, trong khi số 6 cung cấp sự chu đáo, trách nhiệm và tình cảm sâu sắc. Sự tương đồng này tạo nên một tình yêu ấm áp và bền vững, nhưng cả hai cần tránh phụ thuộc quá mức.",
        "strengths": "Số 2 và số 6 đều ưu tiên cảm xúc và sự chăm sóc, tạo ra một mối quan hệ an toàn và yêu thương. Họ có khả năng thấu hiểu và hỗ trợ lẫn nhau, với số 2 mang lại sự hòa giải và số 6 mang lại sự chu đáo. Khả năng xây dựng một môi trường yêu thương là điểm mạnh lớn, giúp họ gắn kết sâu sắc.",
        "weaknesses": "Cả hai có thể quá nhạy cảm hoặc phụ thuộc, dẫn đến việc né tránh xung đột hoặc khó đưa ra quyết định. Số 2 có thể cảm thấy số 6 quá kiểm soát, trong khi số 6 có thể thấy số 2 thiếu quyết đoán. Sự phụ thuộc quá mức có thể gây mất cân bằng nếu không được giải quyết.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu sâu sắc nếu cả hai học cách tự tin và chủ động hơn. Sự kết hợp giữa hỗ trợ và chăm sóc có thể tạo ra một mối quan hệ bền vững và ý nghĩa. Việc cùng tham gia các hoạt động chăm sóc lẫn nhau sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự thiếu quyết đoán và xu hướng phụ thuộc. Cả hai cần học cách đối mặt với xung đột và bày tỏ nhu cầu rõ ràng. Sự phụ thuộc quá mức có thể khiến mối quan hệ trở nên ngột ngạt nếu thiếu không gian cá nhân.",
        "suggestions": "Cả hai nên tham gia các hoạt động chăm sóc như nấu ăn, làm vườn hoặc tham gia hoạt động từ thiện để tăng sự gắn kết. Số 2 cần học cách bày tỏ mong muốn rõ ràng, còn số 6 nên khuyến khích sự độc lập của số 2. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các buổi hẹn hò ấm cúng như tổ chức bữa tối tại nhà hoặc đi dạo có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 90,
      "details": {
        "overview": "9/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 6 (Nhà chăm sóc) là sự kết hợp của sự yêu thương và trách nhiệm, tạo nên một gia đình ấm áp và bền vững. Số 2 mang đến sự nhạy cảm, hỗ trợ và khả năng hòa giải, trong khi số 6 cung cấp sự chu đáo, trách nhiệm và khả năng xây dựng mái ấm. Sự tương đồng này giúp họ tạo ra một gia đình hạnh phúc nếu có sự cân bằng.",
        "strengths": "Số 2 và số 6 đều ưu tiên gia đình và cảm xúc, tạo ra một môi trường yêu thương và an toàn. Họ bổ sung cho nhau, với số 2 mang lại sự hòa giải và số 6 mang lại sự chu đáo. Khả năng thấu hiểu và chăm sóc lẫn nhau là điểm mạnh lớn, giúp gia đình vượt qua khó khăn.",
        "weaknesses": "Cả hai có thể quá phụ thuộc hoặc nhạy cảm, dẫn đến việc né tránh xung đột hoặc khó đưa ra quyết định lớn. Số 2 có thể cảm thấy số 6 quá kiểm soát, trong khi số 6 có thể thấy số 2 thiếu quyết đoán. Sự phụ thuộc quá mức có thể gây trì trệ nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ lý tưởng nếu cả hai học cách chủ động và cân bằng. Sự kết hợp giữa hỗ trợ và chăm sóc có thể tạo ra một gia đình hạnh phúc và ổn định. Việc cùng xây dựng mục tiêu chung và chia sẻ trách nhiệm sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự thiếu quyết đoán và xu hướng phụ thuộc. Cả hai cần học cách đối mặt với khó khăn và đưa ra quyết định chung. Sự phụ thuộc quá mức có thể khiến gia đình thiếu năng lượng nếu thiếu sự đổi mới.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình chăm sóc, như làm vườn, nấu ăn hoặc tham gia hoạt động từ thiện, để tăng sự gắn kết. Số 2 cần tự tin chia sẻ mong muốn, còn số 6 nên khuyến khích sự độc lập của số 2. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các buổi trò chuyện định kỳ về mục tiêu gia đình hoặc tham gia lớp học kỹ năng có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 6 (Nhà chăm sóc) có thể hiệu quả trong các dự án cần sự chăm sóc và ngoại giao. Số 2 mang đến kỹ năng ngoại giao, sự hỗ trợ và khả năng xây dựng mối quan hệ, trong khi số 6 cung cấp sự chu đáo, trách nhiệm và khả năng duy trì sự hài hòa. Sự tương đồng này tạo nên một đội nhóm thân thiện, nhưng cần sự lãnh đạo để đạt kết quả lớn.",
        "strengths": "Số 2 và số 6 đều giỏi xây dựng mối quan hệ và duy trì hòa khí, tạo ra một môi trường làm việc hỗ trợ. Họ bổ sung cho nhau, với số 2 mang lại sự tinh tế và số 6 mang lại sự chu đáo. Khả năng thấu hiểu và hỗ trợ lẫn nhau là điểm mạnh lớn, giúp đội nhóm hoạt động hiệu quả trong các dự án cần sự chăm sóc.",
        "weaknesses": "Cả hai có thể thiếu quyết đoán, dẫn đến việc trì hoãn các quyết định quan trọng. Số 2 có thể cảm thấy số 6 quá kiểm soát, trong khi số 6 có thể thấy số 2 quá nhạy cảm. Thiếu một người dẫn dắt có thể khiến đội nhóm thiếu định hướng.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như dịch vụ cộng đồng, giáo dục hoặc chăm sóc khách hàng. Sự kết hợp giữa ngoại giao và chăm sóc có thể dẫn đến những kết quả ý nghĩa. Việc phân chia vai trò rõ ràng và tìm sự hỗ trợ lãnh đạo sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự thiếu quyết đoán và xu hướng né tránh xung đột. Cả hai cần học cách đưa ra quyết định nhanh chóng và đối mặt với vấn đề. Thiếu định hướng có thể khiến dự án bị trì trệ nếu không có sự lãnh đạo rõ ràng.",
        "suggestions": "Cả hai nên tìm một người dẫn dắt hoặc phân chia vai trò rõ ràng để đảm bảo định hướng. Tham gia các buổi họp định kỳ để đưa ra quyết định và giải quyết vấn đề. Số 2 cần tự tin đóng góp ý kiến, còn số 6 nên khuyến khích sự độc lập của số 2. Các hoạt động như tham gia dự án cộng đồng hoặc đào tạo kỹ năng có thể tăng sự gắn kết."
      }
    },
     {
      "partnerNumber": 7,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5.5/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 7 (Nhà hiền triết) gặp thử thách do sự khác biệt giữa cảm xúc và nội tâm. Số 2 mang đến sự nhạy cảm, hỗ trợ và hòa giải, trong khi số 7 tập trung vào suy ngẫm, tri thức và sự độc lập. Sự tương phản này có thể tạo ra một tình yêu sâu sắc nếu cả hai cởi mở, nhưng thường khó kết nối.",
        "strengths": "Số 2 mang lại sự thấu hiểu và an toàn cảm xúc, trong khi số 7 bổ sung bằng sự sâu sắc và tư duy triết học. Họ có thể học hỏi lẫn nhau, với số 2 giúp số 7 cởi mở hơn và số 7 khuyến khích số 2 suy ngẫm sâu hơn. Sự kết hợp này có thể tạo ra những cuộc trò chuyện ý nghĩa.",
        "weaknesses": "Số 2 có thể cảm thấy số 7 quá xa cách hoặc thiếu cảm xúc, trong khi số 7 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Sự khác biệt trong ưu tiên (cảm xúc vs. tinh thần) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa hỗ trợ và suy ngẫm có thể tạo ra một tình yêu độc đáo. Việc cùng tham gia các hoạt động tinh thần sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 cần kết nối cảm xúc, số 7 ưu tiên sự độc lập. Số 2 cần tự tin bày tỏ nhu cầu, còn số 7 cần cởi mở hơn với cảm xúc. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động tinh thần như thiền, đọc sách hoặc thảo luận triết học để tăng sự gắn kết. Số 2 cần bày tỏ mong muốn rõ ràng, còn số 7 nên dành thời gian lắng nghe. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như đi bảo tàng hoặc trò chuyện sâu sắc có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 50,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 7 (Nhà hiền triết) đối mặt với nhiều thử thách do sự khác biệt trong ưu tiên. Số 2 mang đến sự chăm sóc, hòa giải và tình yêu thương, trong khi số 7 tập trung vào nội tâm, tri thức và sự độc lập. Sự tương phản này có thể tạo ra một gia đình độc đáo nếu cả hai nỗ lực, nhưng cần giao tiếp để duy trì hòa hợp.",
        "strengths": "Số 2 tạo ra một môi trường gia đình ấm áp và hỗ trợ, trong khi số 7 mang lại sự sâu sắc và tư duy logic. Họ có thể bổ sung cho nhau, với số 2 giúp số 7 quan tâm hơn đến gia đình và số 7 khuyến khích số 2 phát triển trí tuệ. Sự kết hợp này có thể tạo ra một gia đình cân bằng nếu tôn trọng lẫn nhau.",
        "weaknesses": "Số 2 có thể cảm thấy số 7 quá xa cách hoặc thiếu cam kết, trong khi số 7 có thể thấy số 2 quá phụ thuộc hoặc nhạy cảm. Sự khác biệt trong ưu tiên (gia đình vs. cá nhân) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng sự khác biệt. Sự kết hợp giữa chăm sóc và suy ngẫm có thể tạo ra một gia đình ý nghĩa. Việc cùng xây dựng mục tiêu chung và tham gia các hoạt động tinh thần sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 7 ưu tiên độc lập. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 7 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các buổi trò chuyện sâu sắc hoặc tham gia các hoạt động tinh thần như thiền, đọc sách để tăng sự gắn kết. Số 2 cần tự tin chia sẻ mong muốn, còn số 7 nên nỗ lực thể hiện tình cảm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia lớp học triết học hoặc nghiên cứu chung có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 7 (Nhà hiền triết) có thể hiệu quả trong các dự án cần sự tinh tế và phân tích sâu sắc. Số 2 mang đến kỹ năng ngoại giao, sự hỗ trợ và khả năng xây dựng mối quan hệ, trong khi số 7 cung cấp sự suy ngẫm, tri thức và tư duy logic. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng cần lãnh đạo để định hướng.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng mối quan hệ và duy trì hòa khí, trong khi số 7 mang lại phân tích sâu sắc và tư duy sáng tạo. Họ có thể bổ sung cho nhau, với số 2 mang lại sự tinh tế và số 7 đảm bảo chất lượng. Khả năng học hỏi lẫn nhau giúp số 2 tư duy logic hơn và số 7 cởi mở hơn.",
        "weaknesses": "Số 2 có thể cảm thấy số 7 quá xa cách hoặc chậm quyết định, trong khi số 7 có thể thấy số 2 quá nhạy cảm hoặc thiếu tập trung. Sự khác biệt trong phong cách làm việc (người định hướng vs. phân tích) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghiên cứu hoặc tư vấn. Sự kết hợp giữa ngoại giao và phân tích có thể dẫn đến những kết quả chất lượng. Việc phân chia vai trò rõ ràng và tìm sự hỗ trợ lãnh đạo sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 cẩn thận và người định hướng, số 7 độc lập và phân tích. Số 2 cần tự tin đóng góp ý kiến, còn số 7 cần tôn trọng kế hoạch. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 2 xử lý quan hệ đối ngoại và số 7 tập trung vào phân tích. Số 2 cần chủ động bày tỏ quan điểm, còn số 7 nên cố gắng cởi mở hơn. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ để đảm bảo đồng thuận. Các hoạt động như tham gia hội thảo nghiên cứu hoặc brain-storming có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 8 (Nhà quyền lực) là sự kết hợp giữa sự dịu dàng và tham vọng. Số 2 mang đến sự nhạy cảm, hỗ trợ và hòa giải, trong khi số 8 cung cấp sự quyết đoán, tham vọng và định hướng thành công. Sự tương phản này tạo nên một tình yêu ổn định nhưng có thể gặp thử thách nếu số 8 quá kiểm soát.",
        "strengths": "Số 2 mang lại sự thấu hiểu và an toàn cảm xúc, trong khi số 8 bổ sung bằng sự tự tin và khả năng dẫn dắt. Họ có thể bổ sung cho nhau, với số 2 làm dịu sự căng thẳng của số 8 và số 8 khuyến khích số 2 quyết đoán hơn. Sự kết hợp này có thể tạo ra một mối quan hệ cân bằng và đầy động lực.",
        "weaknesses": "Số 2 có thể cảm thấy bị lu mờ bởi phong cách mạnh mẽ của số 8, trong khi số 8 có thể thấy số 2 quá nhạy cảm hoặc thiếu tham vọng. Sự khác biệt trong ưu tiên (cảm xúc vs. thành công) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa hỗ trợ và lãnh đạo có thể tạo ra một tình yêu bền vững. Việc cùng lập kế hoạch chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 8 tập trung vào mục tiêu. Số 2 cần tự tin bày tỏ nhu cầu, còn số 8 cần tránh kiểm soát quá mức. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động lập kế hoạch như quản lý tài chính hoặc tổ chức sự kiện để tăng sự gắn kết. Số 2 cần bày tỏ mong muốn rõ ràng, còn số 8 nên dành thời gian thể hiện tình cảm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tổ chức bữa tối hoặc đi du lịch có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 8 (Nhà quyền lực) là sự kết hợp giữa sự chăm sóc và tham vọng, tạo nên một gia đình ổn định nhưng cần sự cân bằng. Số 2 mang đến tình yêu thương, hòa giải và sự hỗ trợ, trong khi số 8 cung cấp sự quyết đoán, ổn định tài chính và định hướng. Sự tương phản này có thể xây dựng một mái ấm vững chắc nếu cả hai tôn trọng lẫn nhau.",
        "strengths": "Số 2 tạo ra một môi trường gia đình ấm áp và hỗ trợ, trong khi số 8 mang lại sự ổn định và khả năng lãnh đạo. Họ bổ sung cho nhau, với số 2 giúp số 8 quan tâm hơn đến cảm xúc và số 8 khuyến khích số 2 tự tin hơn. Khả năng thấu hiểu và hỗ trợ lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 2 có thể cảm thấy bị lu mờ bởi tham vọng của số 8, trong khi số 8 có thể thấy số 2 quá phụ thuộc hoặc nhạy cảm. Sự khác biệt trong ưu tiên (gia đình vs. sự nghiệp) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng sự khác biệt. Sự kết hợp giữa chăm sóc và lãnh đạo có thể tạo ra một gia đình hạnh phúc và thành công. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong ưu tiên: số 2 cần cảm xúc, số 8 tập trung vào thành công. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 8 cần dành thời gian cho gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như lập kế hoạch tài chính hoặc cải tạo nhà cửa để tăng sự gắn kết. Số 2 cần tự tin chia sẻ mong muốn, còn số 8 nên thể hiện tình cảm nhiều hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các hoạt động như tham gia lớp học kỹ năng hoặc tổ chức sự kiện gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 8 (Nhà quyền lực) có thể rất hiệu quả nhờ sự kết hợp giữa sự tinh tế và tham vọng. Số 2 mang đến kỹ năng ngoại giao, sự hỗ trợ và khả năng xây dựng mối quan hệ, trong khi số 8 cung cấp sự quyết đoán, chiến lược và định hướng thành công. Sự tương tác này tạo nên một đội nhóm mạnh mẽ, với tiềm năng đạt kết quả lớn.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng mạng lưới quan hệ và duy trì hòa khí, trong khi số 8 dẫn dắt với tầm nhìn chiến lược. Họ bổ sung cho nhau, với số 2 mang lại sự tinh tế và số 8 đảm bảo tiến độ. Khả năng học hỏi lẫn nhau giúp số 2 quyết đoán hơn và số 8 lắng nghe tốt hơn.",
        "weaknesses": "Số 2 có thể cảm thấy bị áp đảo bởi phong cách mạnh mẽ của số 8, trong khi số 8 có thể thấy số 2 quá chậm chạp hoặc nhạy cảm. Sự khác biệt trong tốc độ làm việc có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như kinh doanh hoặc quản lý dự án. Sự kết hợp giữa ngoại giao và chiến lược có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 cẩn thận và người định hướng, số 8 nhanh và mục tiêu định hướng. Số 2 cần tự tin đóng góp ý kiến, còn số 8 cần tránh kiểm soát quá mức. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 2 xử lý quan hệ đối ngoại và số 8 tập trung vào chiến lược. Số 2 cần chủ động bày tỏ quan điểm, còn số 8 nên lắng nghe ý kiến của số 2. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ để đảm bảo đồng thuận. Các hoạt động như tham gia hội thảo kinh doanh hoặc xây dựng đội nhóm có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 9 (Nhà nhân đạo) là sự kết hợp của sự dịu dàng và lòng nhân ái. Số 2 mang đến sự nhạy cảm, hỗ trợ và hòa giải, trong khi số 9 cung cấp sự lý tưởng, nhân ái và khả năng truyền cảm hứng. Sự tương đồng về lòng trắc ẩn tạo nên một tình yêu sâu sắc, nhưng cần sự thực tế để duy trì.",
        "strengths": "Số 2 và số 9 đều có lòng nhân ái, tạo ra một mối quan hệ yêu thương và ý nghĩa. Số 2 mang lại sự thấu hiểu và an toàn cảm xúc, trong khi số 9 bổ sung bằng tầm nhìn lớn và sự nhiệt huyết. Họ có thể truyền cảm hứng lẫn nhau, với số 2 giúp số 9 thực tế hơn và số 9 khuyến khích số 2 mở rộng trái tim.",
        "weaknesses": "Số 2 có thể cảm thấy số 9 quá lý tưởng hoặc thiếu tập trung vào cá nhân, trong khi số 9 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Sự khác biệt trong ưu tiên (cá nhân vs. cộng đồng) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu sâu sắc nếu cả hai học cách cân bằng lý tưởng và thực tế. Sự kết hợp giữa hỗ trợ và nhân ái có thể tạo ra một mối quan hệ ý nghĩa. Việc cùng tham gia các hoạt động cộng đồng sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc cá nhân, số 9 hướng tới mục tiêu lớn. Số 2 cần tự tin bày tỏ nhu cầu, còn số 9 cần tập trung hơn vào mối quan hệ. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động cộng đồng như tình nguyện hoặc từ thiện để tăng sự gắn kết. Số 2 cần bày tỏ mong muốn rõ ràng, còn số 9 nên dành thời gian cho số 2. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như trò chuyện sâu sắc hoặc tham gia sự kiện xã hội có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8.5/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 9 (Nhà nhân đạo) là sự kết hợp của sự chăm sóc và lòng nhân ái, tạo nên một gia đình ý nghĩa. Số 2 mang đến tình yêu thương, hòa giải và sự hỗ trợ, trong khi số 9 cung cấp sự lý tưởng, nhân ái và tầm nhìn lớn. Sự tương đồng này giúp họ xây dựng một mái ấm hạnh phúc nếu cân bằng được lý tưởng và thực tế.",
        "strengths": "Số 2 và số 9 đều có lòng trắc ẩn, tạo ra một môi trường gia đình yêu thương và hỗ trợ. Số 2 mang lại sự thấu hiểu và hòa khí, trong khi số 9 bổ sung bằng sự nhiệt huyết và mục tiêu lớn. Họ bổ sung cho nhau, với số 2 giúp số 9 thực tế hơn và số 9 khuyến khích số 2 mở rộng tầm nhìn.",
        "weaknesses": "Số 2 có thể cảm thấy số 9 quá tập trung vào lý tưởng mà bỏ qua gia đình, trong khi số 9 có thể thấy số 2 quá phụ thuộc hoặc nhạy cảm. Sự khác biệt trong ưu tiên (gia đình vs. cộng đồng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ lý tưởng nếu cả hai học cách cân bằng. Sự kết hợp giữa chăm sóc và nhân ái có thể tạo ra một gia đình hạnh phúc và ý nghĩa. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong ưu tiên: số 2 cần cảm xúc cá nhân, số 9 hướng tới mục tiêu lớn. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 9 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình ý nghĩa như tham gia từ thiện hoặc lập kế hoạch cộng đồng để tăng sự gắn kết. Số 2 cần tự tin chia sẻ mong muốn, còn số 9 nên dành thời gian cho gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia dự án xã hội hoặc trò chuyện về mục tiêu có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 9 (Nhà nhân đạo) có thể rất hiệu quả trong các dự án cộng đồng. Số 2 mang đến kỹ năng ngoại giao, sự hỗ trợ và khả năng xây dựng mối quan hệ, trong khi số 9 cung cấp sự lý tưởng, nhân ái và khả năng truyền cảm hứng. Sự tương đồng này tạo nên một đội nhóm ý nghĩa, với tiềm năng tạo ra tác động lớn.",
        "strengths": "Số 2 và số 9 đều có lòng nhân ái, giúp họ phối hợp tốt trong các dự án xã hội. Số 2 hỗ trợ bằng cách xây dựng mối quan hệ và duy trì hòa khí, trong khi số 9 mang lại tầm nhìn lớn và nhiệt huyết. Họ bổ sung cho nhau, với số 2 đảm bảo sự ổn định và số 9 truyền cảm hứng.",
        "weaknesses": "Số 2 có thể cảm thấy số 9 quá lý tưởng hoặc thiếu thực tế, trong khi số 9 có thể thấy số 2 quá chậm chạp hoặc nhạy cảm. Sự khác biệt trong phong cách làm việc (cẩn thận vs. lý tưởng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như từ thiện, giáo dục hoặc truyền thông xã hội. Sự kết hợp giữa ngoại giao và nhân ái có thể dẫn đến những kết quả ý nghĩa. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 cẩn thận và người định hướng, số 9 lý tưởng và mục tiêu định hướng. Số 2 cần tự tin đóng góp ý kiến, còn số 9 cần tôn trọng kế hoạch. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 2 xử lý quan hệ đối ngoại và số 9 tập trung vào tầm nhìn. Số 2 cần chủ động bày tỏ quan điểm, còn số 9 nên cố gắng thực tế hơn. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ để đảm bảo đồng thuận. Các hoạt động như tham gia dự án xã hội hoặc hội thảo cộng đồng có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 11 (Nhà truyền cảm hứng) là sự kết hợp giữa cảm xúc và trực giác tinh thần. Số 2 mang đến sự nhạy cảm, hỗ trợ và hòa giải, trong khi số 11 cung cấp sự trực giác, lý tưởng và khả năng truyền cảm hứng. Sự tương tác này tạo ra một tình yêu sâu sắc nhưng có thể gặp thử thách nếu số 11 quá mơ mộng.",
        "strengths": "Số 2 mang lại sự thấu hiểu và an toàn cảm xúc, trong khi số 11 bổ sung bằng sự trực giác và tầm nhìn tinh thần. Họ có thể truyền cảm hứng lẫn nhau, với số 2 làm dịu sự căng thẳng của số 11 và số 11 khuyến khích số 2 khám phá chiều sâu tinh thần. Sự kết hợp này có thể tạo ra một mối quan hệ đồng điệu.",
        "weaknesses": "Số 2 có thể cảm thấy số 11 quá lý tưởng hoặc thiếu thực tế, trong khi số 11 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Sự khác biệt trong ưu tiên (cảm xúc vs. tinh thần) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách cân bằng thực tế và lý tưởng. Sự kết hợp giữa hỗ trợ và truyền cảm hứng có thể tạo ra một tình yêu phong phú. Việc cùng tham gia các hoạt động tinh thần sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 11 hướng tới trực giác. Số 2 cần tự tin bày tỏ nhu cầu, còn số 11 cần tập trung hơn vào thực tế. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động tinh thần như thiền, yoga hoặc sáng tạo nghệ thuật để tăng sự gắn kết. Số 2 cần bày tỏ mong muốn rõ ràng, còn số 11 nên nỗ lực hiện thực hóa lý tưởng. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như viết nhật ký chung hoặc tham gia hội thảo tâm lý có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 11 (Nhà truyền cảm hứng) là sự kết hợp giữa sự chăm sóc và trực giác tinh thần, tạo nên một gia đình sâu sắc nhưng cần sự thực tế. Số 2 mang đến tình yêu thương, hòa giải và sự hỗ trợ, trong khi số 11 cung cấp sự trực giác, lý tưởng và tầm nhìn tinh thần. Sự tương tác này có thể xây dựng một mái ấm ý nghĩa nếu cả hai cân bằng được lý tưởng và thực tế.",
        "strengths": "Số 2 tạo ra một môi trường gia đình ấm áp và hỗ trợ, trong khi số 11 mang lại sự trực giác và khả năng truyền cảm hứng. Họ bổ sung cho nhau, với số 2 giúp số 11 thực tế hơn và số 11 khuyến khích số 2 khám phá chiều sâu tinh thần. Khả năng thấu hiểu và hỗ trợ lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 2 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu cam kết, trong khi số 11 có thể thấy số 2 quá phụ thuộc hoặc nhạy cảm. Sự khác biệt trong ưu tiên (gia đình vs. tinh thần) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa chăm sóc và truyền cảm hứng có thể tạo ra một gia đình phong phú và ý nghĩa. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong ưu tiên: số 2 cần cảm xúc, số 11 hướng tới lý tưởng. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 11 cần chia sẻ trách nhiệm gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình tinh thần như thiền, yoga hoặc tham gia hội thảo tâm lý để tăng sự gắn kết. Số 2 cần tự tin chia sẻ mong muốn, còn số 11 nên nỗ lực thực tế hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như viết nhật ký chung hoặc thảo luận về mục tiêu có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 11 (Nhà truyền cảm hứng) có thể hiệu quả trong các dự án sáng tạo hoặc tinh thần. Số 2 mang đến kỹ năng ngoại giao, sự hỗ trợ và khả năng xây dựng mối quan hệ, trong khi số 11 cung cấp sự trực giác, lý tưởng và khả năng truyền cảm hứng. Sự tương tác này tạo nên một đội nhóm đồng điệu, nhưng cần sự thực tế để thành công.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng mối quan hệ và duy trì hòa khí, trong khi số 11 mang lại trực giác và tầm nhìn lớn. Họ bổ sung cho nhau, với số 2 đảm bảo sự ổn định và số 11 truyền cảm hứng. Khả năng học hỏi lẫn nhau giúp số 2 khám phá tinh thần và số 11 thực tế hơn.",
        "weaknesses": "Số 2 có thể cảm thấy số 11 quá mơ mộng hoặc thiếu kỷ luật, trong khi số 11 có thể thấy số 2 quá chậm chạp hoặc nhạy cảm. Sự khác biệt trong phong cách làm việc (cẩn thận vs. lý tưởng) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như nghệ thuật, tư vấn hoặc dự án tinh thần. Sự kết hợp giữa ngoại giao và truyền cảm hứng có thể dẫn đến những kết quả độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 cẩn thận và người định hướng, số 11 lý tưởng và trực giác định hướng. Số 2 cần tự tin đóng góp ý kiến, còn số 11 cần tôn trọng kế hoạch. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 2 xử lý quan hệ đối ngoại và số 11 tập trung vào tầm nhìn. Số 2 cần chủ động bày tỏ quan điểm, còn số 11 nên cố gắng thực tế hơn. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ để đảm bảo đồng thuận. Các hoạt động như tham gia hội thảo sáng tạo hoặc thiền có thể tăng sự gắn kết."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 22 (Nhà xây dựng bậc thầy) là sự kết hợp giữa sự dịu dàng và tham vọng lớn. Số 2 mang đến sự nhạy cảm, hỗ trợ và hòa giải, trong khi số 22 cung cấp tầm nhìn vĩ đại, thực tế và khả năng hiện thực hóa giấc mơ. Sự tương phản này tạo nên một tình yêu ổn định nhưng có thể gặp thử thách nếu số 22 quá tập trung vào mục tiêu.",
        "strengths": "Số 2 mang lại sự thấu hiểu và an toàn cảm xúc, trong khi số 22 bổ sung bằng sự quyết tâm và khả năng thực hiện. Họ có thể bổ sung cho nhau, với số 2 làm dịu căng thẳng của số 22 và số 22 khuyến khích số 2 hướng tới mục tiêu lớn. Sự kết hợp này có thể tạo ra một mối quan hệ cân bằng.",
        "weaknesses": "Số 2 có thể cảm thấy bị lu mờ bởi tham vọng của số 22, trong khi số 22 có thể thấy số 2 quá nhạy cảm hoặc thiếu thực tế. Sự khác biệt trong ưu tiên (cảm xúc vs. mục tiêu) có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa hỗ trợ và tham vọng có thể tạo ra một tình yêu bền vững và ý nghĩa. Việc cùng lập kế hoạch chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 22 tập trung vào thành công lớn. Số 2 cần tự tin bày tỏ nhu cầu, còn số 22 cần dành thời gian cho cảm xúc. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tham gia các hoạt động lập kế hoạch như quản lý dự án cá nhân hoặc tổ chức sự kiện để tăng sự gắn kết. Số 2 cần bày tỏ mong muốn rõ ràng, còn số 22 nên dành thời gian thể hiện tình cảm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân. Các buổi hẹn hò như tổ chức bữa tối hoặc tham gia hội thảo mục tiêu có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7.5/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 22 (Nhà xây dựng bậc thầy) là sự kết hợp giữa sự chăm sóc và tham vọng vĩ đại, tạo nên một gia đình ổn định nhưng cần sự cân bằng. Số 2 mang đến tình yêu thương, hòa giải và sự hỗ trợ, trong khi số 22 cung cấp tầm nhìn lớn, thực tế và khả năng xây dựng. Sự tương phản này có thể xây dựng một mái ấm ý nghĩa nếu cả hai tôn trọng lẫn nhau.",
        "strengths": "Số 2 tạo ra một môi trường gia đình ấm áp và hỗ trợ, trong khi số 22 mang lại sự ổn định và khả năng thực hiện mục tiêu lớn. Họ bổ sung cho nhau, với số 2 giúp số 22 quan tâm hơn đến cảm xúc và số 22 khuyến khích số 2 hướng tới thành công. Khả năng thấu hiểu và hỗ trợ lẫn nhau là điểm mạnh lớn.",
        "weaknesses": "Số 2 có thể cảm thấy bị lu mờ bởi tham vọng của số 22, trong khi số 22 có thể thấy số 2 quá phụ thuộc hoặc nhạy cảm. Sự khác biệt trong ưu tiên (gia đình vs. mục tiêu lớn) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa chăm sóc và tham vọng có thể tạo ra một gia đình hạnh phúc và thành công. Việc cùng xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong ưu tiên: số 2 cần cảm xúc, số 22 tập trung vào mục tiêu lớn. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 22 cần dành thời gian cho gia đình. Những bất đồng nhỏ có thể leo thang nếu thiếu giao tiếp.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như lập kế hoạch tài chính hoặc cải tạo nhà cửa để tăng sự gắn kết. Số 2 cần tự tin chia sẻ mong muốn, còn số 22 nên thể hiện tình cảm nhiều hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai phát triển cá nhân. Các hoạt động như tham gia hội thảo mục tiêu hoặc tổ chức sự kiện gia đình có thể cải thiện mối quan hệ."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 22 (Nhà xây dựng bậc thầy) có thể rất hiệu quả nhờ sự kết hợp giữa sự tinh tế và tham vọng lớn. Số 2 mang đến kỹ năng ngoại giao, sự hỗ trợ và khả năng xây dựng mối quan hệ, trong khi số 22 cung cấp tầm nhìn vĩ đại, thực tế và khả năng thực hiện. Sự tương tác này tạo nên một đội nhóm mạnh mẽ, với tiềm năng đạt kết quả ấn tượng.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng mạng lưới quan hệ và duy trì hòa khí, trong khi số 22 dẫn dắt với tầm nhìn lớn và khả năng thực hiện. Họ bổ sung cho nhau, với số 2 mang lại sự tinh tế và số 22 đảm bảo tiến độ. Khả năng học hỏi lẫn nhau giúp số 2 quyết đoán hơn và số 22 lắng nghe tốt hơn.",
        "weaknesses": "Số 2 có thể cảm thấy bị áp đảo bởi phong cách mạnh mẽ của số 22, trong khi số 22 có thể thấy số 2 quá chậm chạp hoặc nhạy cảm. Sự khác biệt trong tốc độ làm việc có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng trong các lĩnh vực như kinh doanh, kiến trúc hoặc dự án cộng đồng. Sự kết hợp giữa ngoại giao và tham vọng có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 cẩn thận và người định hướng, số 22 nhanh và mục tiêu định hướng. Số 2 cần tự tin đóng góp ý kiến, còn số 22 cần tránh kiểm soát quá mức. Những mâu thuẫn nhỏ có thể nảy sinh nếu thiếu sự phối hợp.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 2 xử lý quan hệ đối ngoại và số 22 tập trung vào chiến lược. Số 2 cần chủ động bày tỏ quan điểm, còn số 22 nên lắng nghe ý kiến của số 2. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ để đảm bảo đồng thuận. Các hoạt động như tham gia hội thảo kinh doanh hoặc lập kế hoạch dự án có thể tăng sự gắn kết."
      }
    }
  ]
}