{
  "number": 2,
  "description": "Số đường đời 2 đại diện cho sự hợp tác, nhạy cảm và ngoại giao. Những người mang số 2 thường hòa nhã, biết lắng nghe, và có khả năng xây dựng mối quan hệ bền vững. Họ nhạy bén với cảm xúc của người khác, luôn tìm cách duy trì hòa bình và hỗ trợ những người xung quanh. Tuy nhiên, họ có thể dễ bị tổn thương hoặc thiếu quyết đoán, đôi khi phụ thuộc quá nhiều vào ý kiến của người khác.",
  "compatibility": [
    {
      "partnerNumber": 1,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 1 (Nhà lãnh đạo) là sự kết hợp hài hòa giữa sự nhạy cảm và tham vọng. Số 2 mang lại sự thấu hiểu, hỗ trợ và khả năng hòa giải, trong khi số 1 cung cấp định hướng, sự quyết đoán và tinh thần tiên phong. Sự tương phản này tạo ra một tình yêu cân bằng và hấp dẫn, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 2 hỗ trợ số 1 bằng sự quan tâm và khả năng xây dựng hòa bình, trong khi số 1 mang lại sự tự tin và động lực cho số 2. Họ bổ sung cho nhau, với số 2 học được sự quyết đoán và số 1 học được sự kiên nhẫn. Sự thấu hiểu lẫn nhau tạo nên một mối quan hệ lãng mạn, nơi cả hai cùng phát triển.",
        "weaknesses": "Số 2 có thể cảm thấy bị áp đảo bởi phong cách mạnh mẽ của số 1, trong khi số 1 có thể thấy số 2 quá nhạy cảm hoặc thiếu quyết đoán. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong cách thể hiện tình cảm có thể gây hiểu lầm nếu không giao tiếp rõ ràng.",
        "potential": "Mối quan hệ này có tiềm năng phát triển mạnh mẽ nếu cả hai tôn trọng sự khác biệt. Sự kết hợp giữa hỗ trợ và lãnh đạo tạo ra một tình yêu sâu sắc, nơi cả hai cùng trưởng thành. Việc cùng nhau chia sẻ cảm xúc và mục tiêu sẽ giúp họ xây dựng một mối quan hệ bền vững và đầy cảm hứng.",
        "challenges": "Thách thức lớn nhất là cân bằng giữa nhu cầu cảm xúc của số 2 và tham vọng của số 1. Số 2 cần tự tin bày tỏ nhu cầu, còn số 1 cần tránh kiểm soát quá mức. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn. Những bất đồng nhỏ có thể leo thang nếu không có giao tiếp cởi mở.",
        "suggestions": "Cả hai nên dành thời gian lắng nghe và thấu hiểu lẫn nhau. Số 2 nên thẳng thắn chia sẻ cảm xúc, còn số 1 cần thể hiện tình cảm nhiều hơn. Các hoạt động như du lịch hoặc sáng tạo nghệ thuật có thể tăng sự gắn kết. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 90,
      "details": {
        "overview": "9/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 1 (Nhà lãnh đạo) là sự kết hợp lý tưởng giữa sự dịu dàng và sức mạnh. Số 2 mang lại sự chu đáo, tình cảm và khả năng duy trì hòa khí, trong khi số 1 cung cấp sự ổn định, định hướng và khả năng lãnh đạo. Sự tương phản này tạo nên một gia đình hài hòa, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế. Mối quan hệ này thường rất bền vững.",
        "strengths": "Số 2 cung cấp sự ấm áp và chăm sóc gia đình, trong khi số 1 mang lại tầm nhìn và sự bảo vệ. Họ bổ sung cho nhau, với số 2 hỗ trợ số 1 đạt mục tiêu và số 1 giúp số 2 tự tin hơn. Khả năng thấu hiểu lẫn nhau là điểm mạnh lớn, tạo nên một gia đình hạnh phúc và ổn định.",
        "weaknesses": "Số 2 có thể cảm thấy bị lu mờ bởi tham vọng của số 1, trong khi số 1 có thể thấy số 2 quá phụ thuộc hoặc nhạy cảm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (cảm xúc vs. sự nghiệp) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành mẫu mực nếu cả hai cùng nỗ lực. Sự kết hợp giữa chăm sóc và lãnh đạo tạo ra một gia đình phong phú và thành công. Việc cùng nhau xây dựng mục tiêu chung và chia sẻ trách nhiệm sẽ giúp họ gắn kết hơn, tạo nên một cuộc sống ý nghĩa.",
        "challenges": "Thách thức chính là cân bằng giữa nhu cầu cảm xúc của số 2 và tham vọng của số 1. Số 2 cần học cách độc lập hơn, còn số 1 cần quan tâm hơn đến cảm xúc của số 2. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn. Những bất đồng nhỏ có thể leo thang nếu không giao tiếp rõ ràng.",
        "suggestions": "Cả hai nên tổ chức các buổi tối gia đình hoặc cùng lập kế hoạch tương lai để tăng sự gắn kết. Số 2 cần bày tỏ nhu cầu trực tiếp, còn số 1 nên thể hiện tình cảm nhiều hơn. Tôn trọng không gian cá nhân và duy trì giao tiếp cởi mở. Các hoạt động như học kỹ năng mới cùng nhau có thể giúp tăng sự thấu hiểu."
      }
    },
    {
      "partnerNumber": 1,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 1 (Nhà lãnh đạo) có thể hiệu quả nếu tận dụng thế mạnh của nhau. Số 2 mang lại sự tinh tế, kỹ năng ngoại giao và khả năng xây dựng mối quan hệ, trong khi số 1 cung cấp tầm nhìn chiến lược, sự quyết đoán và khả năng dẫn dắt. Sự kết hợp này tạo nên một đội nhóm cân bằng, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng mạng lưới quan hệ và giải quyết xung đột, trong khi số 1 dẫn dắt dự án với tầm nhìn lớn. Họ bổ sung cho nhau, với số 2 mang lại sự ổn định và số 1 mang lại động lực. Khả năng học hỏi lẫn nhau giúp số 2 quyết đoán hơn và số 1 lắng nghe tốt hơn.",
        "weaknesses": "Số 2 có thể cảm thấy bị áp đảo bởi phong cách mạnh mẽ của số 1, trong khi số 1 có thể thấy số 2 thiếu quyết đoán hoặc chậm chạp. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong tốc độ làm việc có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng tạo ra kết quả ấn tượng nếu cả hai phối hợp tốt. Sự kết hợp giữa ngoại giao và chiến lược có thể dẫn đến thành công trong kinh doanh hoặc dự án sáng tạo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 chậm rãi và cẩn thận, số 1 nhanh và quyết đoán. Số 2 cần tự tin đóng góp ý kiến, còn số 1 cần tránh kiểm soát quá mức. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng, với số 2 xử lý quan hệ đối ngoại và số 1 tập trung vào chiến lược. Số 2 nên chủ động bày tỏ quan điểm, còn số 1 cần lắng nghe ý kiến của số 2. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ để đảm bảo đồng thuận."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 90,
      "details": {
        "overview": "9/10\nMối quan hệ giữa hai số 2 (Nhà ngoại giao) là sự kết hợp lý tưởng của sự thấu hiểu và cảm xúc sâu sắc. Cả hai đều nhạy cảm, hòa nhã và giỏi xây dựng mối quan hệ, tạo nên một tình yêu đầy yêu thương và hỗ trợ. Sự tương đồng này mang lại sự thoải mái, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Cả hai đều có khả năng lắng nghe và thấu hiểu, tạo ra một mối quan hệ an toàn và gắn bó. Họ hỗ trợ lẫn nhau về mặt cảm xúc, với mỗi người mang lại sự quan tâm và chăm sóc. Sự tương đồng trong cách tiếp cận giúp họ dễ dàng đồng cảm và xây dựng một tình yêu bền vững.",
        "weaknesses": "Cả hai có thể quá nhạy cảm hoặc phụ thuộc, dẫn đến việc né tránh xung đột thay vì giải quyết. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự thiếu quyết đoán của cả hai có thể gây ra trì trệ trong các quyết định quan trọng.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu mẫu mực nếu cả hai học cách đối mặt với vấn đề. Sự kết hợp của hai nhà ngoại giao tạo ra một mối quan hệ hài hòa, nơi cả hai cùng trưởng thành. Việc cùng nhau chia sẻ cảm xúc và mục tiêu sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức lớn nhất là sự thiếu quyết đoán và xu hướng né tránh xung đột. Cả hai cần học cách đối mặt với vấn đề thay vì che giấu cảm xúc. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn. Những bất đồng nhỏ có thể tích tụ nếu không giao tiếp rõ ràng.",
        "suggestions": "Cả hai nên dành thời gian trò chuyện cởi mở để giải quyết bất đồng. Tham gia các hoạt động như viết nhật ký chung hoặc thiền có thể tăng sự gắn kết. Cả hai cần học cách đưa ra quyết định cùng nhau và khuyến khích sự độc lập. Duy trì giao tiếp chân thành là chìa khóa."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nHôn nhân giữa hai số 2 (Nhà ngoại giao) là sự kết hợp của sự chăm sóc và thấu hiểu, tạo nên một gia đình ấm áp và hòa hợp. Cả hai đều nhạy cảm, biết lắng nghe và ưu tiên cảm xúc, giúp họ xây dựng một mái ấm đầy yêu thương. Sự tương đồng này rất bền vững, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Cả hai đều giỏi chăm sóc và hỗ trợ lẫn nhau, tạo ra một gia đình an toàn và hạnh phúc. Họ có khả năng thấu hiểu sâu sắc, với mỗi người mang lại sự quan tâm và hòa khí. Sự tương đồng trong cách tiếp cận giúp họ dễ dàng phối hợp trong các trách nhiệm gia đình.",
        "weaknesses": "Cả hai có thể thiếu quyết đoán hoặc né tránh xung đột, dẫn đến việc trì hoãn giải quyết vấn đề. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự phụ thuộc lẫn nhau có thể khiến họ khó đưa ra quyết định lớn nếu không có sự hỗ trợ bên ngoài.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ mẫu mực nếu cả hai học cách đối mặt với vấn đề. Sự kết hợp của hai nhà ngoại giao tạo ra một gia đình đầy yêu thương và ý nghĩa. Việc cùng nhau xây dựng mục tiêu chung và chia sẻ trách nhiệm sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự thiếu quyết đoán và xu hướng che giấu cảm xúc. Cả hai cần học cách thẳng thắn đối mặt với vấn đề. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn. Những bất đồng nhỏ có thể tích tụ nếu không giao tiếp rõ ràng.",
        "suggestions": "Cả hai nên tổ chức các buổi trò chuyện định kỳ để giải quyết bất đồng và phân chia trách nhiệm. Tham gia các hoạt động như làm việc nhà chung hoặc từ thiện có thể tăng sự gắn kết. Cả hai cần khuyến khích sự độc lập và học cách đưa ra quyết định cùng nhau."
      }
    },
    {
      "partnerNumber": 2,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nSự hợp tác giữa hai số 2 (Nhà ngoại giao) có thể hiệu quả trong việc xây dựng mối quan hệ và hòa giải, nhưng có thể gặp khó khăn trong việc đưa ra quyết định. Cả hai đều giỏi lắng nghe, tinh tế và có khả năng làm việc nhóm, tạo nên một đội nhóm hài hòa. Tuy nhiên, thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Cả hai đều có khả năng xây dựng mạng lưới quan hệ và giải quyết xung đột, giúp họ phối hợp tốt trong các dự án cần sự hợp tác. Sự thấu hiểu lẫn nhau tạo ra một môi trường làm việc thoải mái. Họ có thể hỗ trợ nhau về mặt cảm xúc, tạo nền tảng cho một đội nhóm bền vững.",
        "weaknesses": "Cả hai có thể thiếu quyết đoán, dẫn đến trì hoãn trong các quyết định quan trọng. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự phụ thuộc lẫn nhau có thể khiến họ khó đưa ra hướng đi rõ ràng nếu không có sự dẫn dắt từ bên ngoài.",
        "potential": "Sự hợp tác này có tiềm năng tạo ra kết quả tốt trong các dự án cần sự hợp tác và ngoại giao. Sự kết hợp của hai nhà ngoại giao có thể dẫn đến những mối quan hệ kinh doanh bền vững. Việc phân chia vai trò rõ ràng và tìm kiếm sự hỗ trợ từ bên ngoài sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự thiếu quyết đoán và xu hướng né tránh xung đột. Cả hai cần học cách đưa ra quyết định nhanh chóng và đối mặt với vấn đề. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng. Những mâu thuẫn nhỏ có thể tích tụ nếu không có sự phối hợp tốt.",
        "suggestions": "Cả hai nên phân chia vai trò rõ ràng và tìm kiếm sự hỗ trợ từ một người dẫn dắt mạnh mẽ. Tham gia các buổi họp định kỳ để giải quyết bất đồng và duy trì đồng thuận. Cả hai cần học cách đưa ra quyết định độc lập hơn và duy trì giao tiếp cởi mở."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 3 (Nhà sáng tạo) mang đến sự kết hợp giữa sự nhạy cảm và năng lượng vui tươi. Số 2 mang lại sự thấu hiểu và hỗ trợ, trong khi số 3 cung cấp sự sáng tạo, lạc quan và yêu đời. Sự tương tác này tạo ra một tình yêu sôi động, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 2 hỗ trợ số 3 bằng sự quan tâm và khả năng lắng nghe, trong khi số 3 mang lại niềm vui và sự sáng tạo cho số 2. Họ bổ sung cho nhau, với số 2 giúp số 3 tập trung hơn và số 3 giúp số 2 thư giãn. Khả năng tạo ra những khoảnh khắc đáng nhớ là điểm mạnh lớn.",
        "weaknesses": "Số 2 có thể cảm thấy số 3 quá bốc đồng hoặc thiếu nghiêm túc, trong khi số 3 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (cảm xúc vs. niềm vui) có thể gây hiểu lầm nếu không được giải quyết.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách chấp nhận sự khác biệt. Sự kết hợp giữa hỗ trợ và sáng tạo có thể tạo ra một tình yêu phong phú, nơi cả hai cùng khám phá điều mới mẻ. Việc cùng nhau tham gia các hoạt động sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 3 ưu tiên trải nghiệm. Số 2 cần tránh phụ thuộc quá mức, còn số 3 cần tôn trọng cảm xúc của số 2. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động sáng tạo như vẽ tranh hoặc du lịch để tăng sự gắn kết. Số 2 nên bày tỏ cảm xúc rõ ràng, còn số 3 cần học cách nghiêm túc hơn trong các vấn đề quan trọng. Duy trì giao tiếp cởi mở và tạo không gian cho cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 3 (Nhà sáng tạo) là sự kết hợp giữa sự chăm sóc và năng lượng sáng tạo, tạo nên một gia đình sôi động nhưng cần sự cân bằng. Số 2 mang lại sự chu đáo và thấu hiểu, trong khi số 3 cung cấp sự lạc quan và khả năng giao tiếp. Sự tương phản này có thể tạo ra một gia đình phong phú, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 cung cấp sự ấm áp và hỗ trợ, trong khi số 3 mang lại không khí vui vẻ và sáng tạo. Họ bổ sung cho nhau, với số 2 giúp số 3 ổn định hơn và số 3 làm dịu sự nhạy cảm của số 2. Khả năng truyền cảm hứng lẫn nhau tạo nên một gia đình đầy tiếng cười.",
        "weaknesses": "Số 2 có thể cảm thấy số 3 thiếu trách nhiệm, trong khi số 3 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. niềm vui) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ phong phú nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa chăm sóc và sáng tạo có thể tạo ra một cuộc sống gia đình đầy màu sắc. Việc cùng nhau tham gia các hoạt động sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận trách nhiệm: số 2 tập trung vào cảm xúc, số 3 tập trung vào hiện tại. Số 2 cần tránh phụ thuộc, còn số 3 cần chia sẻ trách nhiệm gia đình. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình sáng tạo như trang trí nhà cửa hoặc đi du lịch. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 3 nên nỗ lực chia sẻ trách nhiệm. Duy trì giao tiếp cởi mở và tạo không gian cho cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 3,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 3 (Nhà sáng tạo) có thể tạo ra kết quả ấn tượng nhờ sự kết hợp giữa ngoại giao và sáng tạo. Số 2 mang lại sự tinh tế và kỹ năng xây dựng mối quan hệ, trong khi số 3 cung cấp ý tưởng mới mẻ và năng lượng lạc quan. Sự tương tác này tạo nên một đội nhóm năng động, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng quan hệ và giải quyết xung đột, trong khi số 3 mang lại sự sáng tạo và khả năng thu hút sự chú ý. Họ bổ sung cho nhau, với số 2 giúp số 3 tập trung hơn và số 3 mang lại năng lượng cho số 2. Khả năng phối hợp tạo ra những dự án độc đáo.",
        "weaknesses": "Số 2 có thể thấy số 3 thiếu kỷ luật, trong khi số 3 có thể cảm thấy số 2 quá cẩn thận. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (cẩn thận vs. tự do) có thể gây căng thẳng nếu không được giải quyết.",
        "potential": "Sự hợp tác này có tiềm năng tạo ra thành công trong các lĩnh vực sáng tạo hoặc giao tiếp. Sự kết hợp giữa ngoại giao và ý tưởng mới có thể dẫn đến những dự án thu hút. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 chậm rãi, số 3 bốc đồng. Số 2 cần tự tin đóng góp ý kiến, còn số 3 cần tôn trọng kế hoạch. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 2 tập trung vào quan hệ đối ngoại và số 3 tập trung vào sáng tạo. Số 2 nên chủ động bày tỏ quan điểm, còn số 3 cần tuân thủ kế hoạch. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp sáng tạo để đảm bảo đồng thuận."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 60,
      "details": {
        "overview": "6/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 4 (Nhà xây dựng) có thể ổn định nhưng thiếu sự lãng mạn do sự khác biệt trong cách tiếp cận. Số 2 mang lại sự nhạy cảm và thấu hiểu, trong khi số 4 cung cấp sự thực tế và ổn định. Sự tương phản này có thể tạo ra sự hỗ trợ lẫn nhau, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 2 mang lại sự quan tâm và hòa khí, trong khi số 4 cung cấp sự đáng tin cậy và nền tảng vững chắc. Họ có thể bổ sung cho nhau, với số 2 làm dịu sự cứng nhắc của số 4 và số 4 giúp số 2 ổn định hơn. Khả năng xây dựng một mối quan hệ an toàn là điểm mạnh.",
        "weaknesses": "Số 2 có thể thấy số 4 quá cứng nhắc hoặc thiếu tình cảm, trong khi số 4 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (cảm xúc vs. thực tế) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa hỗ trợ và thực tế có thể tạo ra một tình yêu bền vững. Việc cùng nhau tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 4 ưu tiên ổn định. Số 2 cần tránh phụ thuộc, còn số 4 cần thể hiện tình cảm nhiều hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động thực tế như lập kế hoạch tài chính hoặc làm việc nhà chung. Số 2 nên bày tỏ nhu cầu rõ ràng, còn số 4 cần học cách thể hiện tình cảm. Duy trì giao tiếp cởi mở và tạo không gian cho cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 4 (Nhà xây dựng) là sự kết hợp giữa sự chăm sóc và thực tế, tạo nên một gia đình ổn định nhưng có thể thiếu niềm vui. Số 2 mang lại sự chu đáo và hòa khí, trong khi số 4 cung cấp sự đáng tin cậy và khả năng xây dựng nền tảng. Sự tương phản này có thể bền vững, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 cung cấp sự ấm áp và hỗ trợ, trong khi số 4 mang lại sự ổn định và tổ chức. Họ bổ sung cho nhau, với số 2 làm dịu sự nghiêm túc của số 4 và số 4 giúp số 2 có cấu trúc hơn. Khả năng xây dựng một gia đình an toàn là điểm mạnh lớn.",
        "weaknesses": "Số 2 có thể cảm thấy số 4 quá cứng nhắc, trong khi số 4 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (cảm xúc vs. trách nhiệm) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ ổn định nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa chăm sóc và thực tế có thể tạo ra một cuộc sống gia đình vững chắc. Việc cùng nhau tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 tập trung vào cảm xúc, số 4 tập trung vào trách nhiệm. Số 2 cần học cách độc lập hơn, còn số 4 cần thể hiện tình cảm nhiều hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình thực tế như quản lý tài chính hoặc xây dựng dự án chung. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 4 nên nỗ lực thể hiện tình cảm. Duy trì giao tiếp cởi mở và tạo không gian cho cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 4,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 4 (Nhà xây dựng) có thể hiệu quả trong các dự án cần sự ổn định và hợp tác. Số 2 mang lại sự tinh tế và kỹ năng xây dựng mối quan hệ, trong khi số 4 cung cấp sự thực tế và kỷ luật. Sự kết hợp này tạo nên một đội nhóm cân bằng, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng quan hệ và giải quyết xung đột, trong khi số 4 đảm bảo mọi thứ được thực hiện đúng kế hoạch. Họ bổ sung cho nhau, với số 2 mang lại sự linh hoạt và số 4 mang lại cấu trúc. Khả năng phối hợp tạo ra những dự án vững chắc.",
        "weaknesses": "Số 2 có thể thấy số 4 quá cứng nhắc, trong khi số 4 có thể cảm thấy số 2 thiếu kỷ luật. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (linh hoạt vs. kỷ luật) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng tạo ra kết quả tốt trong các dự án dài hạn. Sự kết hợp giữa ngoại giao và thực tế có thể dẫn đến thành công trong kinh doanh hoặc tổ chức. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 linh hoạt, số 4 kỷ luật. Số 2 cần tự tin đóng góp ý kiến, còn số 4 cần cởi mở hơn với sự đổi mới. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 2 tập trung vào quan hệ đối ngoại và số 4 tập trung vào thực hiện. Số 2 nên chủ động bày tỏ quan điểm, còn số 4 cần chấp nhận sự linh hoạt. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ để đảm bảo đồng thuận."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 5 (Nhà phiêu lưu) có thể gặp thử thách do sự khác biệt trong cách tiếp cận cuộc sống. Số 2 mang lại sự nhạy cảm và thấu hiểu, trong khi số 5 cung cấp sự tự do và tinh thần phiêu lưu. Sự tương phản này có thể hấp dẫn ban đầu, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 2 mang lại sự quan tâm và hỗ trợ, trong khi số 5 mang lại năng lượng và sự mới mẻ. Họ có thể bổ sung cho nhau, với số 2 giúp số 5 ổn định hơn và số 5 giúp số 2 khám phá điều mới. Khả năng tạo ra những trải nghiệm thú vị là điểm mạnh.",
        "weaknesses": "Số 2 có thể cảm thấy số 5 quá bốc đồng hoặc thiếu cam kết, trong khi số 5 có thể thấy số 2 quá phụ thuộc hoặc nhạy cảm. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (cảm xúc vs. tự do) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách cân bằng. Sự kết hợp giữa hỗ trợ và phiêu lưu có thể tạo ra một tình yêu năng động. Việc cùng nhau tham gia các hoạt động mới mẻ sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 5 ưu tiên tự do. Số 2 cần tránh phụ thuộc, còn số 5 cần cam kết hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động phiêu lưu như du lịch hoặc thử thách mới. Số 2 nên bày tỏ nhu cầu rõ ràng, còn số 5 cần học cách cam kết. Duy trì giao tiếp cởi mở và tạo không gian cho cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 50,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 5 (Nhà phiêu lưu) có thể gặp nhiều thử thách do sự khác biệt trong ưu tiên. Số 2 mang lại sự chu đáo và thấu hiểu, trong khi số 5 cung cấp sự linh hoạt và tinh thần khám phá. Sự tương phản này có thể gây khó khăn cho sự ổn định gia đình, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 cung cấp sự ấm áp và hỗ trợ, trong khi số 5 mang lại năng lượng và sự mới mẻ. Họ có thể bổ sung cho nhau, với số 2 giúp số 5 ổn định hơn và số 5 mang lại sự thú vị cho số 2. Khả năng tạo ra những trải nghiệm mới là điểm mạnh.",
        "weaknesses": "Số 2 có thể cảm thấy số 5 thiếu trách nhiệm hoặc cam kết, trong khi số 5 có thể thấy số 2 quá phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. tự do) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách cân bằng tự do và trách nhiệm. Sự kết hợp giữa chăm sóc và phiêu lưu có thể tạo ra một cuộc sống gia đình năng động. Việc cùng nhau tham gia các hoạt động mới sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự thiếu cam kết của số 5 và sự phụ thuộc của số 2. Số 2 cần học cách độc lập, còn số 5 cần chia sẻ trách nhiệm gia đình. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình năng động như du lịch hoặc thử thách mới. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 5 nên nỗ lực cam kết hơn. Duy trì giao tiếp cởi mở và tạo không gian cho cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 5,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 5 (Nhà phiêu lưu) có thể tạo ra những ý tưởng mới nhưng cần sự cân bằng. Số 2 mang lại sự tinh tế và kỹ năng xây dựng mối quan hệ, trong khi số 5 cung cấp sự linh hoạt và tinh thần đổi mới. Sự tương phản này có thể hiệu quả, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng quan hệ và giải quyết xung đột, trong khi số 5 mang lại ý tưởng mới và khả năng thích nghi. Họ bổ sung cho nhau, với số 2 mang lại sự ổn định và số 5 mang lại năng lượng. Khả năng phối hợp tạo ra những dự án sáng tạo.",
        "weaknesses": "Số 2 có thể thấy số 5 quá bốc đồng, trong khi số 5 có thể cảm thấy số 2 thiếu linh hoạt. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (cẩn thận vs. tự do) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án sáng tạo hoặc thay đổi nhanh. Sự kết hợp giữa ngoại giao và đổi mới có thể dẫn đến thành công. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 chậm rãi, số 5 bốc đồng. Số 2 cần tự tin đóng góp ý kiến, còn số 5 cần tôn trọng kế hoạch. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 2 tập trung vào quan hệ đối ngoại và số 5 tập trung vào đổi mới. Số 2 nên chủ động bày tỏ quan điểm, còn số 5 cần tuân thủ kế hoạch. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp sáng tạo."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 90,
      "details": {
        "overview": "9/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 6 (Nhà chăm sóc) là sự kết hợp lý tưởng của sự thấu hiểu và yêu thương. Cả hai đều nhạy cảm, chu đáo và ưu tiên cảm xúc, tạo nên một tình yêu sâu sắc và bền vững. Sự tương đồng này mang lại sự an toàn, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Cả hai đều giỏi chăm sóc và hỗ trợ lẫn nhau, tạo ra một mối quan hệ đầy yêu thương. Số 2 mang lại sự hòa giải, trong khi số 6 mang lại trách nhiệm và sự chu đáo. Khả năng thấu hiểu sâu sắc giúp họ xây dựng một tình yêu gắn bó và ý nghĩa.",
        "weaknesses": "Cả hai có thể quá nhạy cảm hoặc phụ thuộc, dẫn đến việc né tránh xung đột. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự thiếu quyết đoán của số 2 có thể xung đột với tính kiểm soát của số 6.",
        "potential": "Mối quan hệ này có tiềm năng trở thành một tình yêu mẫu mực nếu cả hai học cách đối mặt với vấn đề. Sự kết hợp giữa hỗ trợ và chăm sóc tạo ra một mối quan hệ hài hòa. Việc cùng nhau tham gia các hoạt động ý nghĩa sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là xu hướng né tránh xung đột và sự phụ thuộc lẫn nhau. Số 2 cần tự tin bày tỏ nhu cầu, còn số 6 cần tránh kiểm soát quá mức. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như từ thiện hoặc chăm sóc lẫn nhau. Số 2 nên thẳng thắn chia sẻ cảm xúc, còn số 6 cần học cách tôn trọng không gian cá nhân. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 6 (Nhà chăm sóc) là sự kết hợp của sự yêu thương và trách nhiệm, tạo nên một gia đình ấm áp và bền vững. Số 2 mang lại sự thấu hiểu và hòa khí, trong khi số 6 cung cấp sự chu đáo và khả năng xây dựng mái ấm. Sự tương đồng này rất hài hòa, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Cả hai đều giỏi chăm sóc và hỗ trợ, tạo ra một gia đình đầy yêu thương. Số 2 mang lại sự tinh tế, trong khi số 6 mang lại trách nhiệm và sự ổn định. Khả năng thấu hiểu sâu sắc giúp họ phối hợp tốt trong các trách nhiệm gia đình.",
        "weaknesses": "Cả hai có thể quá nhạy cảm hoặc phụ thuộc, dẫn đến việc né tránh xung đột. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự kiểm soát của số 6 có thể khiến số 2 cảm thấy bị hạn chế.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ mẫu mực nếu cả hai học cách đối mặt với vấn đề. Sự kết hợp giữa chăm sóc và hỗ trợ tạo ra một gia đình hạnh phúc. Việc cùng nhau tham gia các hoạt động ý nghĩa sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là xu hướng né tránh xung đột và sự phụ thuộc lẫn nhau. Số 2 cần tự tin bày tỏ nhu cầu, còn số 6 cần tránh kiểm soát. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như từ thiện hoặc làm việc nhà chung. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 6 nên tôn trọng không gian cá nhân. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 6,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 80,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 6 (Nhà chăm sóc) có thể rất hiệu quả trong các dự án cần sự hợp tác và trách nhiệm. Số 2 mang lại sự tinh tế và kỹ năng xây dựng mối quan hệ, trong khi số 6 cung cấp sự chu đáo và khả năng quản lý. Sự tương đồng này tạo nên một đội nhóm hài hòa, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng quan hệ và giải quyết xung đột, trong khi số 6 mang lại trách nhiệm và sự ổn định. Họ bổ sung cho nhau, với số 2 mang lại sự linh hoạt và số 6 mang lại cấu trúc. Khả năng phối hợp tạo ra những dự án bền vững.",
        "weaknesses": "Cả hai có thể thiếu quyết đoán hoặc quá tập trung vào con người, dẫn đến trì hoãn trong các quyết định lớn. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự kiểm soát của số 6 có thể khiến số 2 cảm thấy bị hạn chế.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án cộng đồng hoặc chăm sóc. Sự kết hợp giữa ngoại giao và trách nhiệm có thể dẫn đến thành công. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự thiếu quyết đoán và xu hướng né tránh xung đột. Số 2 cần tự tin đóng góp ý kiến, còn số 6 cần tránh kiểm soát. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 2 tập trung vào quan hệ đối ngoại và số 6 tập trung vào quản lý. Số 2 nên chủ động bày tỏ quan điểm, còn số 6 cần tôn trọng ý kiến của số 2. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 7 (Nhà hiền triết) có thể gặp thử thách do sự khác biệt trong cách tiếp cận. Số 2 mang lại sự nhạy cảm và thấu hiểu, trong khi số 7 nội tâm, sâu sắc và ưu tiên sự khám phá tinh thần. Sự tương phản này có thể hấp dẫn ban đầu, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 2 mang lại sự quan tâm và hỗ trợ, trong khi số 7 cung cấp sự sâu sắc và tư duy triết học. Họ có thể học hỏi lẫn nhau, với số 2 giúp số 7 cởi mở hơn và số 7 giúp số 2 suy ngẫm sâu hơn. Khả năng tạo ra một mối quan hệ độc đáo là điểm mạnh.",
        "weaknesses": "Số 2 có thể cảm thấy số 7 quá xa cách, trong khi số 7 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (cảm xúc vs. tinh thần) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa hỗ trợ và hiền triết có thể tạo ra một tình yêu sâu sắc. Việc cùng nhau tham gia các hoạt động tinh thần sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 7 ưu tiên suy ngẫm. Số 2 cần tránh phụ thuộc, còn số 7 cần cởi mở hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động tinh thần như thiền hoặc đọc sách cùng nhau. Số 2 nên bày tỏ nhu cầu rõ ràng, còn số 7 cần học cách cởi mở hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 50,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 7 (Nhà hiền triết) có thể gặp nhiều thử thách do sự khác biệt trong ưu tiên. Số 2 mang lại sự chu đáo và thấu hiểu, trong khi số 7 nội tâm và tập trung vào sự khám phá tinh thần. Sự tương phản này có thể tạo ra một gia đình độc đáo, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 cung cấp sự ấm áp và hỗ trợ, trong khi số 7 mang lại sự sâu sắc và tư duy triết học. Họ có thể bổ sung cho nhau, với số 2 giúp số 7 cởi mở hơn và số 7 giúp số 2 suy ngẫm sâu hơn. Khả năng tạo ra một gia đình độc đáo là điểm mạnh.",
        "weaknesses": "Số 2 có thể cảm thấy số 7 quá xa cách, trong khi số 7 có thể thấy số 2 quá phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. tinh thần) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa chăm sóc và hiền triết có thể tạo ra một cuộc sống gia đình phong phú. Việc cùng nhau tham gia các hoạt động tinh thần sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách sống: số 2 hướng tới cảm xúc, số 7 hướng tới suy ngẫm. Số 2 cần học cách độc lập, còn số 7 cần cởi mở hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động tinh thần như thiền hoặc đọc sách cùng nhau. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 7 nên nỗ lực cởi mở hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 7,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 7 (Nhà hiền triết) có thể hiệu quả trong các dự án cần sự sâu sắc và ngoại giao. Số 2 mang lại sự tinh tế và kỹ năng xây dựng mối quan hệ, trong khi số 7 cung cấp sự phân tích và tư duy triết học. Sự tương phản này có thể tạo ra một đội nhóm độc đáo, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng quan hệ và giải quyết xung đột, trong khi số 7 mang lại sự sâu sắc và khả năng phân tích. Họ bổ sung cho nhau, với số 2 mang lại sự linh hoạt và số 7 mang lại chiều sâu. Khả năng phối hợp tạo ra những dự án có ý nghĩa.",
        "weaknesses": "Số 2 có thể thấy số 7 quá xa cách, trong khi số 7 có thể cảm thấy số 2 thiếu chiều sâu. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (con người vs. suy ngẫm) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án đòi hỏi tư duy sâu sắc. Sự kết hợp giữa ngoại giao và triết học có thể dẫn đến những dự án độc đáo. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 hướng tới con người, số 7 hướng tới suy ngẫm. Số 2 cần tự tin đóng góp ý kiến, còn số 7 cần cởi mở hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 2 tập trung vào quan hệ đối ngoại và số 7 tập trung vào phân tích. Số 2 nên chủ động bày tỏ quan điểm, còn số 7 cần hành động nhanh hơn. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp để đảm bảo đồng thuận."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 8 (Nhà quyền lực) là sự kết hợp giữa sự nhạy cảm và tham vọng. Số 2 mang lại sự thấu hiểu và hỗ trợ, trong khi số 8 cung cấp sự thực tế, quyết đoán và khát vọng thành công. Sự tương phản này tạo ra một tình yêu cân bằng và hấp dẫn, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 2 hỗ trợ số 8 bằng sự quan tâm và khả năng hòa giải, trong khi số 8 mang lại sự ổn định và động lực cho số 2. Họ bổ sung cho nhau, với số 2 làm dịu sự cứng nhắc của số 8 và số 8 giúp số 2 tự tin hơn. Khả năng thấu hiểu tạo nên một mối quan hệ mạnh mẽ.",
        "weaknesses": "Số 2 có thể cảm thấy số 8 quá thực dụng hoặc kiểm soát, trong khi số 8 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (cảm xúc vs. thành công) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa hỗ trợ và quyền lực có thể tạo ra một tình yêu bền vững. Việc cùng nhau tham gia các hoạt động thực tế hoặc lập kế hoạch sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 8 ưu tiên thành công. Số 2 cần tự tin bày tỏ nhu cầu, còn số 8 cần thể hiện tình cảm nhiều hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như lập kế hoạch tài chính hoặc du lịch để tăng sự gắn kết. Số 2 nên bày tỏ nhu cầu rõ ràng, còn số 8 cần học cách thể hiện tình cảm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 8 (Nhà quyền lực) là sự kết hợp giữa sự chăm sóc và tham vọng, tạo nên một gia đình ổn định nhưng cần sự cân bằng. Số 2 mang lại sự chu đáo và thấu hiểu, trong khi số 8 cung cấp sự thực tế và khả năng lãnh đạo. Sự tương phản này có thể bền vững, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 cung cấp sự ấm áp và hỗ trợ, trong khi số 8 mang lại sự ổn định và tầm nhìn lớn. Họ bổ sung cho nhau, với số 2 làm dịu sự nghiêm túc của số 8 và số 8 giúp số 2 tự tin hơn. Khả năng phối hợp tạo nên một gia đình thành công.",
        "weaknesses": "Số 2 có thể cảm thấy số 8 quá kiểm soát, trong khi số 8 có thể thấy số 2 quá phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. thành công) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ mạnh mẽ nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa chăm sóc và quyền lực có thể tạo ra một cuộc sống gia đình thành công. Việc cùng nhau xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 tập trung vào cảm xúc, số 8 tập trung vào thành công. Số 2 cần học cách độc lập, còn số 8 cần thể hiện tình cảm nhiều hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như lập kế hoạch tài chính hoặc xây dựng dự án chung. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 8 nên nỗ lực thể hiện tình cảm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },{
      "partnerNumber": 8,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 8 (Nhà quyền lực) là sự kết hợp giữa sự nhạy cảm và tham vọng. Số 2 mang lại sự thấu hiểu và hỗ trợ, trong khi số 8 cung cấp sự thực tế, quyết đoán và khát vọng thành công. Sự tương phản này tạo ra một tình yêu cân bằng và hấp dẫn, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 2 hỗ trợ số 8 bằng sự quan tâm và khả năng hòa giải, trong khi số 8 mang lại sự ổn định và động lực cho số 2. Họ bổ sung cho nhau, với số 2 làm dịu sự cứng nhắc của số 8 và số 8 giúp số 2 tự tin hơn. Khả năng thấu hiểu tạo nên một mối quan hệ mạnh mẽ.",
        "weaknesses": "Số 2 có thể cảm thấy số 8 quá thực dụng hoặc kiểm soát, trong khi số 8 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (cảm xúc vs. thành công) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa hỗ trợ và quyền lực có thể tạo ra một tình yêu bền vững. Việc cùng nhau tham gia các hoạt động thực tế hoặc lập kế hoạch sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 8 ưu tiên thành công. Số 2 cần tự tin bày tỏ nhu cầu, còn số 8 cần thể hiện tình cảm nhiều hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như lập kế hoạch tài chính hoặc du lịch để tăng sự gắn kết. Số 2 nên bày tỏ nhu cầu rõ ràng, còn số 8 cần học cách thể hiện tình cảm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 8 (Nhà quyền lực) là sự kết hợp giữa sự chăm sóc và tham vọng, tạo nên một gia đình ổn định nhưng cần sự cân bằng. Số 2 mang lại sự chu đáo và thấu hiểu, trong khi số 8 cung cấp sự thực tế và khả năng lãnh đạo. Sự tương phản này có thể bền vững, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 cung cấp sự ấm áp và hỗ trợ, trong khi số 8 mang lại sự ổn định và tầm nhìn lớn. Họ bổ sung cho nhau, với số 2 làm dịu sự nghiêm túc của số 8 và số 8 giúp số 2 tự tin hơn. Khả năng phối hợp tạo nên một gia đình thành công.",
        "weaknesses": "Số 2 có thể cảm thấy số 8 quá kiểm soát, trong khi số 8 có thể thấy số 2 quá phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. thành công) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ mạnh mẽ nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa chăm sóc và quyền lực có thể tạo ra một cuộc sống gia đình thành công. Việc cùng nhau xây dựng mục tiêu chung sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 tập trung vào cảm xúc, số 8 tập trung vào thành công. Số 2 cần học cách độc lập, còn số 8 cần thể hiện tình cảm nhiều hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như lập kế hoạch tài chính hoặc xây dựng dự án chung. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 8 nên nỗ lực thể hiện tình cảm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 8,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Cao",
      "percentage": 85,
      "details": {
        "overview": "8/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 8 (Nhà quyền lực) có thể tạo ra kết quả ấn tượng nhờ sự kết hợp giữa ngoại giao và thực tế. Số 2 mang lại sự tinh tế và kỹ năng xây dựng mối quan hệ, trong khi số 8 cung cấp sự quyết đoán và khả năng quản lý. Sự tương phản này tạo nên một đội nhóm mạnh mẽ, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng quan hệ và giải quyết xung đột, trong khi số 8 dẫn dắt dự án với tầm nhìn lớn. Họ bổ sung cho nhau, với số 2 mang lại sự linh hoạt và số 8 mang lại cấu trúc. Khả năng phối hợp tạo ra những dự án thành công.",
        "weaknesses": "Số 2 có thể cảm thấy số 8 quá kiểm soát, trong khi số 8 có thể thấy số 2 thiếu quyết đoán. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (linh hoạt vs. kỷ luật) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án kinh doanh hoặc quản lý. Sự kết hợp giữa ngoại giao và quyền lực có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 chậm rãi, số 8 quyết đoán. Số 2 cần tự tin đóng góp ý kiến, còn số 8 cần lắng nghe nhiều hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 2 tập trung vào quan hệ đối ngoại và số 8 tập trung vào quản lý. Số 2 nên chủ động bày tỏ quan điểm, còn số 8 cần tôn trọng ý kiến của số 2. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ để đảm bảo đồng thuận."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 75,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 9 (Nhà nhân đạo) mang lại sự kết hợp giữa sự nhạy cảm và lý tưởng cao cả. Số 2 mang lại sự thấu hiểu và hỗ trợ, trong khi số 9 cung cấp sự đam mê, lòng trắc ẩn và khát vọng thay đổi thế giới. Sự tương đồng về cảm xúc tạo ra một tình yêu sâu sắc, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Cả hai đều nhạy cảm và quan tâm đến người khác, tạo ra một mối quan hệ đầy yêu thương. Số 2 hỗ trợ số 9 bằng sự lắng nghe, trong khi số 9 truyền cảm hứng cho số 2 với những lý tưởng lớn. Khả năng đồng cảm giúp họ xây dựng một tình yêu ý nghĩa.",
        "weaknesses": "Số 2 có thể cảm thấy số 9 quá lý tưởng hoặc xa cách, trong khi số 9 có thể thấy số 2 quá phụ thuộc hoặc thiếu tham vọng. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (cảm xúc cá nhân vs. lý tưởng chung) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách cân bằng cảm xúc và lý tưởng. Sự kết hợp giữa hỗ trợ và nhân đạo có thể tạo ra một tình yêu phong phú. Việc cùng nhau tham gia các hoạt động từ thiện sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 tập trung vào cảm xúc cá nhân, số 9 tập trung vào lý tưởng lớn. Số 2 cần tự tin bày tỏ nhu cầu, còn số 9 cần chú ý hơn đến cảm xúc của số 2. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động từ thiện hoặc sáng tạo để tăng sự gắn kết. Số 2 nên bày tỏ nhu cầu rõ ràng, còn số 9 cần học cách cân bằng lý tưởng với thực tế. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 9 (Nhà nhân đạo) là sự kết hợp giữa sự chăm sóc và lý tưởng, tạo nên một gia đình đầy yêu thương nhưng cần sự cân bằng. Số 2 mang lại sự chu đáo và thấu hiểu, trong khi số 9 cung cấp lòng trắc ẩn và khát vọng cống hiến. Sự tương đồng về cảm xúc có thể bền vững, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Cả hai đều quan tâm đến người khác, tạo ra một gia đình ấm áp và ý nghĩa. Số 2 hỗ trợ số 9 bằng sự hòa giải, trong khi số 9 truyền cảm hứng cho số 2 với những mục tiêu lớn. Khả năng đồng cảm giúp họ phối hợp tốt trong các trách nhiệm gia đình.",
        "weaknesses": "Số 2 có thể cảm thấy số 9 quá xa cách hoặc thiếu thực tế, trong khi số 9 có thể thấy số 2 quá phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm gia đình vs. lý tưởng) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ phong phú nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa chăm sóc và nhân đạo có thể tạo ra một cuộc sống gia đình ý nghĩa. Việc cùng nhau tham gia các hoạt động từ thiện sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 tập trung vào cảm xúc, số 9 tập trung vào lý tưởng. Số 2 cần học cách độc lập, còn số 9 cần chú ý hơn đến gia đình. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như từ thiện hoặc làm việc chung vì cộng đồng. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 9 nên nỗ lực cân bằng lý tưởng với trách nhiệm gia đình. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 9,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 9 (Nhà nhân đạo) có thể hiệu quả trong các dự án cộng đồng hoặc sáng tạo. Số 2 mang lại sự tinh tế và kỹ năng xây dựng mối quan hệ, trong khi số 9 cung cấp lòng trắc ẩn và tầm nhìn lớn. Sự tương đồng về cảm xúc tạo nên một đội nhóm hài hòa, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng quan hệ và giải quyết xung đột, trong khi số 9 mang lại ý tưởng cao cả và sự đam mê. Họ bổ sung cho nhau, với số 2 mang lại sự linh hoạt và số 9 mang lại cảm hứng. Khả năng phối hợp tạo ra những dự án có ý nghĩa.",
        "weaknesses": "Số 2 có thể thấy số 9 thiếu thực tế, trong khi số 9 có thể cảm thấy số 2 thiếu tham vọng. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (cẩn thận vs. lý tưởng) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án từ thiện hoặc sáng tạo. Sự kết hợp giữa ngoại giao và nhân đạo có thể dẫn đến những dự án có tác động lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 chậm rãi, số 9 lý tưởng. Số 2 cần tự tin đóng góp ý kiến, còn số 9 cần thực tế hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 2 tập trung vào quan hệ đối ngoại và số 9 tập trung vào ý tưởng lớn. Số 2 nên chủ động bày tỏ quan điểm, còn số 9 cần tuân thủ kế hoạch thực tế. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp để đảm bảo đồng thuận."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 11 (Nhà truyền cảm hứng) mang lại sự kết hợp giữa sự nhạy cảm và tâm linh. Số 2 mang lại sự thấu hiểu và hỗ trợ, trong khi số 11 cung cấp sự sáng tạo, trực giác và năng lượng tâm linh. Sự tương tác này tạo ra một tình yêu độc đáo, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 2 hỗ trợ số 11 bằng sự quan tâm và khả năng hòa giải, trong khi số 11 truyền cảm hứng cho số 2 với sự sáng tạo và tầm nhìn tâm linh. Họ bổ sung cho nhau, với số 2 mang lại sự ổn định và số 11 mang lại sự mới mẻ. Khả năng đồng cảm tạo nên một mối quan hệ sâu sắc.",
        "weaknesses": "Số 2 có thể cảm thấy số 11 quá xa cách hoặc không thực tế, trong khi số 11 có thể thấy số 2 quá phụ thuộc hoặc thiếu sáng tạo. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (cảm xúc vs. tâm linh) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng phát triển nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa hỗ trợ và truyền cảm hứng có thể tạo ra một tình yêu phong phú. Việc cùng nhau tham gia các hoạt động tâm linh hoặc sáng tạo sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 11 ưu tiên tâm linh. Số 2 cần tự tin bày tỏ nhu cầu, còn số 11 cần chú ý hơn đến cảm xúc của số 2. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động như thiền, yoga hoặc sáng tạo nghệ thuật để tăng sự gắn kết. Số 2 nên bày tỏ nhu cầu rõ ràng, còn số 11 cần học cách thực tế hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Trung bình",
      "percentage": 65,
      "details": {
        "overview": "6/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 11 (Nhà truyền cảm hứng) là sự kết hợp giữa sự chăm sóc và tâm linh, tạo nên một gia đình độc đáo nhưng cần sự cân bằng. Số 2 mang lại sự chu đáo và thấu hiểu, trong khi số 11 cung cấp sự sáng tạo và năng lượng tâm linh. Sự tương phản này có thể hấp dẫn, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 cung cấp sự ấm áp và hỗ trợ, trong khi số 11 mang lại sự truyền cảm hứng và tầm nhìn tâm linh. Họ bổ sung cho nhau, với số 2 mang lại sự ổn định và số 11 mang lại sự mới mẻ. Khả năng đồng cảm giúp họ phối hợp trong các trách nhiệm gia đình.",
        "weaknesses": "Số 2 có thể cảm thấy số 11 quá xa cách hoặc không thực tế, trong khi số 11 có thể thấy số 2 quá phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. tâm linh) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng trở thành một mối quan hệ phong phú nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa chăm sóc và truyền cảm hứng có thể tạo ra một cuộc sống gia đình độc đáo. Việc cùng nhau tham gia các hoạt động tâm linh sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 tập trung vào cảm xúc, số 11 tập trung vào tâm linh. Số 2 cần học cách độc lập, còn số 11 cần chú ý hơn đến gia đình. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như thiền hoặc sáng tạo nghệ thuật. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 11 nên nỗ lực thực tế hơn. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 11,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 70,
      "details": {
        "overview": "7/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 11 (Nhà truyền cảm hứng) có thể hiệu quả trong các dự án sáng tạo hoặc tâm linh. Số 2 mang lại sự tinh tế và kỹ năng xây dựng mối quan hệ, trong khi số 11 cung cấp sự sáng tạo và trực giác. Sự tương phản này tạo nên một đội nhóm độc đáo, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng quan hệ và giải quyết xung đột, trong khi số 11 mang lại ý tưởng sáng tạo và năng lượng tâm linh. Họ bổ sung cho nhau, với số 2 mang lại sự ổn định và số 11 mang lại cảm hứng. Khả năng phối hợp tạo ra những dự án độc đáo.",
        "weaknesses": "Số 2 có thể thấy số 11 thiếu thực tế, trong khi số 11 có thể cảm thấy số 2 thiếu sáng tạo. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (cẩn thận vs. trực giác) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án sáng tạo hoặc tâm linh. Sự kết hợp giữa ngoại giao và truyền cảm hứng có thể dẫn đến những dự án có tác động lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 chậm rãi, số 11 trực giác. Số 2 cần tự tin đóng góp ý kiến, còn số 11 cần thực tế hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 2 tập trung vào quan hệ đối ngoại và số 11 tập trung vào sáng tạo. Số 2 nên chủ động bày tỏ quan điểm, còn số 11 cần tuân thủ kế hoạch thực tế. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp sáng tạo."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Người yêu",
      "compatibilityLevel": "Thấp",
      "percentage": 55,
      "details": {
        "overview": "5/10\nMối quan hệ giữa số 2 (Nhà ngoại giao) và số 22 (Nhà kiến tạo bậc thầy) có thể gặp thử thách do sự khác biệt trong cách tiếp cận. Số 2 mang lại sự nhạy cảm và thấu hiểu, trong khi số 22 tập trung vào mục tiêu lớn, thực tế và xây dựng. Sự tương phản này có thể hấp dẫn ban đầu, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá cảm xúc sâu hơn còn hạn chế.",
        "strengths": "Số 2 mang lại sự quan tâm và hỗ trợ, trong khi số 22 cung cấp sự ổn định và tầm nhìn dài hạn. Họ có thể bổ sung cho nhau, với số 2 làm dịu sự căng thẳng của số 22 và số 22 giúp số 2 có cấu trúc hơn. Khả năng tạo ra một mối quan hệ an toàn là điểm mạnh.",
        "weaknesses": "Số 2 có thể cảm thấy số 22 quá thực dụng hoặc xa cách, trong khi số 22 có thể thấy số 2 quá nhạy cảm hoặc phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột cảm xúc. Sự khác biệt trong ưu tiên (cảm xúc vs. mục tiêu) có thể gây hiểu lầm.",
        "potential": "Mối quan hệ này có tiềm năng nếu cả hai học cách tôn trọng sự khác biệt. Sự kết hợp giữa hỗ trợ và kiến tạo có thể tạo ra một tình yêu bền vững. Việc cùng nhau tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong cách tiếp cận: số 2 ưu tiên cảm xúc, số 22 ưu tiên mục tiêu lớn. Số 2 cần tự tin bày tỏ nhu cầu, còn số 22 cần thể hiện tình cảm nhiều hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tham gia các hoạt động thực tế như lập kế hoạch hoặc xây dựng dự án chung. Số 2 nên bày tỏ nhu cầu rõ ràng, còn số 22 cần học cách thể hiện tình cảm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Vợ chồng",
      "compatibilityLevel": "Thấp",
      "percentage": 50,
      "details": {
        "overview": "5/10\nHôn nhân giữa số 2 (Nhà ngoại giao) và số 22 (Nhà kiến tạo bậc thầy) có thể gặp nhiều thử thách do sự khác biệt trong ưu tiên. Số 2 mang lại sự chu đáo và thấu hiểu, trong khi số 22 tập trung vào mục tiêu lớn và thực tế. Sự tương phản này có thể tạo ra một gia đình ổn định, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 cung cấp sự ấm áp và hỗ trợ, trong khi số 22 mang lại sự ổn định và khả năng xây dựng nền tảng. Họ có thể bổ sung cho nhau, với số 2 làm dịu sự căng thẳng của số 22 và số 22 giúp số 2 có cấu trúc hơn. Khả năng tạo ra một gia đình an toàn là điểm mạnh.",
        "weaknesses": "Số 2 có thể cảm thấy số 22 quá xa cách hoặc kiểm soát, trong khi số 22 có thể thấy số 2 quá phụ thuộc. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong ưu tiên (trách nhiệm vs. mục tiêu) có thể gây căng thẳng.",
        "potential": "Hôn nhân này có tiềm năng nếu cả hai học cách bổ sung cho nhau. Sự kết hợp giữa chăm sóc và kiến tạo có thể tạo ra một cuộc sống gia đình ổn định. Việc cùng nhau tham gia các hoạt động thực tế sẽ giúp họ gắn kết hơn.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách sống: số 2 hướng tới cảm xúc, số 22 hướng tới mục tiêu. Số 2 cần học cách độc lập, còn số 22 cần thể hiện tình cảm nhiều hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết mâu thuẫn.",
        "suggestions": "Cả hai nên tổ chức các hoạt động gia đình như quản lý tài chính hoặc xây dựng dự án chung. Số 2 cần bày tỏ nhu cầu rõ ràng, còn số 22 nên nỗ lực thể hiện tình cảm. Duy trì giao tiếp cởi mở và tạo không gian để cả hai thể hiện bản thân."
      }
    },
    {
      "partnerNumber": 22,
      "relationshipType": "Đối tác",
      "compatibilityLevel": "Trung bình",
      "percentage": 60,
      "details": {
        "overview": "6/10\nSự hợp tác giữa số 2 (Nhà ngoại giao) và số 22 (Nhà kiến tạo bậc thầy) có thể hiệu quả trong các dự án dài hạn nếu tận dụng thế mạnh của nhau. Số 2 mang lại sự tinh tế và kỹ năng xây dựng mối quan hệ, trong khi số 22 cung cấp tầm nhìn lớn và khả năng thực hiện. Sự tương phản này có thể tạo ra một đội nhóm mạnh mẽ, nhưng thiếu thông tin về số linh hồn và định mệnh khiến việc đánh giá toàn diện còn hạn chế.",
        "strengths": "Số 2 hỗ trợ bằng cách xây dựng quan hệ và giải quyết xung đột, trong khi số 22 dẫn dắt dự án với tầm nhìn chiến lược. Họ bổ sung cho nhau, với số 2 mang lại sự linh hoạt và số 22 mang lại cấu trúc. Khả năng phối hợp tạo ra những dự án vững chắc.",
        "weaknesses": "Số 2 có thể cảm thấy số 22 quá kiểm soát hoặc xa cách, trong khi số 22 có thể thấy số 2 thiếu quyết đoán. Thiếu thông tin về số linh hồn và định mệnh làm hạn chế việc dự đoán xung đột. Sự khác biệt trong phong cách làm việc (linh hoạt vs. kỷ luật) có thể gây căng thẳng.",
        "potential": "Sự hợp tác này có tiềm năng trong các dự án xây dựng hoặc tổ chức. Sự kết hợp giữa ngoại giao và kiến tạo có thể dẫn đến thành công lớn. Việc phân chia vai trò rõ ràng sẽ giúp họ phát huy tối đa tiềm năng.",
        "challenges": "Thách thức chính là sự khác biệt trong phong cách làm việc: số 2 chậm rãi, số 22 quyết đoán. Số 2 cần tự tin đóng góp ý kiến, còn số 22 cần lắng nghe nhiều hơn. Thiếu thông tin về số linh hồn và định mệnh có thể làm khó việc giải quyết bất đồng.",
        "suggestions": "Cả hai nên phân chia vai trò, với số 2 tập trung vào quan hệ đối ngoại và số 22 tập trung vào thực hiện. Số 2 nên chủ động bày tỏ quan điểm, còn số 22 cần tôn trọng ý kiến của số 2. Duy trì giao tiếp thường xuyên và tổ chức các buổi họp định kỳ để đảm bảo đồng thuận."
      }
    }
  ]
}