{
  "1": {
    "Gieo Hạt": {
      "meaning": "Khám phá bản thân, xây dựng sự tự tin và khả năng lãnh đạo.",
      "advice": "Thử nghiệm những điều mới, phát triển kỹ năng lãnh đạo, tránh hành động ích kỷ.",
      "impact": "- Sự nghiệp: Cơ hội đảm nhận vai trò lãnh đạo.\n- Mối quan hệ: Học cách lắng nghe và thấu hiểu.\n- Cá nhân: Xác định giá trị cốt lõi của bản thân."
    },
    "Chín Muồi": {
      "meaning": "Phát triển tài năng lãnh đạo, sáng tạo và ảnh hưởng.",
      "advice": "Dẫn dắt đội nhóm, truyền cảm hứng, cân bằng giữa hợp tác và cá nhân.",
      "impact": "- Sự nghiệp: Thăng tiến trong vai trò quản lý.\n- Mối quan hệ: Tránh áp đặt ý kiến cá nhân.\n- Cá nhân: Tăng cường sự tự tin và quyết đoán."
    },
    "Thu Hoạch": {
      "meaning": "Thể hiện quyền lực, dẫn dắt và để lại di sản.",
      "advice": "Chia sẻ kinh nghiệm, xây dựng di sản, duy trì sự khiêm tốn.",
      "impact": "- Sự nghiệp: Đạt đỉnh cao trong vai trò lãnh đạo.\n- Mối quan hệ: Trở thành nguồn cảm hứng.\n- Cá nhân: Hoàn thiện bản thân và giá trị sống."
    }
  },
  "2": {
    "Gieo Hạt": {
      "meaning": "Học cách hợp tác, nhạy cảm và xây dựng mối quan hệ.",
      "advice": "Rèn luyện giao tiếp, thực hành thiền để tăng tự tin, tránh phụ thuộc.",
      "impact": "- Sự nghiệp: Hỗ trợ hiệu quả trong nhóm.\n- Mối quan hệ: Xây dựng tình bạn sâu sắc.\n- Cá nhân: Phát triển trực giác và sự đồng cảm."
    },
    "Chín Muồi": {
      "meaning": "Phát triển kỹ năng ngoại giao và trực giác nhạy bén.",
      "advice": "Học đàm phán, tham gia cộng đồng, tin vào trực giác của bản thân.",
      "impact": "- Sự nghiệp: Thăng tiến trong vai trò cố vấn hoặc ngoại giao.\n- Mối quan hệ: Đặt ranh giới lành mạnh.\n- Cá nhân: Cân bằng cảm xúc và lý trí."
    },
    "Thu Hoạch": {
      "meaning": "Hòa giải, hỗ trợ và kết nối cộng đồng.",
      "advice": "Chia sẻ kinh nghiệm, làm cầu nối, thực hành tâm linh để cân bằng.",
      "impact": "- Sự nghiệp: Đóng góp cho xã hội qua từ thiện.\n- Mối quan hệ: Xây dựng mạng lưới tình cảm bền vững.\n- Cá nhân: Hoàn thiện khả năng đồng cảm."
    }
  },
  "3": {
    "Gieo Hạt": {
      "meaning": "Khám phá sự sáng tạo, niềm vui và biểu đạt bản thân.",
      "advice": "Tham gia nghệ thuật, giao tiếp cởi mở, tránh phân tán năng lượng.",
      "impact": "- Sự nghiệp: Cơ hội trong sáng tạo và truyền thông.\n- Mối quan hệ: Tạo kết nối vui vẻ và tích cực.\n- Cá nhân: Tăng cường năng lượng sống."
    },
    "Chín Muồi": {
      "meaning": "Phát triển tài năng nghệ thuật và truyền cảm hứng.",
      "advice": "Tham gia viết lách hoặc biểu diễn, duy trì kỷ luật sáng tạo.",
      "impact": "- Sự nghiệp: Thăng tiến trong nghệ thuật hoặc quảng cáo.\n- Mối quan hệ: Lan tỏa năng lượng tích cực.\n- Cá nhân: Tự tin thể hiện bản thân."
    },
    "Thu Hoạch": {
      "meaning": "Chia sẻ sự sáng tạo và lan tỏa niềm vui.",
      "advice": "Dạy nghệ thuật, tổ chức sự kiện, cân bằng cảm xúc cá nhân.",
      "impact": "- Sự nghiệp: Để lại di sản sáng tạo.\n- Mối quan hệ: Xây dựng cộng đồng tích cực.\n- Cá nhân: Hoàn thiện khả năng biểu đạt."
    }
  },
  "4": {
    "Gieo Hạt": {
      "meaning": "Xây dựng nền tảng vững chắc, học kỷ luật và ổn định.",
      "advice": "Lập kế hoạch chi tiết, làm việc chăm chỉ, tránh cứng nhắc.",
      "impact": "- Sự nghiệp: Xây dựng cơ sở cho sự nghiệp lâu dài.\n- Mối quan hệ: Tạo dựng lòng tin bền vững.\n- Cá nhân: Phát triển sự kiên nhẫn."
    },
    "Chín Muồi": {
      "meaning": "Phát triển hệ thống và tổ chức hiệu quả.",
      "advice": "Quản lý dự án, cải tiến quy trình, linh hoạt với thay đổi.",
      "impact": "- Sự nghiệp: Thăng tiến trong tổ chức hoặc kỹ thuật.\n- Mối quan hệ: Xây dựng quan hệ ổn định.\n- Cá nhân: Tăng cường hiệu quả cá nhân."
    },
    "Thu Hoạch": {
      "meaning": "Củng cố di sản và đảm bảo tính bền vững.",
      "advice": "Chia sẻ kinh nghiệm tổ chức, cố vấn, đón nhận đổi mới.",
      "impact": "- Sự nghiệp: Xây dựng hệ thống bền vững.\n- Mối quan hệ: Duy trì quan hệ lâu dài.\n- Cá nhân: Hoàn thiện kỷ luật và trách nhiệm."
    }
  },
  "5": {
    "Gieo Hạt": {
      "meaning": "Khám phá tự do, linh hoạt và trải nghiệm mới.",
      "advice": "Du lịch, thử thách bản thân, tránh thiếu tập trung.",
      "impact": "- Sự nghiệp: Khám phá các ngành nghề đa dạng.\n- Mối quan hệ: Tạo kết nối phong phú.\n- Cá nhân: Phát triển khả năng thích nghi."
    },
    "Chín Muồi": {
      "meaning": "Phát triển sự linh hoạt và khả năng thích ứng.",
      "advice": "Quản lý thay đổi, đa nhiệm, duy trì cam kết lâu dài.",
      "impact": "- Sự nghiệp: Thành công trong truyền thông hoặc du lịch.\n- Mối quan hệ: Duy trì sự ổn định trong quan hệ.\n- Cá nhân: Tăng cường tính linh hoạt."
    },
    "Thu Hoạch": {
      "meaning": "Lan tỏa tinh thần tự do và truyền cảm hứng.",
      "advice": "Chia sẻ trải nghiệm, cố vấn, cân bằng trách nhiệm.",
      "impact": "- Sự nghiệp: Để lại di sản tự do và sáng tạo.\n- Mối quan hệ: Duy trì quan hệ đa dạng.\n- Cá nhân: Hoàn thiện khả năng thích nghi."
    }
  },
  "6": {
    "Gieo Hạt": {
      "meaning": "Học trách nhiệm, chăm sóc và xây dựng gia đình.",
      "advice": "Chăm sóc người thân, tham gia cộng đồng, tránh kiểm soát.",
      "impact": "- Sự nghiệp: Cơ hội trong dịch vụ hoặc giáo dục.\n- Mối quan hệ: Xây dựng tình cảm sâu sắc.\n- Cá nhân: Phát triển tình yêu thương."
    },
    "Chín Muồi": {
      "meaning": "Phát triển tình yêu và trách nhiệm xã hội.",
      "advice": "Cân bằng gia đình và công việc, hỗ trợ cộng đồng tích cực.",
      "impact": "- Sự nghiệp: Thăng tiến trong lĩnh vực xã hội hoặc chăm sóc.\n- Mối quan hệ: Xây dựng quan hệ bền vững.\n- Cá nhân: Tăng cường trách nhiệm."
    },
    "Thu Hoạch": {
      "meaning": "Truyền tải tình yêu và xây dựng cộng đồng.",
      "advice": "Cố vấn gia đình, tham gia từ thiện, duy trì sức khỏe.",
      "impact": "- Sự nghiệp: Để lại di sản cộng đồng.\n- Mối quan hệ: Duy trì tình cảm sâu sắc.\n- Cá nhân: Hoàn thiện tình yêu thương."
    }
  },
  "7": {
    "Gieo Hạt": {
      "meaning": "Khám phá tri thức và phát triển nội tâm.",
      "advice": "Đọc sách triết học, thực hành thiền, tránh cô lập bản thân.",
      "impact": "- Sự nghiệp: Cơ hội trong nghiên cứu hoặc giáo dục.\n- Mối quan hệ: Học cách cởi mở hơn.\n- Cá nhân: Tăng cường trực giác."
    },
    "Chín Muồi": {
      "meaning": "Phát triển trí tuệ và trực giác sâu sắc.",
      "advice": "Nghiên cứu chuyên sâu, giảng dạy, cân bằng giao tiếp.",
      "impact": "- Sự nghiệp: Thăng tiến trong phân tích hoặc tư vấn.\n- Mối quan hệ: Thể hiện cảm xúc rõ ràng.\n- Cá nhân: Kết nối tâm linh mạnh mẽ."
    },
    "Thu Hoạch": {
      "meaning": "Truyền tải tri thức và dẫn dắt tinh thần.",
      "advice": "Chia sẻ qua sách hoặc tư vấn, thiền để giữ sức khỏe.",
      "impact": "- Sự nghiệp: Để lại di sản giáo dục hoặc tâm linh.\n- Mối quan hệ: Xây dựng quan hệ sâu sắc.\n- Cá nhân: Hoàn thiện di sản tinh thần."
    }
  },
  "8": {
    "Gieo Hạt": {
      "meaning": "Học tham vọng, quyền lực và quản lý tài chính.",
      "advice": "Đặt mục tiêu lớn, học đầu tư, tránh tham lam hoặc ích kỷ.",
      "impact": "- Sự nghiệp: Cơ hội trong kinh doanh hoặc quản lý.\n- Mối quan hệ: Xây dựng uy tín cá nhân.\n- Cá nhân: Phát triển tham vọng lành mạnh."
    },
    "Chín Muồi": {
      "meaning": "Phát triển quyền lực và thành công vật chất.",
      "advice": "Quản lý tài chính hiệu quả, lãnh đạo công bằng, cân bằng tinh thần.",
      "impact": "- Sự nghiệp: Thăng tiến trong vai trò lãnh đạo.\n- Mối quan hệ: Duy trì sự công bằng.\n- Cá nhân: Tăng cường quyền lực cá nhân."
    },
    "Thu Hoạch": {
      "meaning": "Xây dựng di sản tài chính và quyền lực.",
      "advice": "Cố vấn kinh doanh, tham gia từ thiện, duy trì đạo đức.",
      "impact": "- Sự nghiệp: Để lại di sản kinh doanh bền vững.\n- Mối quan hệ: Xây dựng quan hệ quyền lực.\n- Cá nhân: Hoàn thiện đạo đức cá nhân."
    }
  },
  "9": {
    "Gieo Hạt": {
      "meaning": "Học nhân ái, lý tưởng và cống hiến cho cộng đồng.",
      "advice": "Tham gia từ thiện, học tha thứ, tránh lý tưởng hóa quá mức.",
      "impact": "- Sự nghiệp: Cơ hội trong xã hội hoặc nhân đạo.\n- Mối quan hệ: Xây dựng tình cảm rộng lớn.\n- Cá nhân: Phát triển lòng nhân ái."
    },
    "Chín Muồi": {
      "meaning": "Phát triển lý tưởng và cống hiến cho cộng đồng.",
      "advice": "Lãnh đạo các dự án từ thiện, truyền cảm hứng, cân bằng cảm xúc.",
      "impact": "- Sự nghiệp: Thăng tiến trong nhân đạo hoặc giáo dục.\n- Mối quan hệ: Xây dựng quan hệ sâu sắc.\n- Cá nhân: Tăng cường lý tưởng sống."
    },
    "Thu Hoạch": {
      "meaning": "Truyền tải lòng nhân ái và để lại di sản tinh thần.",
      "advice": "Chia sẻ qua giáo dục hoặc từ thiện, thiền để giữ sức khỏe.",
      "impact": "- Sự nghiệp: Để lại di sản nhân đạo.\n- Mối quan hệ: Xây dựng tình cảm toàn cầu.\n- Cá nhân: Hoàn thiện lòng nhân ái."
    }
  }
}