{
  "numerology_peaks_and_challenges": {
    "description": "Phân tích các đỉnh cao và thử thách trong thần số học cho 12 con số đường đời, dựa trên năm sinh mẫu 1996.",
    "life_paths": [
      {
        "life_path": 1,
        "stages": [
          {
            "stage": "5.1",
            "age_range": "21–29 (2016–2025)",
            "peak": 1,
            "challenge": 4,
            "description": "Giai đoạn đỉnh cao đầu tiên - đỉnh cao của tuổi trẻ. Đỉnh cao số 1 mang đến năng lượng của sự độc lập, sáng tạo và lãnh đạo. Đây là thời kỳ bạn được khuyến khích khẳng định bản thân, theo đuổi đam mê và xây dựng dấu ấn cá nhân. Tuy nhiên, thử thách số 4 yêu cầu bạn học cách duy trì kỷ luật và xây dựng nền tảng vững chắc, thay vì chỉ chạy theo tham vọng. Sự kiên nhẫn và tổ chức là chìa khóa để vượt qua khó khăn."
          },
          {
            "stage": "5.2",
            "age_range": "30–38 (2025–2034)",
            "peak": 6,
            "challenge": 2,
            "description": "Giai đoạn đỉnh cao thứ 2 - đỉnh cao của kinh nghiệm. Đỉnh cao số 6 nhấn mạnh trách nhiệm, gia đình và sự hài hòa. Bạn sẽ tìm thấy cơ hội để xây dựng các mối quan hệ bền vững và đóng góp cho cộng đồng. Thử thách số 2 đòi hỏi bạn học cách hợp tác và cân bằng cảm xúc, tránh phụ thuộc quá mức vào người khác. Kỹ năng giao tiếp và sự linh hoạt sẽ giúp bạn vượt qua giai đoạn này."
          },
          {
            "stage": "5.3",
            "age_range": "39–47 (2034–2043)",
            "peak": 7,
            "challenge": 3,
            "description": "Giai đoạn đỉnh cao thứ 3 - đỉnh cao của sự trưởng thành. Đỉnh cao số 7 thúc đẩy bạn tìm kiếm tri thức, phát triển tâm linh và hiểu biết sâu sắc về bản thân. Đây là thời kỳ lý tưởng để nghiên cứu, suy ngẫm và khám phá ý nghĩa cuộc sống. Thử thách số 3 yêu cầu bạn kiểm soát sự phân tán năng lượng và học cách thể hiện bản thân một cách rõ ràng. Tập trung và sáng tạo sẽ là chìa khóa."
          },
          {
            "stage": "5.4",
            "age_range": "48–56 (2043–2052)",
            "peak": 8,
            "challenge": 1,
            "description": "Giai đoạn đỉnh cao 4 - đỉnh cao của tinh hoa trưởng thành. Đỉnh cao số 8 mang đến cơ hội đạt được thành công vật chất, quyền lực và sự công nhận. Đây là thời kỳ bạn có thể gặt hái thành quả từ những nỗ lực trước đó. Thử thách số 1 đòi hỏi bạn giữ vững sự tự tin và tránh cái tôi quá lớn. Quản lý tài chính và lãnh đạo công bằng sẽ giúp bạn tỏa sáng."
          }
        ]
      },
      {
        "life_path": 2,
        "stages": [
          {
            "stage": "5.1",
            "age_range": "21–29 (2016–2025)",
            "peak": 2,
            "challenge": 5,
            "description": "Giai đoạn đỉnh cao đầu tiên - đỉnh cao của tuổi trẻ. Đỉnh cao số 2 khuyến khích sự hợp tác, nhạy bén và xây dựng mối quan hệ. Đây là thời kỳ bạn học cách làm việc nhóm và phát triển trực giác. Thử thách số 5 yêu cầu bạn thích nghi với sự thay đổi và tránh bị cuốn vào sự bất ổn. Tìm kiếm sự cân bằng giữa tự do và trách nhiệm là bài học quan trọng."
          },
          {
            "stage": "5.2",
            "age_range": "30–38 (2025–2034)",
            "peak": 7,
            "challenge": 3,
            "description": "Giai đoạn đỉnh cao thứ 2 - đỉnh cao của kinh nghiệm. Đỉnh cao số 7 mang đến cơ hội khám phá nội tâm, tri thức và tâm linh. Bạn sẽ tìm thấy sức mạnh trong sự tĩnh lặng và suy ngẫm. Thử thách số 3 đòi hỏi bạn vượt qua sự thiếu tập trung và học cách thể hiện ý tưởng một cách rõ ràng. Kiên nhẫn và sáng tạo sẽ giúp bạn phát triển."
          },
          {
            "stage": "5.3",
            "age_range": "39–47 (2034–2043)",
            "peak": 8,
            "challenge": 4,
            "description": "Giai đoạn đỉnh cao thứ 3 - đỉnh cao của sự trưởng thành. Đỉnh cao số 8 thúc đẩy bạn đạt được thành công và quản lý hiệu quả các nguồn lực. Đây là thời kỳ để xây dựng sự nghiệp và uy tín. Thử thách số 4 yêu cầu bạn duy trì kỷ luật và tránh cứng nhắc. Sự tổ chức và linh hoạt sẽ giúp bạn vượt qua khó khăn."
          },
          {
            "stage": "5.4",
            "age_range": "48–56 (2043–2052)",
            "peak": 9,
            "challenge": 2,
            "description": "Giai đoạn đỉnh cao 4 - đỉnh cao của tinh hoa trưởng thành. Đỉnh cao số 9 mang đến năng lượng nhân đạo, lý tưởng và cống hiến. Bạn sẽ tìm thấy ý nghĩa trong việc giúp đỡ cộng đồng. Thử thách số 2 đòi hỏi bạn học cách hợp tác và kiểm soát cảm xúc. Sự đồng cảm và giao tiếp sẽ là chìa khóa."
          }
        ]
      },
      {
        "life_path": 3,
        "stages": [
          {
            "stage": "5.1",
            "age_range": "21–29 (2016–2025)",
            "peak": 3,
            "challenge": 6,
            "description": "Giai đoạn đỉnh cao đầu tiên - đỉnh cao của tuổi trẻ. Đỉnh cao số 3 khuyến khích sự sáng tạo, biểu đạt và niềm vui. Đây là thời kỳ bạn tỏa sáng qua nghệ thuật, giao tiếp hoặc các dự án cá nhân. Thử thách số 6 yêu cầu bạn cân bằng giữa trách nhiệm gia đình và tự do cá nhân. Học cách đặt ranh giới sẽ giúp bạn phát triển."
          },
          {
            "stage": "5.2",
            "age_range": "30–38 (2025–2034)",
            "peak": 8,
            "challenge": 4,
            "description": "Giai đoạn đỉnh cao thứ 2 - đỉnh cao của kinh nghiệm. Đỉnh cao số 8 mang đến cơ hội đạt được thành công vật chất và quyền lực. Bạn sẽ học cách quản lý tài chính và lãnh đạo hiệu quả. Thử thách số 4 đòi hỏi bạn xây dựng nền tảng vững chắc và tránh cứng nhắc. Kỷ luật và sự kiên nhẫn là chìa khóa."
          },
          {
            "stage": "5.3",
            "age_range": "39–47 (2034–2043)",
            "peak": 9,
            "challenge": 5,
            "description": "Giai đoạn đỉnh cao thứ 3 - đỉnh cao của sự trưởng thành. Đỉnh cao số 9 thúc đẩy bạn theo đuổi lý tưởng và cống hiến cho cộng đồng. Đây là thời kỳ tìm kiếm ý nghĩa sâu sắc. Thử thách số 5 yêu cầu bạn thích nghi với sự thay đổi và tránh phân tán năng lượng. Sự linh hoạt và tập trung sẽ giúp bạn tỏa sáng."
          },
          {
            "stage": "5.4",
            "age_range": "48–56 (2043–2052)",
            "peak": 1,
            "challenge": 3,
            "description": "Giai đoạn đỉnh cao 4 - đỉnh cao của tinh hoa trưởng thành. Đỉnh cao số 1 mang đến cơ hội khẳng định bản thân và lãnh đạo. Bạn sẽ gặt hái thành quả từ sự độc lập và sáng tạo. Thử thách số 3 đòi hỏi bạn kiểm soát sự phân tán và thể hiện ý tưởng rõ ràng. Tập trung và giao tiếp là chìa khóa."
          }
        ]
      },
      {
        "life_path": 4,
        "stages": [
          {
            "stage": "5.1",
            "age_range": "21–29 (2016–2025)",
            "peak": 4,
            "challenge": 7,
            "description": "Giai đoạn đỉnh cao đầu tiên - đỉnh cao của tuổi trẻ. Đỉnh cao số 4 khuyến khích bạn xây dựng nền tảng vững chắc thông qua kỷ luật và tổ chức. Đây là thời kỳ đặt nền móng cho tương lai. Thử thách số 7 yêu cầu bạn vượt qua sự cô lập và học cách tin tưởng trực giác. Kiên nhẫn và suy ngẫm sẽ giúp bạn phát triển."
          },
          {
            "stage": "5.2",
            "age_range": "30–38 (2025–2034)",
            "peak": 9,
            "challenge": 5,
            "description": "Giai đoạn đỉnh cao thứ 2 - đỉnh cao của kinh nghiệm. Đỉnh cao số 9 mang đến cơ hội cống hiến và theo đuổi lý tưởng. Bạn sẽ tìm thấy ý nghĩa trong việc giúp đỡ người khác. Thử thách số 5 đòi hỏi bạn thích nghi với sự thay đổi và tránh phân tán. Sự linh hoạt và tập trung là chìa khóa."
          },
          {
            "stage": "5.3",
            "age_range": "39–47 (2034–2043)",
            "peak": 1,
            "challenge": 6,
            "description": "Giai đoạn đỉnh cao thứ 3 - đỉnh cao của sự trưởng thành. Đỉnh cao số 1 thúc đẩy bạn khẳng định bản thân và lãnh đạo. Đây là thời kỳ để tỏa sáng qua sự độc lập và sáng tạo. Thử thách số 6 yêu cầu bạn cân bằng trách nhiệm gia đình và mục tiêu cá nhân. Đặt ranh giới và quản lý thời gian sẽ giúp bạn thành công."
          },
          {
            "stage": "5.4",
            "age_range": "48–56 (2043–2052)",
            "peak": 2,
            "challenge": 4,
            "description": "Giai đoạn đỉnh cao 4 - đỉnh cao của tinh hoa trưởng thành. Đỉnh cao số 2 mang đến cơ hội hợp tác và xây dựng mối quan hệ bền vững. Bạn sẽ tìm thấy sức mạnh trong sự đồng hành. Thử thách số 4 đòi hỏi bạn duy trì kỷ luật và tránh cứng nhắc. Sự tổ chức và linh hoạt là chìa khóa."
          }
        ]
      },
      {
        "life_path": 5,
        "stages": [
          {
            "stage": "5.1",
            "age_range": "21–29 (2016–2025)",
            "peak": 9,
            "challenge": 5,
            "description": "Giai đoạn đỉnh cao đầu tiên - đỉnh cao của tuổi trẻ. Đỉnh cao số 9 mang đến năng lượng nhân đạo và lý tưởng, khuyến khích bạn khám phá thế giới và cống hiến. Đây là thời kỳ trải nghiệm tự do và mở rộng tầm nhìn. Thử thách số 5 yêu cầu bạn kiểm soát sự bốc đồng và học cách tập trung. Tìm kiếm sự cân bằng giữa khám phá và trách nhiệm là bài học quan trọng."
          },
          {
            "stage": "5.2",
            "age_range": "30–38 (2025–2034)",
            "peak": 5,
            "challenge": 0,
            "description": "Giai đoạn đỉnh cao thứ 2 - đỉnh cao của kinh nghiệm. Đỉnh cao số 5 thúc đẩy sự tự do, thay đổi và trải nghiệm mới. Bạn sẽ có cơ hội khám phá các con đường mới và phát triển sự linh hoạt. Thử thách số 0 biểu thị tiềm năng vô hạn nhưng cũng đòi hỏi bạn tìm ra hướng đi rõ ràng. Sự kiên định và mục tiêu sẽ giúp bạn tận dụng giai đoạn này."
          },
          {
            "stage": "5.3",
            "age_range": "39–47 (2034–2043)",
            "peak": 5,
            "challenge": 5,
            "description": "Giai đoạn đỉnh cao thứ 3 - đỉnh cao của sự trưởng thành. Đỉnh cao số 5 tiếp tục mang đến năng lượng tự do và thích nghi. Đây là thời kỳ bạn học cách cân bằng giữa thay đổi và ổn định. Thử thách số 5 yêu cầu bạn vượt qua sự bốc đồng và xây dựng sự tập trung. Kỹ năng quản lý thời gian và ưu tiên sẽ giúp bạn thành công."
          },
          {
            "stage": "5.4",
            "age_range": "48–56 (2043–2052)",
            "peak": 9,
            "challenge": 5,
            "description": "Giai đoạn đỉnh cao 4 - đỉnh cao của tinh hoa trưởng thành. Đỉnh cao số 9 khuyến khích bạn cống hiến và hoàn thiện bản thân thông qua các hoạt động nhân đạo. Đây là thời kỳ gặt hái ý nghĩa cuộc sống. Thử thách số 5 đòi hỏi bạn kiểm soát sự phân tán và duy trì mục tiêu. Sự tập trung và lòng trắc ẩn sẽ giúp bạn tỏa sáng."
          }
        ]
      },
      {
        "life_path": 6,
        "stages": [
          {
            "stage": "5.1",
            "age_range": "21–29 (2016–2025)",
            "peak": 6,
            "challenge": 9,
            "description": "Giai đoạn đỉnh cao đầu tiên - đỉnh cao của tuổi trẻ. Đỉnh cao số 6 mang đến năng lượng trách nhiệm, gia đình và sự hài hòa. Đây là thời kỳ bạn học cách chăm sóc người khác và xây dựng mối quan hệ. Thử thách số 9 yêu cầu bạn cân bằng giữa lý tưởng cá nhân và nhu cầu thực tế. Học cách buông bỏ và tập trung sẽ giúp bạn phát triển."
          },
          {
            "stage": "5.2",
            "age_range": "30–38 (2025–2034)",
            "peak": 2,
            "challenge": 7,
            "description": "Giai đoạn đỉnh cao thứ 2 - đỉnh cao của kinh nghiệm. Đỉnh cao số 2 thúc đẩy sự hợp tác, nhạy bén và xây dựng mối quan hệ. Bạn sẽ tìm thấy sức mạnh trong làm việc nhóm. Thử thách số 7 đòi hỏi bạn vượt qua sự cô lập và tin tưởng trực giác. Suy ngẫm và giao tiếp sẽ là chìa khóa."
          },
          {
            "stage": "5.3",
            "age_range": "39–47 (2034–2043)",
            "peak": 3,
            "challenge": 8,
            "description": "Giai đoạn đỉnh cao thứ 3 - đỉnh cao của sự trưởng thành. Đỉnh cao số 3 khuyến khích sự sáng tạo và thể hiện bản thân. Đây là thời kỳ bạn tỏa sáng qua nghệ thuật hoặc giao tiếp. Thử thách số 8 yêu cầu bạn quản lý tài chính và tránh tham vọng quá mức. Sự cân bằng và tổ chức sẽ giúp bạn thành công."
          },
          {
            "stage": "5.4",
            "age_range": "48–56 (2043–2052)",
            "peak": 4,
            "challenge": 6,
            "description": "Giai đoạn đỉnh cao 4 - đỉnh cao của tinh hoa trưởng thành. Đỉnh cao số 4 mang đến cơ hội xây dựng nền tảng lâu dài và ổn định. Bạn sẽ gặt hái thành quả từ sự kiên nhẫn. Thử thách số 6 đòi hỏi bạn cân bằng trách nhiệm gia đình và mục tiêu cá nhân. Quản lý thời gian và đặt ranh giới là chìa khóa."
          }
        ]
      },
      {
        "life_path": 7,
        "stages": [
          {
            "stage": "5.1",
            "age_range": "21–29 (2016–2025)",
            "peak": 7,
            "challenge": 1,
            "description": "Giai đoạn đỉnh cao đầu tiên - đỉnh cao của tuổi trẻ. Đỉnh cao số 7 khuyến khích bạn khám phá nội tâm, tri thức và tâm linh. Đây là thời kỳ lý tưởng để nghiên cứu và suy ngẫm. Thử thách số 1 yêu cầu bạn vượt qua sự tự nghi ngờ và khẳng định bản thân. Tự tin và kiên nhẫn sẽ giúp bạn phát triển."
          },
          {
            "stage": "5.2",
            "age_range": "30–38 (2025–2034)",
            "peak": 3,
            "challenge": 9,
            "description": "Giai đoạn đỉnh cao thứ 2 - đỉnh cao của kinh nghiệm. Đỉnh cao số 3 mang đến cơ hội sáng tạo và thể hiện bản thân. Bạn sẽ tìm thấy niềm vui trong giao tiếp và nghệ thuật. Thử thách số 9 đòi hỏi bạn cân bằng lý tưởng và thực tế. Học cách buông bỏ và tập trung sẽ là chìa khóa."
          },
          {
            "stage": "5.3",
            "age_range": "39–47 (2034–2043)",
            "peak": 4,
            "challenge": 1,
            "description": "Giai đoạn đỉnh cao thứ 3 - đỉnh cao của sự trưởng thành. Đỉnh cao số 4 thúc đẩy bạn xây dựng nền tảng vững chắc thông qua kỷ luật và tổ chức. Đây là thời kỳ đặt nền móng lâu dài. Thử thách số 1 yêu cầu bạn giữ vững sự tự tin và tránh cái tôi quá lớn. Kiên nhẫn và lãnh đạo sẽ giúp bạn thành công."
          },
          {
            "stage": "5.4",
            "age_range": "48–56 (2043–2052)",
            "peak": 5,
            "challenge": 7,
            "description": "Giai đoạn đỉnh cao 4 - đỉnh cao của tinh hoa trưởng thành. Đỉnh cao số 5 mang đến năng lượng tự do và thay đổi. Bạn sẽ có cơ hội khám phá các con đường mới. Thử thách số 7 đòi hỏi bạn vượt qua sự cô lập và tin tưởng trực giác. Suy ngẫm và linh hoạt là chìa khóa."
          }
        ]
      },
      {
        "life_path": 8,
        "stages": [
          {
            "stage": "5.1",
            "age_range": "21–29 (2016–2025)",
            "peak": 8,
            "challenge": 2,
            "description": "Giai đoạn đỉnh cao đầu tiên - đỉnh cao của tuổi trẻ. Đỉnh cao số 8 mang đến cơ hội đạt được thành công vật chất và quyền lực. Đây là thời kỳ bạn học cách quản lý và lãnh đạo. Thử thách số 2 yêu cầu bạn học cách hợp tác và kiểm soát cảm xúc. Sự đồng cảm và giao tiếp sẽ giúp bạn phát triển."
          },
          {
            "stage": "5.2",
            "age_range": "30–38 (2025–2034)",
            "peak": 4,
            "challenge": 1,
            "description": "Giai đoạn đỉnh cao thứ 2 - đỉnh cao của kinh nghiệm. Đỉnh cao số 4 khuyến khích bạn xây dựng nền tảng vững chắc thông qua kỷ luật và tổ chức. Đây là thời kỳ đặt nền móng cho tương lai. Thử thách số 1 đòi hỏi bạn giữ vững sự tự tin và tránh cái tôi quá lớn. Kiên nhẫn và lãnh đạo là chìa khóa."
          },
          {
            "stage": "5.3",
            "age_range": "39–47 (2034–2043)",
            "peak": 5,
            "challenge": 2,
            "description": "Giai đoạn đỉnh cao thứ 3 - đỉnh cao của sự trưởng thành. Đỉnh cao số 5 mang đến năng lượng tự do và thay đổi. Bạn sẽ có cơ hội khám phá các con đường mới và phát triển sự linh hoạt. Thử thách số 2 yêu cầu bạn hợp tác và kiểm soát cảm xúc. Giao tiếp và đồng cảm sẽ giúp bạn thành công."
          },
          {
            "stage": "5.4",
            "age_range": "48–56 (2043–2052)",
            "peak": 6,
            "challenge": 8,
            "description": "Giai đoạn đỉnh cao 4 - đỉnh cao của tinh hoa trưởng thành. Đỉnh cao số 6 mang đến cơ hội xây dựng sự hài hòa và trách nhiệm. Bạn sẽ gặt hái thành quả từ các mối quan hệ. Thử thách số 8 đòi hỏi bạn quản lý tài chính và tránh tham vọng quá mức. Sự cân bằng và tổ chức là chìa khóa."
          }
        ]
      },
      {
        "life_path": 9,
        "stages": [
          {
            "stage": "5.1",
            "age_range": "21–29 (2016–2025)",
            "peak": 9,
            "challenge": 3,
            "description": "Giai đoạn đỉnh cao đầu tiên - đỉnh cao của tuổi trẻ. Đỉnh cao số 9 khuyến khích bạn theo đuổi lý tưởng và cống hiến cho cộng đồng. Đây là thời kỳ khám phá ý nghĩa cuộc sống. Thử thách số 3 yêu cầu bạn kiểm soát sự phân tán và thể hiện ý tưởng rõ ràng. Tập trung và sáng tạo sẽ giúp bạn phát triển."
          },
          {
            "stage": "5.2",
            "age_range": "30–38 (2025–2034)",
            "peak": 5,
            "challenge": 2,
            "description": "Giai đoạn đỉnh cao thứ 2 - đỉnh cao của kinh nghiệm. Đỉnh cao số 5 mang đến năng lượng tự do và thay đổi. Bạn sẽ có cơ hội khám phá các con đường mới và phát triển sự linh hoạt. Thử thách số 2 đòi hỏi bạn hợp tác và kiểm soát cảm xúc. Giao tiếp và đồng cảm là chìa khóa."
          },
          {
            "stage": "5.3",
            "age_range": "39–47 (2034–2043)",
            "peak": 6,
            "challenge": 3,
            "description": "Giai đoạn đỉnh cao thứ 3 - đỉnh cao của sự trưởng thành. Đỉnh cao số 6 thúc đẩy bạn xây dựng sự hài hòa và trách nhiệm. Đây là thời kỳ tập trung vào gia đình và cộng đồng. Thử thách số 3 yêu cầu bạn kiểm soát sự phân tán và thể hiện ý tưởng rõ ràng. Sáng tạo và quản lý thời gian sẽ giúp bạn thành công."
          },
          {
            "stage": "5.4",
            "age_range": "48–56 (2043–2052)",
            "peak": 7,
            "challenge": 9,
            "description": "Giai đoạn đỉnh cao 4 - đỉnh cao của tinh hoa trưởng thành. Đỉnh cao số 7 mang đến cơ hội khám phá tri thức và tâm linh. Bạn sẽ tìm thấy ý nghĩa trong suy ngẫm và hoàn thiện bản thân. Thử thách số 9 đòi hỏi bạn cân bằng lý tưởng và thực tế. Kiên nhẫn và tập trung là chìa khóa."
          }
        ]
      },
      {
        "life_path": 11,
        "stages": [
          {
            "stage": "5.1",
            "age_range": "21–29 (2016–2025)",
            "peak": 11,
            "challenge": 4,
            "description": "Giai đoạn đỉnh cao đầu tiên - đỉnh cao của tuổi trẻ. Đỉnh cao số 11 mang đến năng lượng trực giác, cảm hứng và tâm linh. Đây là thời kỳ bạn được khuyến khích dẫn dắt và truyền cảm hứng. Thử thách số 4 yêu cầu bạn xây dựng nền tảng vững chắc và duy trì kỷ luật. Kiên nhẫn và tổ chức sẽ giúp bạn phát triển."
          },
          {
            "stage": "5.2",
            "age_range": "30–38 (2025–2034)",
            "peak": 7,
            "challenge": 3,
            "description": "Giai đoạn đỉnh cao thứ 2 - đỉnh cao của kinh nghiệm. Đỉnh cao số 7 thúc đẩy bạn khám phá tri thức và tâm linh. Bạn sẽ tìm thấy sức mạnh trong suy ngẫm và trực giác. Thử thách số 3 đòi hỏi bạn kiểm soát sự phân tán và thể hiện ý tưởng rõ ràng. Sáng tạo và tập trung là chìa khóa."
          },
          {
            "stage": "5.3",
            "age_range": "39–47 (2034–2043)",
            "peak": 8,
            "challenge": 4,
            "description": "Giai đoạn đỉnh cao thứ 3 - đỉnh cao của sự trưởng thành. Đỉnh cao số 8 mang đến cơ hội đạt được thành công và quản lý hiệu quả các nguồn lực. Đây là thời kỳ xây dựng uy tín. Thử thách số 4 yêu cầu bạn duy trì kỷ luật và tránh cứng nhắc. Sự tổ chức và linh hoạt sẽ giúp bạn thành công."
          },
          {
            "stage": "5.4",
            "age_range": "48–56 (2043–2052)",
            "peak": 9,
            "challenge": 11,
            "description": "Giai đoạn đỉnh cao 4 - đỉnh cao của tinh hoa trưởng thành. Đỉnh cao số 9 khuyến khích bạn cống hiến và theo đuổi lý tưởng. Bạn sẽ tìm thấy ý nghĩa trong việc giúp đỡ cộng đồng. Thử thách số 11 đòi hỏi bạn cân bằng trực giác và thực tế. Kiên nhẫn và giác ngộ là chìa khóa."
          }
        ]
      },
      {
        "life_path": "22/4",
        "stages": [
          {
            "stage": "5.1",
            "age_range": "21–29 (2016–2025)",
            "peak": 4,
            "challenge": 5,
            "description": "Giai đoạn đỉnh cao đầu tiên - đỉnh cao của tuổi trẻ. Đỉnh cao số 4 mang đến cơ hội xây dựng nền tảng vững chắc thông qua kỷ luật và thực tiễn. Đây là thời kỳ đặt nền móng cho các dự án lớn. Thử thách số 5 yêu cầu bạn thích nghi với sự thay đổi và tránh phân tán. Sự tập trung và linh hoạt là chìa khóa."
          },
          {
            "stage": "5.2",
            "age_range": "30–38 (2025–2034)",
            "peak": 9,
            "challenge": 4,
            "description": "Giai đoạn đỉnh cao thứ 2 - đỉnh cao của kinh nghiệm. Đỉnh cao số 9 thúc đẩy bạn cống hiến và theo đuổi lý tưởng. Bạn sẽ tìm thấy ý nghĩa trong việc xây dựng các giá trị lâu dài. Thử thách số 4 đòi hỏi bạn duy trì kỷ luật và tránh cứng nhắc. Kiên nhẫn và tổ chức sẽ giúp bạn thành công."
          },
          {
            "stage": "5.3",
            "age_range": "39–47 (2034–2043)",
            "peak": 1,
            "challenge": 5,
            "description": "Giai đoạn đỉnh cao thứ 3 - đỉnh cao của sự trưởng thành. Đỉnh cao số 1 mang đến cơ hội khẳng định bản thân và lãnh đạo. Đây là thời kỳ bạn tỏa sáng qua sự độc lập và sáng tạo. Thử thách số 5 yêu cầu bạn thích nghi với sự thay đổi và tránh bốc đồng. Sự tập trung và linh hoạt sẽ giúp bạn phát triển."
          },
          {
            "stage": "5.4",
            "age_range": "48–56 (2043–2052)",
            "peak": 2,
            "challenge": 22,
            "description": "Giai đoạn đỉnh cao 4 - đỉnh cao của tinh hoa trưởng thành. Đỉnh cao số 2 khuyến khích bạn hợp tác và xây dựng mối quan hệ bền vững. Bạn sẽ gặt hái thành quả từ sự đồng hành. Thử thách số 22 đòi hỏi bạn cân bằng giữa tầm nhìn lớn và chi tiết thực tiễn. Kiên nhẫn và tổ chức là chìa khóa."
          }
        ]
      }
    ],
    "notes": [
      "Các đỉnh cao và thử thách được giả định dựa trên số đường đời và mẫu ví dụ. Để có kết quả chính xác, cần cung cấp ngày, tháng, năm sinh cụ thể.",
      "Thông tin chi tiết hơn về luận giải yêu cầu nâng cấp VIP, như trong mẫu gốc."
    ]
  }
}